FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 0 : Write '1' to enable interrupt for event END */
#define AAR_INTENSET_END_Pos                 ( 0UL )                           /*!< Position of END field. */
#define AAR_INTENSET_END_Msk                 ( 0x1UL << AAR_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define AAR_INTENSET_END_Disabled            ( 0UL )                           /*!< Read: Disabled */
#define AAR_INTENSET_END_Enabled             ( 1UL )                           /*!< Read: Enabled */
#define AAR_INTENSET_END_Set                 ( 1UL )                           /*!< Enable */

/* Register: AAR_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Write '1' to disable interrupt for event NOTRESOLVED */
#define AAR_INTENCLR_NOTRESOLVED_Pos         ( 2UL )                                   /*!< Position of NOTRESOLVED field. */
#define AAR_INTENCLR_NOTRESOLVED_Msk         ( 0x1UL << AAR_INTENCLR_NOTRESOLVED_Pos ) /*!< Bit mask of NOTRESOLVED field. */
#define AAR_INTENCLR_NOTRESOLVED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define AAR_INTENCLR_NOTRESOLVED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define AAR_INTENCLR_NOTRESOLVED_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event RESOLVED */
#define AAR_INTENCLR_RESOLVED_Pos            ( 1UL )                                /*!< Position of RESOLVED field. */
#define AAR_INTENCLR_RESOLVED_Msk            ( 0x1UL << AAR_INTENCLR_RESOLVED_Pos ) /*!< Bit mask of RESOLVED field. */
#define AAR_INTENCLR_RESOLVED_Disabled       ( 0UL )                                /*!< Read: Disabled */
#define AAR_INTENCLR_RESOLVED_Enabled        ( 1UL )                                /*!< Read: Enabled */
#define AAR_INTENCLR_RESOLVED_Clear          ( 1UL )                                /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event END */
#define AAR_INTENCLR_END_Pos                 ( 0UL )                           /*!< Position of END field. */
#define AAR_INTENCLR_END_Msk                 ( 0x1UL << AAR_INTENCLR_END_Pos ) /*!< Bit mask of END field. */
#define AAR_INTENCLR_END_Disabled            ( 0UL )                           /*!< Read: Disabled */
#define AAR_INTENCLR_END_Enabled             ( 1UL )                           /*!< Read: Enabled */
#define AAR_INTENCLR_END_Clear               ( 1UL )                           /*!< Disable */

/* Register: AAR_STATUS */
/* Description: Resolution status */

/* Bits 3..0 : The IRK that was used last time an address was resolved */
#define AAR_STATUS_STATUS_Pos    ( 0UL )                            /*!< Position of STATUS field. */
#define AAR_STATUS_STATUS_Msk    ( 0xFUL << AAR_STATUS_STATUS_Pos ) /*!< Bit mask of STATUS field. */

/* Register: AAR_ENABLE */
/* Description: Enable AAR */

/* Bits 1..0 : Enable or disable AAR */
#define AAR_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define AAR_ENABLE_ENABLE_Msk         ( 0x3UL << AAR_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define AAR_ENABLE_ENABLE_Disabled    ( 0UL )                            /*!< Disable */
#define AAR_ENABLE_ENABLE_Enabled     ( 3UL )                            /*!< Enable */

/* Register: AAR_NIRK */
/* Description: Number of IRKs */

/* Bits 4..0 : Number of Identity root keys available in the IRK data structure */
#define AAR_NIRK_NIRK_Pos    ( 0UL )                         /*!< Position of NIRK field. */
#define AAR_NIRK_NIRK_Msk    ( 0x1FUL << AAR_NIRK_NIRK_Pos ) /*!< Bit mask of NIRK field. */

/* Register: AAR_IRKPTR */
/* Description: Pointer to IRK data structure */

/* Bits 31..0 : Pointer to the IRK data structure */
#define AAR_IRKPTR_IRKPTR_Pos    ( 0UL )                                   /*!< Position of IRKPTR field. */
#define AAR_IRKPTR_IRKPTR_Msk    ( 0xFFFFFFFFUL << AAR_IRKPTR_IRKPTR_Pos ) /*!< Bit mask of IRKPTR field. */

/* Register: AAR_ADDRPTR */
/* Description: Pointer to the resolvable address */

/* Bits 31..0 : Pointer to the resolvable address (6-bytes) */
#define AAR_ADDRPTR_ADDRPTR_Pos    ( 0UL )                                     /*!< Position of ADDRPTR field. */
#define AAR_ADDRPTR_ADDRPTR_Msk    ( 0xFFFFFFFFUL << AAR_ADDRPTR_ADDRPTR_Pos ) /*!< Bit mask of ADDRPTR field. */

/* Register: AAR_SCRATCHPTR */
/* Description: Pointer to data area used for temporary storage */

/* Bits 31..0 : Pointer to a scratch data area used for temporary storage during resolution. A space of minimum 3 bytes must be reserved. */
#define AAR_SCRATCHPTR_SCRATCHPTR_Pos    ( 0UL )                                           /*!< Position of SCRATCHPTR field. */
#define AAR_SCRATCHPTR_SCRATCHPTR_Msk    ( 0xFFFFFFFFUL << AAR_SCRATCHPTR_SCRATCHPTR_Pos ) /*!< Bit mask of SCRATCHPTR field. */


/* Peripheral: APPROTECT */
/* Description: Only for emulation on devices that support hardened AP-PROTECT. */

/* Register: APPROTECT_FORCEPROTECT */
/* Description: Software force enable APPROTECT mechanism until next reset. */

/* Bits 7..0 : Write 0x0 to force enable APPROTECT mechanism */
#define APPROTECT_FORCEPROTECT_FORCEPROTECT_Pos      ( 0UL )                                               /*!< Position of FORCEPROTECT field. */
#define APPROTECT_FORCEPROTECT_FORCEPROTECT_Msk      ( 0xFFUL << APPROTECT_FORCEPROTECT_FORCEPROTECT_Pos ) /*!< Bit mask of FORCEPROTECT field. */
#define APPROTECT_FORCEPROTECT_FORCEPROTECT_Force    ( 0x0UL )                                             /*!< Software force enable APPROTECT mechanism */

/* Register: APPROTECT_DISABLE */
/* Description: Software disable APPROTECT mechanism */

/* Bits 7..0 : Software disable APPROTECT mechanism */
#define APPROTECT_DISABLE_DISABLE_Pos          ( 0UL )                                     /*!< Position of DISABLE field. */
#define APPROTECT_DISABLE_DISABLE_Msk          ( 0xFFUL << APPROTECT_DISABLE_DISABLE_Pos ) /*!< Bit mask of DISABLE field. */
#define APPROTECT_DISABLE_DISABLE_SwDisable    ( 0x5AUL )                                  /*!< Software disable APPROTECT mechanism */


/* Peripheral: BPROT */
/* Description: Block Protect */

/* Register: BPROT_CONFIG0 */
/* Description: Block protect configuration register 0 */

/* Bit 31 : Enable protection for region 31. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION31_Pos         ( 31UL )                                /*!< Position of REGION31 field. */
#define BPROT_CONFIG0_REGION31_Msk         ( 0x1UL << BPROT_CONFIG0_REGION31_Pos ) /*!< Bit mask of REGION31 field. */
#define BPROT_CONFIG0_REGION31_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION31_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 30 : Enable protection for region 30. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION30_Pos         ( 30UL )                                /*!< Position of REGION30 field. */
#define BPROT_CONFIG0_REGION30_Msk         ( 0x1UL << BPROT_CONFIG0_REGION30_Pos ) /*!< Bit mask of REGION30 field. */
#define BPROT_CONFIG0_REGION30_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION30_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 29 : Enable protection for region 29. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION29_Pos         ( 29UL )                                /*!< Position of REGION29 field. */
#define BPROT_CONFIG0_REGION29_Msk         ( 0x1UL << BPROT_CONFIG0_REGION29_Pos ) /*!< Bit mask of REGION29 field. */
#define BPROT_CONFIG0_REGION29_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION29_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 28 : Enable protection for region 28. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION28_Pos         ( 28UL )                                /*!< Position of REGION28 field. */
#define BPROT_CONFIG0_REGION28_Msk         ( 0x1UL << BPROT_CONFIG0_REGION28_Pos ) /*!< Bit mask of REGION28 field. */
#define BPROT_CONFIG0_REGION28_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION28_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 27 : Enable protection for region 27. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION27_Pos         ( 27UL )                                /*!< Position of REGION27 field. */
#define BPROT_CONFIG0_REGION27_Msk         ( 0x1UL << BPROT_CONFIG0_REGION27_Pos ) /*!< Bit mask of REGION27 field. */
#define BPROT_CONFIG0_REGION27_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION27_Enabled     ( 1UL )                                 /*!< Protection enabled */

