FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 26 : Enable protection for region 26. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION26_Pos         ( 26UL )                                /*!< Position of REGION26 field. */
#define BPROT_CONFIG0_REGION26_Msk         ( 0x1UL << BPROT_CONFIG0_REGION26_Pos ) /*!< Bit mask of REGION26 field. */
#define BPROT_CONFIG0_REGION26_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION26_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 25 : Enable protection for region 25. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION25_Pos         ( 25UL )                                /*!< Position of REGION25 field. */
#define BPROT_CONFIG0_REGION25_Msk         ( 0x1UL << BPROT_CONFIG0_REGION25_Pos ) /*!< Bit mask of REGION25 field. */
#define BPROT_CONFIG0_REGION25_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION25_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 24 : Enable protection for region 24. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION24_Pos         ( 24UL )                                /*!< Position of REGION24 field. */
#define BPROT_CONFIG0_REGION24_Msk         ( 0x1UL << BPROT_CONFIG0_REGION24_Pos ) /*!< Bit mask of REGION24 field. */
#define BPROT_CONFIG0_REGION24_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION24_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 23 : Enable protection for region 23. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION23_Pos         ( 23UL )                                /*!< Position of REGION23 field. */
#define BPROT_CONFIG0_REGION23_Msk         ( 0x1UL << BPROT_CONFIG0_REGION23_Pos ) /*!< Bit mask of REGION23 field. */
#define BPROT_CONFIG0_REGION23_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION23_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 22 : Enable protection for region 22. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION22_Pos         ( 22UL )                                /*!< Position of REGION22 field. */
#define BPROT_CONFIG0_REGION22_Msk         ( 0x1UL << BPROT_CONFIG0_REGION22_Pos ) /*!< Bit mask of REGION22 field. */
#define BPROT_CONFIG0_REGION22_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION22_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 21 : Enable protection for region 21. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION21_Pos         ( 21UL )                                /*!< Position of REGION21 field. */
#define BPROT_CONFIG0_REGION21_Msk         ( 0x1UL << BPROT_CONFIG0_REGION21_Pos ) /*!< Bit mask of REGION21 field. */
#define BPROT_CONFIG0_REGION21_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION21_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 20 : Enable protection for region 20. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION20_Pos         ( 20UL )                                /*!< Position of REGION20 field. */
#define BPROT_CONFIG0_REGION20_Msk         ( 0x1UL << BPROT_CONFIG0_REGION20_Pos ) /*!< Bit mask of REGION20 field. */
#define BPROT_CONFIG0_REGION20_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION20_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 19 : Enable protection for region 19. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION19_Pos         ( 19UL )                                /*!< Position of REGION19 field. */
#define BPROT_CONFIG0_REGION19_Msk         ( 0x1UL << BPROT_CONFIG0_REGION19_Pos ) /*!< Bit mask of REGION19 field. */
#define BPROT_CONFIG0_REGION19_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION19_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 18 : Enable protection for region 18. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION18_Pos         ( 18UL )                                /*!< Position of REGION18 field. */
#define BPROT_CONFIG0_REGION18_Msk         ( 0x1UL << BPROT_CONFIG0_REGION18_Pos ) /*!< Bit mask of REGION18 field. */
#define BPROT_CONFIG0_REGION18_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION18_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 17 : Enable protection for region 17. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION17_Pos         ( 17UL )                                /*!< Position of REGION17 field. */
#define BPROT_CONFIG0_REGION17_Msk         ( 0x1UL << BPROT_CONFIG0_REGION17_Pos ) /*!< Bit mask of REGION17 field. */
#define BPROT_CONFIG0_REGION17_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION17_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 16 : Enable protection for region 16. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION16_Pos         ( 16UL )                                /*!< Position of REGION16 field. */
#define BPROT_CONFIG0_REGION16_Msk         ( 0x1UL << BPROT_CONFIG0_REGION16_Pos ) /*!< Bit mask of REGION16 field. */
#define BPROT_CONFIG0_REGION16_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION16_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 15 : Enable protection for region 15. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION15_Pos         ( 15UL )                                /*!< Position of REGION15 field. */
#define BPROT_CONFIG0_REGION15_Msk         ( 0x1UL << BPROT_CONFIG0_REGION15_Pos ) /*!< Bit mask of REGION15 field. */
#define BPROT_CONFIG0_REGION15_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION15_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 14 : Enable protection for region 14. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION14_Pos         ( 14UL )                                /*!< Position of REGION14 field. */
#define BPROT_CONFIG0_REGION14_Msk         ( 0x1UL << BPROT_CONFIG0_REGION14_Pos ) /*!< Bit mask of REGION14 field. */
#define BPROT_CONFIG0_REGION14_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION14_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 13 : Enable protection for region 13. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION13_Pos         ( 13UL )                                /*!< Position of REGION13 field. */
#define BPROT_CONFIG0_REGION13_Msk         ( 0x1UL << BPROT_CONFIG0_REGION13_Pos ) /*!< Bit mask of REGION13 field. */
#define BPROT_CONFIG0_REGION13_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION13_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 12 : Enable protection for region 12. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION12_Pos         ( 12UL )                                /*!< Position of REGION12 field. */
#define BPROT_CONFIG0_REGION12_Msk         ( 0x1UL << BPROT_CONFIG0_REGION12_Pos ) /*!< Bit mask of REGION12 field. */
#define BPROT_CONFIG0_REGION12_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION12_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 11 : Enable protection for region 11. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION11_Pos         ( 11UL )                                /*!< Position of REGION11 field. */
#define BPROT_CONFIG0_REGION11_Msk         ( 0x1UL << BPROT_CONFIG0_REGION11_Pos ) /*!< Bit mask of REGION11 field. */
#define BPROT_CONFIG0_REGION11_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION11_Enabled     ( 1UL )                                 /*!< Protection enabled */

