FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 10 : Enable protection for region 10. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION10_Pos         ( 10UL )                                /*!< Position of REGION10 field. */
#define BPROT_CONFIG0_REGION10_Msk         ( 0x1UL << BPROT_CONFIG0_REGION10_Pos ) /*!< Bit mask of REGION10 field. */
#define BPROT_CONFIG0_REGION10_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG0_REGION10_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 9 : Enable protection for region 9. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION9_Pos          ( 9UL )                                /*!< Position of REGION9 field. */
#define BPROT_CONFIG0_REGION9_Msk          ( 0x1UL << BPROT_CONFIG0_REGION9_Pos ) /*!< Bit mask of REGION9 field. */
#define BPROT_CONFIG0_REGION9_Disabled     ( 0UL )                                /*!< Protection disabled */
#define BPROT_CONFIG0_REGION9_Enabled      ( 1UL )                                /*!< Protection enabled */

/* Bit 8 : Enable protection for region 8. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION8_Pos          ( 8UL )                                /*!< Position of REGION8 field. */
#define BPROT_CONFIG0_REGION8_Msk          ( 0x1UL << BPROT_CONFIG0_REGION8_Pos ) /*!< Bit mask of REGION8 field. */
#define BPROT_CONFIG0_REGION8_Disabled     ( 0UL )                                /*!< Protection disabled */
#define BPROT_CONFIG0_REGION8_Enabled      ( 1UL )                                /*!< Protection enabled */

/* Bit 7 : Enable protection for region 7. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION7_Pos          ( 7UL )                                /*!< Position of REGION7 field. */
#define BPROT_CONFIG0_REGION7_Msk          ( 0x1UL << BPROT_CONFIG0_REGION7_Pos ) /*!< Bit mask of REGION7 field. */
#define BPROT_CONFIG0_REGION7_Disabled     ( 0UL )                                /*!< Protection disabled */
#define BPROT_CONFIG0_REGION7_Enabled      ( 1UL )                                /*!< Protection enabled */

/* Bit 6 : Enable protection for region 6. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION6_Pos          ( 6UL )                                /*!< Position of REGION6 field. */
#define BPROT_CONFIG0_REGION6_Msk          ( 0x1UL << BPROT_CONFIG0_REGION6_Pos ) /*!< Bit mask of REGION6 field. */
#define BPROT_CONFIG0_REGION6_Disabled     ( 0UL )                                /*!< Protection disabled */
#define BPROT_CONFIG0_REGION6_Enabled      ( 1UL )                                /*!< Protection enabled */

/* Bit 5 : Enable protection for region 5. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION5_Pos          ( 5UL )                                /*!< Position of REGION5 field. */
#define BPROT_CONFIG0_REGION5_Msk          ( 0x1UL << BPROT_CONFIG0_REGION5_Pos ) /*!< Bit mask of REGION5 field. */
#define BPROT_CONFIG0_REGION5_Disabled     ( 0UL )                                /*!< Protection disabled */
#define BPROT_CONFIG0_REGION5_Enabled      ( 1UL )                                /*!< Protection enabled */

/* Bit 4 : Enable protection for region 4. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION4_Pos          ( 4UL )                                /*!< Position of REGION4 field. */
#define BPROT_CONFIG0_REGION4_Msk          ( 0x1UL << BPROT_CONFIG0_REGION4_Pos ) /*!< Bit mask of REGION4 field. */
#define BPROT_CONFIG0_REGION4_Disabled     ( 0UL )                                /*!< Protection disabled */
#define BPROT_CONFIG0_REGION4_Enabled      ( 1UL )                                /*!< Protection enabled */

/* Bit 3 : Enable protection for region 3. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION3_Pos          ( 3UL )                                /*!< Position of REGION3 field. */
#define BPROT_CONFIG0_REGION3_Msk          ( 0x1UL << BPROT_CONFIG0_REGION3_Pos ) /*!< Bit mask of REGION3 field. */
#define BPROT_CONFIG0_REGION3_Disabled     ( 0UL )                                /*!< Protection disabled */
#define BPROT_CONFIG0_REGION3_Enabled      ( 1UL )                                /*!< Protection enabled */

/* Bit 2 : Enable protection for region 2. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION2_Pos          ( 2UL )                                /*!< Position of REGION2 field. */
#define BPROT_CONFIG0_REGION2_Msk          ( 0x1UL << BPROT_CONFIG0_REGION2_Pos ) /*!< Bit mask of REGION2 field. */
#define BPROT_CONFIG0_REGION2_Disabled     ( 0UL )                                /*!< Protection disabled */
#define BPROT_CONFIG0_REGION2_Enabled      ( 1UL )                                /*!< Protection enabled */

/* Bit 1 : Enable protection for region 1. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION1_Pos          ( 1UL )                                /*!< Position of REGION1 field. */
#define BPROT_CONFIG0_REGION1_Msk          ( 0x1UL << BPROT_CONFIG0_REGION1_Pos ) /*!< Bit mask of REGION1 field. */
#define BPROT_CONFIG0_REGION1_Disabled     ( 0UL )                                /*!< Protection disabled */
#define BPROT_CONFIG0_REGION1_Enabled      ( 1UL )                                /*!< Protection enabled */

/* Bit 0 : Enable protection for region 0. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION0_Pos          ( 0UL )                                /*!< Position of REGION0 field. */
#define BPROT_CONFIG0_REGION0_Msk          ( 0x1UL << BPROT_CONFIG0_REGION0_Pos ) /*!< Bit mask of REGION0 field. */
#define BPROT_CONFIG0_REGION0_Disabled     ( 0UL )                                /*!< Protection disabled */
#define BPROT_CONFIG0_REGION0_Enabled      ( 1UL )                                /*!< Protection enabled */

/* Register: BPROT_CONFIG1 */
/* Description: Block protect configuration register 1 */

/* Bit 15 : Enable protection for region 47. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION47_Pos         ( 15UL )                                /*!< Position of REGION47 field. */
#define BPROT_CONFIG1_REGION47_Msk         ( 0x1UL << BPROT_CONFIG1_REGION47_Pos ) /*!< Bit mask of REGION47 field. */
#define BPROT_CONFIG1_REGION47_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION47_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 14 : Enable protection for region 46. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION46_Pos         ( 14UL )                                /*!< Position of REGION46 field. */
#define BPROT_CONFIG1_REGION46_Msk         ( 0x1UL << BPROT_CONFIG1_REGION46_Pos ) /*!< Bit mask of REGION46 field. */
#define BPROT_CONFIG1_REGION46_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION46_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 13 : Enable protection for region 45. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION45_Pos         ( 13UL )                                /*!< Position of REGION45 field. */
#define BPROT_CONFIG1_REGION45_Msk         ( 0x1UL << BPROT_CONFIG1_REGION45_Pos ) /*!< Bit mask of REGION45 field. */
#define BPROT_CONFIG1_REGION45_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION45_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 12 : Enable protection for region 44. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION44_Pos         ( 12UL )                                /*!< Position of REGION44 field. */
#define BPROT_CONFIG1_REGION44_Msk         ( 0x1UL << BPROT_CONFIG1_REGION44_Pos ) /*!< Bit mask of REGION44 field. */
#define BPROT_CONFIG1_REGION44_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION44_Enabled     ( 1UL )                                 /*!< Protection enabled */

