FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 11 : Enable protection for region 43. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION43_Pos         ( 11UL )                                /*!< Position of REGION43 field. */
#define BPROT_CONFIG1_REGION43_Msk         ( 0x1UL << BPROT_CONFIG1_REGION43_Pos ) /*!< Bit mask of REGION43 field. */
#define BPROT_CONFIG1_REGION43_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION43_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 10 : Enable protection for region 42. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION42_Pos         ( 10UL )                                /*!< Position of REGION42 field. */
#define BPROT_CONFIG1_REGION42_Msk         ( 0x1UL << BPROT_CONFIG1_REGION42_Pos ) /*!< Bit mask of REGION42 field. */
#define BPROT_CONFIG1_REGION42_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION42_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 9 : Enable protection for region 41. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION41_Pos         ( 9UL )                                 /*!< Position of REGION41 field. */
#define BPROT_CONFIG1_REGION41_Msk         ( 0x1UL << BPROT_CONFIG1_REGION41_Pos ) /*!< Bit mask of REGION41 field. */
#define BPROT_CONFIG1_REGION41_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION41_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 8 : Enable protection for region 40. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION40_Pos         ( 8UL )                                 /*!< Position of REGION40 field. */
#define BPROT_CONFIG1_REGION40_Msk         ( 0x1UL << BPROT_CONFIG1_REGION40_Pos ) /*!< Bit mask of REGION40 field. */
#define BPROT_CONFIG1_REGION40_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION40_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 7 : Enable protection for region 39. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION39_Pos         ( 7UL )                                 /*!< Position of REGION39 field. */
#define BPROT_CONFIG1_REGION39_Msk         ( 0x1UL << BPROT_CONFIG1_REGION39_Pos ) /*!< Bit mask of REGION39 field. */
#define BPROT_CONFIG1_REGION39_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION39_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 6 : Enable protection for region 38. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION38_Pos         ( 6UL )                                 /*!< Position of REGION38 field. */
#define BPROT_CONFIG1_REGION38_Msk         ( 0x1UL << BPROT_CONFIG1_REGION38_Pos ) /*!< Bit mask of REGION38 field. */
#define BPROT_CONFIG1_REGION38_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION38_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 5 : Enable protection for region 37. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION37_Pos         ( 5UL )                                 /*!< Position of REGION37 field. */
#define BPROT_CONFIG1_REGION37_Msk         ( 0x1UL << BPROT_CONFIG1_REGION37_Pos ) /*!< Bit mask of REGION37 field. */
#define BPROT_CONFIG1_REGION37_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION37_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 4 : Enable protection for region 36. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION36_Pos         ( 4UL )                                 /*!< Position of REGION36 field. */
#define BPROT_CONFIG1_REGION36_Msk         ( 0x1UL << BPROT_CONFIG1_REGION36_Pos ) /*!< Bit mask of REGION36 field. */
#define BPROT_CONFIG1_REGION36_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION36_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 3 : Enable protection for region 35. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION35_Pos         ( 3UL )                                 /*!< Position of REGION35 field. */
#define BPROT_CONFIG1_REGION35_Msk         ( 0x1UL << BPROT_CONFIG1_REGION35_Pos ) /*!< Bit mask of REGION35 field. */
#define BPROT_CONFIG1_REGION35_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION35_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 2 : Enable protection for region 34. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION34_Pos         ( 2UL )                                 /*!< Position of REGION34 field. */
#define BPROT_CONFIG1_REGION34_Msk         ( 0x1UL << BPROT_CONFIG1_REGION34_Pos ) /*!< Bit mask of REGION34 field. */
#define BPROT_CONFIG1_REGION34_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION34_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 1 : Enable protection for region 33. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION33_Pos         ( 1UL )                                 /*!< Position of REGION33 field. */
#define BPROT_CONFIG1_REGION33_Msk         ( 0x1UL << BPROT_CONFIG1_REGION33_Pos ) /*!< Bit mask of REGION33 field. */
#define BPROT_CONFIG1_REGION33_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION33_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Bit 0 : Enable protection for region 32. Write '0' has no effect. */
#define BPROT_CONFIG1_REGION32_Pos         ( 0UL )                                 /*!< Position of REGION32 field. */
#define BPROT_CONFIG1_REGION32_Msk         ( 0x1UL << BPROT_CONFIG1_REGION32_Pos ) /*!< Bit mask of REGION32 field. */
#define BPROT_CONFIG1_REGION32_Disabled    ( 0UL )                                 /*!< Protection disabled */
#define BPROT_CONFIG1_REGION32_Enabled     ( 1UL )                                 /*!< Protection enabled */

/* Register: BPROT_DISABLEINDEBUG */
/* Description: Disable protection mechanism in debug mode */

/* Bit 0 : Disable the protection mechanism for NVM regions while in debug mode. This register will only disable the protection mechanism if the device is in debug mode. */
#define BPROT_DISABLEINDEBUG_DISABLEINDEBUG_Pos         ( 0UL )                                              /*!< Position of DISABLEINDEBUG field. */
#define BPROT_DISABLEINDEBUG_DISABLEINDEBUG_Msk         ( 0x1UL << BPROT_DISABLEINDEBUG_DISABLEINDEBUG_Pos ) /*!< Bit mask of DISABLEINDEBUG field. */
#define BPROT_DISABLEINDEBUG_DISABLEINDEBUG_Enabled     ( 0UL )                                              /*!< Enabled in debug */
#define BPROT_DISABLEINDEBUG_DISABLEINDEBUG_Disabled    ( 1UL )                                              /*!< Disabled in debug */


/* Peripheral: CCM */
/* Description: AES CCM Mode Encryption */

/* Register: CCM_TASKS_KSGEN */
/* Description: Start generation of keystream. This operation will stop by itself when completed. */

/* Bit 0 : Start generation of keystream. This operation will stop by itself when completed. */
#define CCM_TASKS_KSGEN_TASKS_KSGEN_Pos        ( 0UL )                                      /*!< Position of TASKS_KSGEN field. */
#define CCM_TASKS_KSGEN_TASKS_KSGEN_Msk        ( 0x1UL << CCM_TASKS_KSGEN_TASKS_KSGEN_Pos ) /*!< Bit mask of TASKS_KSGEN field. */
#define CCM_TASKS_KSGEN_TASKS_KSGEN_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: CCM_TASKS_CRYPT */
/* Description: Start encryption/decryption. This operation will stop by itself when completed. */

/* Bit 0 : Start encryption/decryption. This operation will stop by itself when completed. */
#define CCM_TASKS_CRYPT_TASKS_CRYPT_Pos        ( 0UL )                                      /*!< Position of TASKS_CRYPT field. */
#define CCM_TASKS_CRYPT_TASKS_CRYPT_Msk        ( 0x1UL << CCM_TASKS_CRYPT_TASKS_CRYPT_Pos ) /*!< Bit mask of TASKS_CRYPT field. */
#define CCM_TASKS_CRYPT_TASKS_CRYPT_Trigger    ( 1UL )                                      /*!< Trigger task */

