FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: CCM_TASKS_STOP */
/* Description: Stop encryption/decryption */

/* Bit 0 : Stop encryption/decryption */
#define CCM_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define CCM_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << CCM_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define CCM_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: CCM_TASKS_RATEOVERRIDE */
/* Description: Override DATARATE setting in MODE register with the contents of the RATEOVERRIDE register for any ongoing encryption/decryption */

/* Bit 0 : Override DATARATE setting in MODE register with the contents of the RATEOVERRIDE register for any ongoing encryption/decryption */
#define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Pos        ( 0UL )                                                    /*!< Position of TASKS_RATEOVERRIDE field. */
#define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Msk        ( 0x1UL << CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Pos ) /*!< Bit mask of TASKS_RATEOVERRIDE field. */
#define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Trigger    ( 1UL )                                                    /*!< Trigger task */

/* Register: CCM_EVENTS_ENDKSGEN */
/* Description: Keystream generation complete */

/* Bit 0 : Keystream generation complete */
#define CCM_EVENTS_ENDKSGEN_EVENTS_ENDKSGEN_Pos             ( 0UL )                                              /*!< Position of EVENTS_ENDKSGEN field. */
#define CCM_EVENTS_ENDKSGEN_EVENTS_ENDKSGEN_Msk             ( 0x1UL << CCM_EVENTS_ENDKSGEN_EVENTS_ENDKSGEN_Pos ) /*!< Bit mask of EVENTS_ENDKSGEN field. */
#define CCM_EVENTS_ENDKSGEN_EVENTS_ENDKSGEN_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define CCM_EVENTS_ENDKSGEN_EVENTS_ENDKSGEN_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: CCM_EVENTS_ENDCRYPT */
/* Description: Encrypt/decrypt complete */

/* Bit 0 : Encrypt/decrypt complete */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Pos             ( 0UL )                                              /*!< Position of EVENTS_ENDCRYPT field. */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Msk             ( 0x1UL << CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Pos ) /*!< Bit mask of EVENTS_ENDCRYPT field. */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: CCM_EVENTS_ERROR */
/* Description: Deprecated register - CCM error event */

/* Bit 0 : Deprecated field -  CCM error event */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_Pos             ( 0UL )                                        /*!< Position of EVENTS_ERROR field. */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_Msk             ( 0x1UL << CCM_EVENTS_ERROR_EVENTS_ERROR_Pos ) /*!< Bit mask of EVENTS_ERROR field. */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: CCM_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 0 : Shortcut between event ENDKSGEN and task CRYPT */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Pos         ( 0UL )                                    /*!< Position of ENDKSGEN_CRYPT field. */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Msk         ( 0x1UL << CCM_SHORTS_ENDKSGEN_CRYPT_Pos ) /*!< Bit mask of ENDKSGEN_CRYPT field. */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Disabled    ( 0UL )                                    /*!< Disable shortcut */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Enabled     ( 1UL )                                    /*!< Enable shortcut */

/* Register: CCM_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Deprecated intsetfield -  Write '1' to enable interrupt for event ERROR */
#define CCM_INTENSET_ERROR_Pos            ( 2UL )                             /*!< Position of ERROR field. */
#define CCM_INTENSET_ERROR_Msk            ( 0x1UL << CCM_INTENSET_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define CCM_INTENSET_ERROR_Disabled       ( 0UL )                             /*!< Read: Disabled */
#define CCM_INTENSET_ERROR_Enabled        ( 1UL )                             /*!< Read: Enabled */
#define CCM_INTENSET_ERROR_Set            ( 1UL )                             /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event ENDCRYPT */
#define CCM_INTENSET_ENDCRYPT_Pos         ( 1UL )                                /*!< Position of ENDCRYPT field. */
#define CCM_INTENSET_ENDCRYPT_Msk         ( 0x1UL << CCM_INTENSET_ENDCRYPT_Pos ) /*!< Bit mask of ENDCRYPT field. */
#define CCM_INTENSET_ENDCRYPT_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENSET_ENDCRYPT_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENSET_ENDCRYPT_Set         ( 1UL )                                /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event ENDKSGEN */
#define CCM_INTENSET_ENDKSGEN_Pos         ( 0UL )                                /*!< Position of ENDKSGEN field. */
#define CCM_INTENSET_ENDKSGEN_Msk         ( 0x1UL << CCM_INTENSET_ENDKSGEN_Pos ) /*!< Bit mask of ENDKSGEN field. */
#define CCM_INTENSET_ENDKSGEN_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENSET_ENDKSGEN_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENSET_ENDKSGEN_Set         ( 1UL )                                /*!< Enable */

/* Register: CCM_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Deprecated intclrfield -  Write '1' to disable interrupt for event ERROR */
#define CCM_INTENCLR_ERROR_Pos            ( 2UL )                             /*!< Position of ERROR field. */
#define CCM_INTENCLR_ERROR_Msk            ( 0x1UL << CCM_INTENCLR_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define CCM_INTENCLR_ERROR_Disabled       ( 0UL )                             /*!< Read: Disabled */
#define CCM_INTENCLR_ERROR_Enabled        ( 1UL )                             /*!< Read: Enabled */
#define CCM_INTENCLR_ERROR_Clear          ( 1UL )                             /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event ENDCRYPT */
#define CCM_INTENCLR_ENDCRYPT_Pos         ( 1UL )                                /*!< Position of ENDCRYPT field. */
#define CCM_INTENCLR_ENDCRYPT_Msk         ( 0x1UL << CCM_INTENCLR_ENDCRYPT_Pos ) /*!< Bit mask of ENDCRYPT field. */
#define CCM_INTENCLR_ENDCRYPT_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENCLR_ENDCRYPT_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENCLR_ENDCRYPT_Clear       ( 1UL )                                /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event ENDKSGEN */
#define CCM_INTENCLR_ENDKSGEN_Pos         ( 0UL )                                /*!< Position of ENDKSGEN field. */
#define CCM_INTENCLR_ENDKSGEN_Msk         ( 0x1UL << CCM_INTENCLR_ENDKSGEN_Pos ) /*!< Bit mask of ENDKSGEN field. */
#define CCM_INTENCLR_ENDKSGEN_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENCLR_ENDKSGEN_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENCLR_ENDKSGEN_Clear       ( 1UL )                                /*!< Disable */

/* Register: CCM_MICSTATUS */
/* Description: MIC check result */

