FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: CLOCK_EVENTS_CTTO */
/* Description: Calibration timer timeout */

/* Bit 0 : Calibration timer timeout */
#define CLOCK_EVENTS_CTTO_EVENTS_CTTO_Pos             ( 0UL )                                        /*!< Position of EVENTS_CTTO field. */
#define CLOCK_EVENTS_CTTO_EVENTS_CTTO_Msk             ( 0x1UL << CLOCK_EVENTS_CTTO_EVENTS_CTTO_Pos ) /*!< Bit mask of EVENTS_CTTO field. */
#define CLOCK_EVENTS_CTTO_EVENTS_CTTO_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define CLOCK_EVENTS_CTTO_EVENTS_CTTO_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: CLOCK_INTENSET */
/* Description: Enable interrupt */

/* Bit 4 : Write '1' to enable interrupt for event CTTO */
#define CLOCK_INTENSET_CTTO_Pos                 ( 4UL )                              /*!< Position of CTTO field. */
#define CLOCK_INTENSET_CTTO_Msk                 ( 0x1UL << CLOCK_INTENSET_CTTO_Pos ) /*!< Bit mask of CTTO field. */
#define CLOCK_INTENSET_CTTO_Disabled            ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENSET_CTTO_Enabled             ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENSET_CTTO_Set                 ( 1UL )                              /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event DONE */
#define CLOCK_INTENSET_DONE_Pos                 ( 3UL )                              /*!< Position of DONE field. */
#define CLOCK_INTENSET_DONE_Msk                 ( 0x1UL << CLOCK_INTENSET_DONE_Pos ) /*!< Bit mask of DONE field. */
#define CLOCK_INTENSET_DONE_Disabled            ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENSET_DONE_Enabled             ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENSET_DONE_Set                 ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event LFCLKSTARTED */
#define CLOCK_INTENSET_LFCLKSTARTED_Pos         ( 1UL )                                      /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTENSET_LFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENSET_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTENSET_LFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENSET_LFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENSET_LFCLKSTARTED_Set         ( 1UL )                                      /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event HFCLKSTARTED */
#define CLOCK_INTENSET_HFCLKSTARTED_Pos         ( 0UL )                                      /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTENSET_HFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENSET_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTENSET_HFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENSET_HFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENSET_HFCLKSTARTED_Set         ( 1UL )                                      /*!< Enable */

/* Register: CLOCK_INTENCLR */
/* Description: Disable interrupt */

/* Bit 4 : Write '1' to disable interrupt for event CTTO */
#define CLOCK_INTENCLR_CTTO_Pos                 ( 4UL )                              /*!< Position of CTTO field. */
#define CLOCK_INTENCLR_CTTO_Msk                 ( 0x1UL << CLOCK_INTENCLR_CTTO_Pos ) /*!< Bit mask of CTTO field. */
#define CLOCK_INTENCLR_CTTO_Disabled            ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENCLR_CTTO_Enabled             ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENCLR_CTTO_Clear               ( 1UL )                              /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event DONE */
#define CLOCK_INTENCLR_DONE_Pos                 ( 3UL )                              /*!< Position of DONE field. */
#define CLOCK_INTENCLR_DONE_Msk                 ( 0x1UL << CLOCK_INTENCLR_DONE_Pos ) /*!< Bit mask of DONE field. */
#define CLOCK_INTENCLR_DONE_Disabled            ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENCLR_DONE_Enabled             ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENCLR_DONE_Clear               ( 1UL )                              /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event LFCLKSTARTED */
#define CLOCK_INTENCLR_LFCLKSTARTED_Pos         ( 1UL )                                      /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTENCLR_LFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENCLR_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTENCLR_LFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENCLR_LFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENCLR_LFCLKSTARTED_Clear       ( 1UL )                                      /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event HFCLKSTARTED */
#define CLOCK_INTENCLR_HFCLKSTARTED_Pos         ( 0UL )                                      /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTENCLR_HFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENCLR_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTENCLR_HFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENCLR_HFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENCLR_HFCLKSTARTED_Clear       ( 1UL )                                      /*!< Disable */

/* Register: CLOCK_HFCLKRUN */
/* Description: Status indicating that HFCLKSTART task has been triggered */

/* Bit 0 : HFCLKSTART task triggered or not */
#define CLOCK_HFCLKRUN_STATUS_Pos             ( 0UL )                                /*!< Position of STATUS field. */
#define CLOCK_HFCLKRUN_STATUS_Msk             ( 0x1UL << CLOCK_HFCLKRUN_STATUS_Pos ) /*!< Bit mask of STATUS field. */
#define CLOCK_HFCLKRUN_STATUS_NotTriggered    ( 0UL )                                /*!< Task not triggered */
#define CLOCK_HFCLKRUN_STATUS_Triggered       ( 1UL )                                /*!< Task triggered */

