FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: CLOCK_HFCLKSTAT */
/* Description: HFCLK status */

/* Bit 16 : HFCLK state */
#define CLOCK_HFCLKSTAT_STATE_Pos           ( 16UL )                               /*!< Position of STATE field. */
#define CLOCK_HFCLKSTAT_STATE_Msk           ( 0x1UL << CLOCK_HFCLKSTAT_STATE_Pos ) /*!< Bit mask of STATE field. */
#define CLOCK_HFCLKSTAT_STATE_NotRunning    ( 0UL )                                /*!< HFCLK not running */
#define CLOCK_HFCLKSTAT_STATE_Running       ( 1UL )                                /*!< HFCLK running */

/* Bit 0 : Source of HFCLK */
#define CLOCK_HFCLKSTAT_SRC_Pos             ( 0UL )                              /*!< Position of SRC field. */
#define CLOCK_HFCLKSTAT_SRC_Msk             ( 0x1UL << CLOCK_HFCLKSTAT_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_HFCLKSTAT_SRC_RC              ( 0UL )                              /*!< 64 MHz internal oscillator (HFINT) */
#define CLOCK_HFCLKSTAT_SRC_Xtal            ( 1UL )                              /*!< 64 MHz crystal oscillator (HFXO) */

/* Register: CLOCK_LFCLKRUN */
/* Description: Status indicating that LFCLKSTART task has been triggered */

/* Bit 0 : LFCLKSTART task triggered or not */
#define CLOCK_LFCLKRUN_STATUS_Pos             ( 0UL )                                /*!< Position of STATUS field. */
#define CLOCK_LFCLKRUN_STATUS_Msk             ( 0x1UL << CLOCK_LFCLKRUN_STATUS_Pos ) /*!< Bit mask of STATUS field. */
#define CLOCK_LFCLKRUN_STATUS_NotTriggered    ( 0UL )                                /*!< Task not triggered */
#define CLOCK_LFCLKRUN_STATUS_Triggered       ( 1UL )                                /*!< Task triggered */

/* Register: CLOCK_LFCLKSTAT */
/* Description: LFCLK status */

/* Bit 16 : LFCLK state */
#define CLOCK_LFCLKSTAT_STATE_Pos           ( 16UL )                               /*!< Position of STATE field. */
#define CLOCK_LFCLKSTAT_STATE_Msk           ( 0x1UL << CLOCK_LFCLKSTAT_STATE_Pos ) /*!< Bit mask of STATE field. */
#define CLOCK_LFCLKSTAT_STATE_NotRunning    ( 0UL )                                /*!< LFCLK not running */
#define CLOCK_LFCLKSTAT_STATE_Running       ( 1UL )                                /*!< LFCLK running */

/* Bits 1..0 : Source of LFCLK */
#define CLOCK_LFCLKSTAT_SRC_Pos             ( 0UL )                              /*!< Position of SRC field. */
#define CLOCK_LFCLKSTAT_SRC_Msk             ( 0x3UL << CLOCK_LFCLKSTAT_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSTAT_SRC_RC              ( 0UL )                              /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSTAT_SRC_Xtal            ( 1UL )                              /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSTAT_SRC_Synth           ( 2UL )                              /*!< 32.768 kHz synthesized from HFCLK */

/* Register: CLOCK_LFCLKSRCCOPY */
/* Description: Copy of LFCLKSRC register, set when LFCLKSTART task was triggered */

/* Bits 1..0 : Clock source */
#define CLOCK_LFCLKSRCCOPY_SRC_Pos      ( 0UL )                                 /*!< Position of SRC field. */
#define CLOCK_LFCLKSRCCOPY_SRC_Msk      ( 0x3UL << CLOCK_LFCLKSRCCOPY_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSRCCOPY_SRC_RC       ( 0UL )                                 /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSRCCOPY_SRC_Xtal     ( 1UL )                                 /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSRCCOPY_SRC_Synth    ( 2UL )                                 /*!< 32.768 kHz synthesized from HFCLK */

/* Register: CLOCK_LFCLKSRC */
/* Description: Clock source for the LFCLK */

/* Bit 17 : Enable or disable external source for LFCLK */
#define CLOCK_LFCLKSRC_EXTERNAL_Pos         ( 17UL )                                 /*!< Position of EXTERNAL field. */
#define CLOCK_LFCLKSRC_EXTERNAL_Msk         ( 0x1UL << CLOCK_LFCLKSRC_EXTERNAL_Pos ) /*!< Bit mask of EXTERNAL field. */
#define CLOCK_LFCLKSRC_EXTERNAL_Disabled    ( 0UL )                                  /*!< Disable external source (use with Xtal) */
#define CLOCK_LFCLKSRC_EXTERNAL_Enabled     ( 1UL )                                  /*!< Enable use of external source instead of Xtal (SRC needs to be set to Xtal) */

/* Bit 16 : Enable or disable bypass of LFCLK crystal oscillator with external clock source */
#define CLOCK_LFCLKSRC_BYPASS_Pos           ( 16UL )                               /*!< Position of BYPASS field. */
#define CLOCK_LFCLKSRC_BYPASS_Msk           ( 0x1UL << CLOCK_LFCLKSRC_BYPASS_Pos ) /*!< Bit mask of BYPASS field. */
#define CLOCK_LFCLKSRC_BYPASS_Disabled      ( 0UL )                                /*!< Disable (use with Xtal or low-swing external source) */
#define CLOCK_LFCLKSRC_BYPASS_Enabled       ( 1UL )                                /*!< Enable (use with rail-to-rail external source) */

/* Bits 1..0 : Clock source */
#define CLOCK_LFCLKSRC_SRC_Pos              ( 0UL )                             /*!< Position of SRC field. */
#define CLOCK_LFCLKSRC_SRC_Msk              ( 0x3UL << CLOCK_LFCLKSRC_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSRC_SRC_RC               ( 0UL )                             /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSRC_SRC_Xtal             ( 1UL )                             /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSRC_SRC_Synth            ( 2UL )                             /*!< 32.768 kHz synthesized from HFCLK */

/* Register: CLOCK_CTIV */
/* Description: Calibration timer interval */

/* Bits 6..0 : Calibration timer interval in multiple of 0.25 seconds. Range: 0.25 seconds to 31.75 seconds. */
#define CLOCK_CTIV_CTIV_Pos    ( 0UL )                           /*!< Position of CTIV field. */
#define CLOCK_CTIV_CTIV_Msk    ( 0x7FUL << CLOCK_CTIV_CTIV_Pos ) /*!< Bit mask of CTIV field. */


/* Peripheral: ECB */
/* Description: AES ECB Mode Encryption */

/* Register: ECB_TASKS_STARTECB */
/* Description: Start ECB block encrypt */

/* Bit 0 : Start ECB block encrypt */
#define ECB_TASKS_STARTECB_TASKS_STARTECB_Pos        ( 0UL )                                            /*!< Position of TASKS_STARTECB field. */
#define ECB_TASKS_STARTECB_TASKS_STARTECB_Msk        ( 0x1UL << ECB_TASKS_STARTECB_TASKS_STARTECB_Pos ) /*!< Bit mask of TASKS_STARTECB field. */
#define ECB_TASKS_STARTECB_TASKS_STARTECB_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: ECB_TASKS_STOPECB */
/* Description: Abort a possible executing ECB operation */

/* Bit 0 : Abort a possible executing ECB operation */
#define ECB_TASKS_STOPECB_TASKS_STOPECB_Pos        ( 0UL )                                          /*!< Position of TASKS_STOPECB field. */
#define ECB_TASKS_STOPECB_TASKS_STOPECB_Msk        ( 0x1UL << ECB_TASKS_STOPECB_TASKS_STOPECB_Pos ) /*!< Bit mask of TASKS_STOPECB field. */
#define ECB_TASKS_STOPECB_TASKS_STOPECB_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: ECB_EVENTS_ENDECB */
/* Description: ECB block encrypt complete */

/* Bit 0 : ECB block encrypt complete */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_Pos             ( 0UL )                                          /*!< Position of EVENTS_ENDECB field. */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_Msk             ( 0x1UL << ECB_EVENTS_ENDECB_EVENTS_ENDECB_Pos ) /*!< Bit mask of EVENTS_ENDECB field. */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_Generated       ( 1UL )                                          /*!< Event generated */

