FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 4 : Write '1' to enable interrupt for event TRIGGERED[4] */
#define EGU_INTENSET_TRIGGERED4_Pos          ( 4UL )                                  /*!< Position of TRIGGERED4 field. */
#define EGU_INTENSET_TRIGGERED4_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED4_Pos ) /*!< Bit mask of TRIGGERED4 field. */
#define EGU_INTENSET_TRIGGERED4_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED4_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED4_Set          ( 1UL )                                  /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event TRIGGERED[3] */
#define EGU_INTENSET_TRIGGERED3_Pos          ( 3UL )                                  /*!< Position of TRIGGERED3 field. */
#define EGU_INTENSET_TRIGGERED3_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED3_Pos ) /*!< Bit mask of TRIGGERED3 field. */
#define EGU_INTENSET_TRIGGERED3_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED3_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED3_Set          ( 1UL )                                  /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event TRIGGERED[2] */
#define EGU_INTENSET_TRIGGERED2_Pos          ( 2UL )                                  /*!< Position of TRIGGERED2 field. */
#define EGU_INTENSET_TRIGGERED2_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED2_Pos ) /*!< Bit mask of TRIGGERED2 field. */
#define EGU_INTENSET_TRIGGERED2_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED2_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED2_Set          ( 1UL )                                  /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event TRIGGERED[1] */
#define EGU_INTENSET_TRIGGERED1_Pos          ( 1UL )                                  /*!< Position of TRIGGERED1 field. */
#define EGU_INTENSET_TRIGGERED1_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED1_Pos ) /*!< Bit mask of TRIGGERED1 field. */
#define EGU_INTENSET_TRIGGERED1_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED1_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED1_Set          ( 1UL )                                  /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event TRIGGERED[0] */
#define EGU_INTENSET_TRIGGERED0_Pos          ( 0UL )                                  /*!< Position of TRIGGERED0 field. */
#define EGU_INTENSET_TRIGGERED0_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED0_Pos ) /*!< Bit mask of TRIGGERED0 field. */
#define EGU_INTENSET_TRIGGERED0_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED0_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED0_Set          ( 1UL )                                  /*!< Enable */

/* Register: EGU_INTENCLR */
/* Description: Disable interrupt */

/* Bit 15 : Write '1' to disable interrupt for event TRIGGERED[15] */
#define EGU_INTENCLR_TRIGGERED15_Pos         ( 15UL )                                  /*!< Position of TRIGGERED15 field. */
#define EGU_INTENCLR_TRIGGERED15_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED15_Pos ) /*!< Bit mask of TRIGGERED15 field. */
#define EGU_INTENCLR_TRIGGERED15_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED15_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED15_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 14 : Write '1' to disable interrupt for event TRIGGERED[14] */
#define EGU_INTENCLR_TRIGGERED14_Pos         ( 14UL )                                  /*!< Position of TRIGGERED14 field. */
#define EGU_INTENCLR_TRIGGERED14_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED14_Pos ) /*!< Bit mask of TRIGGERED14 field. */
#define EGU_INTENCLR_TRIGGERED14_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED14_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED14_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 13 : Write '1' to disable interrupt for event TRIGGERED[13] */
#define EGU_INTENCLR_TRIGGERED13_Pos         ( 13UL )                                  /*!< Position of TRIGGERED13 field. */
#define EGU_INTENCLR_TRIGGERED13_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED13_Pos ) /*!< Bit mask of TRIGGERED13 field. */
#define EGU_INTENCLR_TRIGGERED13_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED13_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED13_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 12 : Write '1' to disable interrupt for event TRIGGERED[12] */
#define EGU_INTENCLR_TRIGGERED12_Pos         ( 12UL )                                  /*!< Position of TRIGGERED12 field. */
#define EGU_INTENCLR_TRIGGERED12_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED12_Pos ) /*!< Bit mask of TRIGGERED12 field. */
#define EGU_INTENCLR_TRIGGERED12_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED12_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED12_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 11 : Write '1' to disable interrupt for event TRIGGERED[11] */
#define EGU_INTENCLR_TRIGGERED11_Pos         ( 11UL )                                  /*!< Position of TRIGGERED11 field. */
#define EGU_INTENCLR_TRIGGERED11_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED11_Pos ) /*!< Bit mask of TRIGGERED11 field. */
#define EGU_INTENCLR_TRIGGERED11_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED11_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED11_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 10 : Write '1' to disable interrupt for event TRIGGERED[10] */
#define EGU_INTENCLR_TRIGGERED10_Pos         ( 10UL )                                  /*!< Position of TRIGGERED10 field. */
#define EGU_INTENCLR_TRIGGERED10_Msk         ( 0x1UL << EGU_INTENCLR_TRIGGERED10_Pos ) /*!< Bit mask of TRIGGERED10 field. */
#define EGU_INTENCLR_TRIGGERED10_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED10_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED10_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event TRIGGERED[9] */
#define EGU_INTENCLR_TRIGGERED9_Pos          ( 9UL )                                  /*!< Position of TRIGGERED9 field. */
#define EGU_INTENCLR_TRIGGERED9_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED9_Pos ) /*!< Bit mask of TRIGGERED9 field. */
#define EGU_INTENCLR_TRIGGERED9_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED9_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED9_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 8 : Write '1' to disable interrupt for event TRIGGERED[8] */
#define EGU_INTENCLR_TRIGGERED8_Pos          ( 8UL )                                  /*!< Position of TRIGGERED8 field. */
#define EGU_INTENCLR_TRIGGERED8_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED8_Pos ) /*!< Bit mask of TRIGGERED8 field. */
#define EGU_INTENCLR_TRIGGERED8_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED8_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED8_Clear        ( 1UL )                                  /*!< Disable */

