FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 7 : Write '1' to disable interrupt for event TRIGGERED[7] */
#define EGU_INTENCLR_TRIGGERED7_Pos          ( 7UL )                                  /*!< Position of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED7_Pos ) /*!< Bit mask of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED7_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED7_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event TRIGGERED[6] */
#define EGU_INTENCLR_TRIGGERED6_Pos          ( 6UL )                                  /*!< Position of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED6_Pos ) /*!< Bit mask of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED6_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED6_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event TRIGGERED[5] */
#define EGU_INTENCLR_TRIGGERED5_Pos          ( 5UL )                                  /*!< Position of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED5_Pos ) /*!< Bit mask of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED5_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED5_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event TRIGGERED[4] */
#define EGU_INTENCLR_TRIGGERED4_Pos          ( 4UL )                                  /*!< Position of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED4_Pos ) /*!< Bit mask of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED4_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED4_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event TRIGGERED[3] */
#define EGU_INTENCLR_TRIGGERED3_Pos          ( 3UL )                                  /*!< Position of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED3_Pos ) /*!< Bit mask of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED3_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED3_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event TRIGGERED[2] */
#define EGU_INTENCLR_TRIGGERED2_Pos          ( 2UL )                                  /*!< Position of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED2_Pos ) /*!< Bit mask of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED2_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED2_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event TRIGGERED[1] */
#define EGU_INTENCLR_TRIGGERED1_Pos          ( 1UL )                                  /*!< Position of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED1_Pos ) /*!< Bit mask of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED1_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED1_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event TRIGGERED[0] */
#define EGU_INTENCLR_TRIGGERED0_Pos          ( 0UL )                                  /*!< Position of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED0_Pos ) /*!< Bit mask of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED0_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED0_Clear        ( 1UL )                                  /*!< Disable */


/* Peripheral: FICR */
/* Description: Factory information configuration registers */

/* Register: FICR_CODEPAGESIZE */
/* Description: Code memory page size */

/* Bits 31..0 : Code memory page size */
#define FICR_CODEPAGESIZE_CODEPAGESIZE_Pos    ( 0UL )                                                /*!< Position of CODEPAGESIZE field. */
#define FICR_CODEPAGESIZE_CODEPAGESIZE_Msk    ( 0xFFFFFFFFUL << FICR_CODEPAGESIZE_CODEPAGESIZE_Pos ) /*!< Bit mask of CODEPAGESIZE field. */

/* Register: FICR_CODESIZE */
/* Description: Code memory size */

/* Bits 31..0 : Code memory size in number of pages */
#define FICR_CODESIZE_CODESIZE_Pos    ( 0UL )                                        /*!< Position of CODESIZE field. */
#define FICR_CODESIZE_CODESIZE_Msk    ( 0xFFFFFFFFUL << FICR_CODESIZE_CODESIZE_Pos ) /*!< Bit mask of CODESIZE field. */

/* Register: FICR_DEVICEID */
/* Description: Description collection: Device identifier */

