FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bits 31..0 : 64 bit unique device identifier */
#define FICR_DEVICEID_DEVICEID_Pos    ( 0UL )                                        /*!< Position of DEVICEID field. */
#define FICR_DEVICEID_DEVICEID_Msk    ( 0xFFFFFFFFUL << FICR_DEVICEID_DEVICEID_Pos ) /*!< Bit mask of DEVICEID field. */

/* Register: FICR_ER */
/* Description: Description collection: Encryption root, word n */

/* Bits 31..0 : Encryption root, word n */
#define FICR_ER_ER_Pos    ( 0UL )                            /*!< Position of ER field. */
#define FICR_ER_ER_Msk    ( 0xFFFFFFFFUL << FICR_ER_ER_Pos ) /*!< Bit mask of ER field. */

/* Register: FICR_IR */
/* Description: Description collection: Identity root, word n */

/* Bits 31..0 : Identity root, word n */
#define FICR_IR_IR_Pos    ( 0UL )                            /*!< Position of IR field. */
#define FICR_IR_IR_Msk    ( 0xFFFFFFFFUL << FICR_IR_IR_Pos ) /*!< Bit mask of IR field. */

/* Register: FICR_DEVICEADDRTYPE */
/* Description: Device address type */

/* Bit 0 : Device address type */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Pos       ( 0UL )                                             /*!< Position of DEVICEADDRTYPE field. */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Msk       ( 0x1UL << FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Pos ) /*!< Bit mask of DEVICEADDRTYPE field. */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Public    ( 0UL )                                             /*!< Public address */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Random    ( 1UL )                                             /*!< Random address */

/* Register: FICR_DEVICEADDR */
/* Description: Description collection: Device address n */

/* Bits 31..0 : 48 bit device address */
#define FICR_DEVICEADDR_DEVICEADDR_Pos    ( 0UL )                                            /*!< Position of DEVICEADDR field. */
#define FICR_DEVICEADDR_DEVICEADDR_Msk    ( 0xFFFFFFFFUL << FICR_DEVICEADDR_DEVICEADDR_Pos ) /*!< Bit mask of DEVICEADDR field. */

/* Register: FICR_INFO_PART */
/* Description: Part code */

/* Bits 31..0 : Part code */
#define FICR_INFO_PART_PART_Pos            ( 0UL )                                     /*!< Position of PART field. */
#define FICR_INFO_PART_PART_Msk            ( 0xFFFFFFFFUL << FICR_INFO_PART_PART_Pos ) /*!< Bit mask of PART field. */
#define FICR_INFO_PART_PART_N52805         ( 0x52805UL )                               /*!< nRF52805 */
#define FICR_INFO_PART_PART_N52810         ( 0x52810UL )                               /*!< nRF52810 */
#define FICR_INFO_PART_PART_N52811         ( 0x52811UL )                               /*!< nRF52811 */
#define FICR_INFO_PART_PART_N52832         ( 0x52832UL )                               /*!< nRF52832 */
#define FICR_INFO_PART_PART_Unspecified    ( 0xFFFFFFFFUL )                            /*!< Unspecified */

/* Register: FICR_INFO_VARIANT */
/* Description: Part variant, hardware version and production configuration */

/* Bits 31..0 : Part variant, hardware version and production configuration, encoded as ASCII */
#define FICR_INFO_VARIANT_VARIANT_Pos            ( 0UL )                                           /*!< Position of VARIANT field. */
#define FICR_INFO_VARIANT_VARIANT_Msk            ( 0xFFFFFFFFUL << FICR_INFO_VARIANT_VARIANT_Pos ) /*!< Bit mask of VARIANT field. */
#define FICR_INFO_VARIANT_VARIANT_AAA0           ( 0x41414130UL )                                  /*!< AAA0 */
#define FICR_INFO_VARIANT_VARIANT_AAAA           ( 0x41414141UL )                                  /*!< AAAA */
#define FICR_INFO_VARIANT_VARIANT_AAB0           ( 0x41414230UL )                                  /*!< AAB0 */
#define FICR_INFO_VARIANT_VARIANT_AABA           ( 0x41414241UL )                                  /*!< AABA */
#define FICR_INFO_VARIANT_VARIANT_AABB           ( 0x41414242UL )                                  /*!< AABB */
#define FICR_INFO_VARIANT_VARIANT_AAC0           ( 0x41414330UL )                                  /*!< AAC0 */
#define FICR_INFO_VARIANT_VARIANT_AACA           ( 0x41414341UL )                                  /*!< AACA */
#define FICR_INFO_VARIANT_VARIANT_AACB           ( 0x41414342UL )                                  /*!< AACB */
#define FICR_INFO_VARIANT_VARIANT_Unspecified    ( 0xFFFFFFFFUL )                                  /*!< Unspecified */

/* Register: FICR_INFO_PACKAGE */
/* Description: Package option */

/* Bits 31..0 : Package option */
#define FICR_INFO_PACKAGE_PACKAGE_Pos            ( 0UL )                                           /*!< Position of PACKAGE field. */
#define FICR_INFO_PACKAGE_PACKAGE_Msk            ( 0xFFFFFFFFUL << FICR_INFO_PACKAGE_PACKAGE_Pos ) /*!< Bit mask of PACKAGE field. */
#define FICR_INFO_PACKAGE_PACKAGE_CA             ( 0x2004UL )                                      /*!< CAxx - WLCSP */
#define FICR_INFO_PACKAGE_PACKAGE_Unspecified    ( 0xFFFFFFFFUL )                                  /*!< Unspecified */

/* Register: FICR_INFO_RAM */
/* Description: RAM variant */

/* Bits 31..0 : RAM variant */
#define FICR_INFO_RAM_RAM_Pos            ( 0UL )                                   /*!< Position of RAM field. */
#define FICR_INFO_RAM_RAM_Msk            ( 0xFFFFFFFFUL << FICR_INFO_RAM_RAM_Pos ) /*!< Bit mask of RAM field. */
#define FICR_INFO_RAM_RAM_K24            ( 0x18UL )                                /*!< 24 kByte RAM */
#define FICR_INFO_RAM_RAM_Unspecified    ( 0xFFFFFFFFUL )                          /*!< Unspecified */

/* Register: FICR_INFO_FLASH */
/* Description: Flash variant */

/* Bits 31..0 : Flash variant */
#define FICR_INFO_FLASH_FLASH_Pos            ( 0UL )                                       /*!< Position of FLASH field. */
#define FICR_INFO_FLASH_FLASH_Msk            ( 0xFFFFFFFFUL << FICR_INFO_FLASH_FLASH_Pos ) /*!< Bit mask of FLASH field. */
#define FICR_INFO_FLASH_FLASH_K192           ( 0xC0UL )                                    /*!< 192 kByte flash */
#define FICR_INFO_FLASH_FLASH_Unspecified    ( 0xFFFFFFFFUL )                              /*!< Unspecified */

/* Register: FICR_TEMP_A0 */
/* Description: Slope definition A0 */

/* Bits 11..0 : A (slope definition) register */
#define FICR_TEMP_A0_A_Pos    ( 0UL )                           /*!< Position of A field. */
#define FICR_TEMP_A0_A_Msk    ( 0xFFFUL << FICR_TEMP_A0_A_Pos ) /*!< Bit mask of A field. */

/* Register: FICR_TEMP_A1 */
/* Description: Slope definition A1 */

/* Bits 11..0 : A (slope definition) register */
#define FICR_TEMP_A1_A_Pos    ( 0UL )                           /*!< Position of A field. */
#define FICR_TEMP_A1_A_Msk    ( 0xFFFUL << FICR_TEMP_A1_A_Pos ) /*!< Bit mask of A field. */

