FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: FICR_TEMP_A2 */
/* Description: Slope definition A2 */

/* Bits 11..0 : A (slope definition) register */
#define FICR_TEMP_A2_A_Pos    ( 0UL )                           /*!< Position of A field. */
#define FICR_TEMP_A2_A_Msk    ( 0xFFFUL << FICR_TEMP_A2_A_Pos ) /*!< Bit mask of A field. */

/* Register: FICR_TEMP_A3 */
/* Description: Slope definition A3 */

/* Bits 11..0 : A (slope definition) register */
#define FICR_TEMP_A3_A_Pos    ( 0UL )                           /*!< Position of A field. */
#define FICR_TEMP_A3_A_Msk    ( 0xFFFUL << FICR_TEMP_A3_A_Pos ) /*!< Bit mask of A field. */

/* Register: FICR_TEMP_A4 */
/* Description: Slope definition A4 */

/* Bits 11..0 : A (slope definition) register */
#define FICR_TEMP_A4_A_Pos    ( 0UL )                           /*!< Position of A field. */
#define FICR_TEMP_A4_A_Msk    ( 0xFFFUL << FICR_TEMP_A4_A_Pos ) /*!< Bit mask of A field. */

/* Register: FICR_TEMP_A5 */
/* Description: Slope definition A5 */

/* Bits 11..0 : A (slope definition) register */
#define FICR_TEMP_A5_A_Pos    ( 0UL )                           /*!< Position of A field. */
#define FICR_TEMP_A5_A_Msk    ( 0xFFFUL << FICR_TEMP_A5_A_Pos ) /*!< Bit mask of A field. */

/* Register: FICR_TEMP_B0 */
/* Description: Y-intercept B0 */

/* Bits 13..0 : B (y-intercept) */
#define FICR_TEMP_B0_B_Pos    ( 0UL )                            /*!< Position of B field. */
#define FICR_TEMP_B0_B_Msk    ( 0x3FFFUL << FICR_TEMP_B0_B_Pos ) /*!< Bit mask of B field. */

/* Register: FICR_TEMP_B1 */
/* Description: Y-intercept B1 */

/* Bits 13..0 : B (y-intercept) */
#define FICR_TEMP_B1_B_Pos    ( 0UL )                            /*!< Position of B field. */
#define FICR_TEMP_B1_B_Msk    ( 0x3FFFUL << FICR_TEMP_B1_B_Pos ) /*!< Bit mask of B field. */

/* Register: FICR_TEMP_B2 */
/* Description: Y-intercept B2 */

/* Bits 13..0 : B (y-intercept) */
#define FICR_TEMP_B2_B_Pos    ( 0UL )                            /*!< Position of B field. */
#define FICR_TEMP_B2_B_Msk    ( 0x3FFFUL << FICR_TEMP_B2_B_Pos ) /*!< Bit mask of B field. */

/* Register: FICR_TEMP_B3 */
/* Description: Y-intercept B3 */

/* Bits 13..0 : B (y-intercept) */
#define FICR_TEMP_B3_B_Pos    ( 0UL )                            /*!< Position of B field. */
#define FICR_TEMP_B3_B_Msk    ( 0x3FFFUL << FICR_TEMP_B3_B_Pos ) /*!< Bit mask of B field. */

/* Register: FICR_TEMP_B4 */
/* Description: Y-intercept B4 */

/* Bits 13..0 : B (y-intercept) */
#define FICR_TEMP_B4_B_Pos    ( 0UL )                            /*!< Position of B field. */
#define FICR_TEMP_B4_B_Msk    ( 0x3FFFUL << FICR_TEMP_B4_B_Pos ) /*!< Bit mask of B field. */

/* Register: FICR_TEMP_B5 */
/* Description: Y-intercept B5 */

/* Bits 13..0 : B (y-intercept) */
#define FICR_TEMP_B5_B_Pos    ( 0UL )                            /*!< Position of B field. */
#define FICR_TEMP_B5_B_Msk    ( 0x3FFFUL << FICR_TEMP_B5_B_Pos ) /*!< Bit mask of B field. */

/* Register: FICR_TEMP_T0 */
/* Description: Segment end T0 */

/* Bits 7..0 : T (segment end) register */
#define FICR_TEMP_T0_T_Pos    ( 0UL )                          /*!< Position of T field. */
#define FICR_TEMP_T0_T_Msk    ( 0xFFUL << FICR_TEMP_T0_T_Pos ) /*!< Bit mask of T field. */

/* Register: FICR_TEMP_T1 */
/* Description: Segment end T1 */

/* Bits 7..0 : T (segment end) register */
#define FICR_TEMP_T1_T_Pos    ( 0UL )                          /*!< Position of T field. */
#define FICR_TEMP_T1_T_Msk    ( 0xFFUL << FICR_TEMP_T1_T_Pos ) /*!< Bit mask of T field. */

/* Register: FICR_TEMP_T2 */
/* Description: Segment end T2 */

/* Bits 7..0 : T (segment end) register */
#define FICR_TEMP_T2_T_Pos    ( 0UL )                          /*!< Position of T field. */
#define FICR_TEMP_T2_T_Msk    ( 0xFFUL << FICR_TEMP_T2_T_Pos ) /*!< Bit mask of T field. */

/* Register: FICR_TEMP_T3 */
/* Description: Segment end T3 */

/* Bits 7..0 : T (segment end) register */
#define FICR_TEMP_T3_T_Pos    ( 0UL )                          /*!< Position of T field. */
#define FICR_TEMP_T3_T_Msk    ( 0xFFUL << FICR_TEMP_T3_T_Pos ) /*!< Bit mask of T field. */

/* Register: FICR_TEMP_T4 */
/* Description: Segment end T4 */

/* Bits 7..0 : T (segment end) register */
#define FICR_TEMP_T4_T_Pos    ( 0UL )                          /*!< Position of T field. */
#define FICR_TEMP_T4_T_Msk    ( 0xFFUL << FICR_TEMP_T4_T_Pos ) /*!< Bit mask of T field. */


/* Peripheral: GPIOTE */
/* Description: GPIO Tasks and Events */

/* Register: GPIOTE_TASKS_OUT */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */

/* Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Pos        ( 0UL )                                     /*!< Position of TASKS_OUT field. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Msk        ( 0x1UL << GPIOTE_TASKS_OUT_TASKS_OUT_Pos ) /*!< Bit mask of TASKS_OUT field. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: GPIOTE_TASKS_SET */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */

/* Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */
#define GPIOTE_TASKS_SET_TASKS_SET_Pos        ( 0UL )                                     /*!< Position of TASKS_SET field. */
#define GPIOTE_TASKS_SET_TASKS_SET_Msk        ( 0x1UL << GPIOTE_TASKS_SET_TASKS_SET_Pos ) /*!< Bit mask of TASKS_SET field. */
#define GPIOTE_TASKS_SET_TASKS_SET_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: GPIOTE_TASKS_CLR */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low. */

/* Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low. */
#define GPIOTE_TASKS_CLR_TASKS_CLR_Pos        ( 0UL )                                     /*!< Position of TASKS_CLR field. */
#define GPIOTE_TASKS_CLR_TASKS_CLR_Msk        ( 0x1UL << GPIOTE_TASKS_CLR_TASKS_CLR_Pos ) /*!< Bit mask of TASKS_CLR field. */
#define GPIOTE_TASKS_CLR_TASKS_CLR_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: GPIOTE_EVENTS_IN */
/* Description: Description collection: Event generated from pin specified in CONFIG[n].PSEL */

/* Bit 0 : Event generated from pin specified in CONFIG[n].PSEL */
#define GPIOTE_EVENTS_IN_EVENTS_IN_Pos             ( 0UL )                                     /*!< Position of EVENTS_IN field. */
#define GPIOTE_EVENTS_IN_EVENTS_IN_Msk             ( 0x1UL << GPIOTE_EVENTS_IN_EVENTS_IN_Pos ) /*!< Bit mask of EVENTS_IN field. */
#define GPIOTE_EVENTS_IN_EVENTS_IN_NotGenerated    ( 0UL )                                     /*!< Event not generated */
#define GPIOTE_EVENTS_IN_EVENTS_IN_Generated       ( 1UL )                                     /*!< Event generated */

/* Register: GPIOTE_EVENTS_PORT */
/* Description: Event generated from multiple input GPIO pins with SENSE mechanism enabled */

/* Bit 0 : Event generated from multiple input GPIO pins with SENSE mechanism enabled */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_Pos             ( 0UL )                                         /*!< Position of EVENTS_PORT field. */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_Msk             ( 0x1UL << GPIOTE_EVENTS_PORT_EVENTS_PORT_Pos ) /*!< Bit mask of EVENTS_PORT field. */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_Generated       ( 1UL )                                         /*!< Event generated */

