FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: GPIOTE_INTENSET */
/* Description: Enable interrupt */

/* Bit 31 : Write '1' to enable interrupt for event PORT */
#define GPIOTE_INTENSET_PORT_Pos         ( 31UL )                              /*!< Position of PORT field. */
#define GPIOTE_INTENSET_PORT_Msk         ( 0x1UL << GPIOTE_INTENSET_PORT_Pos ) /*!< Bit mask of PORT field. */
#define GPIOTE_INTENSET_PORT_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define GPIOTE_INTENSET_PORT_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define GPIOTE_INTENSET_PORT_Set         ( 1UL )                               /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event IN[7] */
#define GPIOTE_INTENSET_IN7_Pos          ( 7UL )                              /*!< Position of IN7 field. */
#define GPIOTE_INTENSET_IN7_Msk          ( 0x1UL << GPIOTE_INTENSET_IN7_Pos ) /*!< Bit mask of IN7 field. */
#define GPIOTE_INTENSET_IN7_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN7_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN7_Set          ( 1UL )                              /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event IN[6] */
#define GPIOTE_INTENSET_IN6_Pos          ( 6UL )                              /*!< Position of IN6 field. */
#define GPIOTE_INTENSET_IN6_Msk          ( 0x1UL << GPIOTE_INTENSET_IN6_Pos ) /*!< Bit mask of IN6 field. */
#define GPIOTE_INTENSET_IN6_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN6_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN6_Set          ( 1UL )                              /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event IN[5] */
#define GPIOTE_INTENSET_IN5_Pos          ( 5UL )                              /*!< Position of IN5 field. */
#define GPIOTE_INTENSET_IN5_Msk          ( 0x1UL << GPIOTE_INTENSET_IN5_Pos ) /*!< Bit mask of IN5 field. */
#define GPIOTE_INTENSET_IN5_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN5_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN5_Set          ( 1UL )                              /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event IN[4] */
#define GPIOTE_INTENSET_IN4_Pos          ( 4UL )                              /*!< Position of IN4 field. */
#define GPIOTE_INTENSET_IN4_Msk          ( 0x1UL << GPIOTE_INTENSET_IN4_Pos ) /*!< Bit mask of IN4 field. */
#define GPIOTE_INTENSET_IN4_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN4_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN4_Set          ( 1UL )                              /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event IN[3] */
#define GPIOTE_INTENSET_IN3_Pos          ( 3UL )                              /*!< Position of IN3 field. */
#define GPIOTE_INTENSET_IN3_Msk          ( 0x1UL << GPIOTE_INTENSET_IN3_Pos ) /*!< Bit mask of IN3 field. */
#define GPIOTE_INTENSET_IN3_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN3_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN3_Set          ( 1UL )                              /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event IN[2] */
#define GPIOTE_INTENSET_IN2_Pos          ( 2UL )                              /*!< Position of IN2 field. */
#define GPIOTE_INTENSET_IN2_Msk          ( 0x1UL << GPIOTE_INTENSET_IN2_Pos ) /*!< Bit mask of IN2 field. */
#define GPIOTE_INTENSET_IN2_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN2_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN2_Set          ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event IN[1] */
#define GPIOTE_INTENSET_IN1_Pos          ( 1UL )                              /*!< Position of IN1 field. */
#define GPIOTE_INTENSET_IN1_Msk          ( 0x1UL << GPIOTE_INTENSET_IN1_Pos ) /*!< Bit mask of IN1 field. */
#define GPIOTE_INTENSET_IN1_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN1_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN1_Set          ( 1UL )                              /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event IN[0] */
#define GPIOTE_INTENSET_IN0_Pos          ( 0UL )                              /*!< Position of IN0 field. */
#define GPIOTE_INTENSET_IN0_Msk          ( 0x1UL << GPIOTE_INTENSET_IN0_Pos ) /*!< Bit mask of IN0 field. */
#define GPIOTE_INTENSET_IN0_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENSET_IN0_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENSET_IN0_Set          ( 1UL )                              /*!< Enable */

/* Register: GPIOTE_INTENCLR */
/* Description: Disable interrupt */

/* Bit 31 : Write '1' to disable interrupt for event PORT */
#define GPIOTE_INTENCLR_PORT_Pos         ( 31UL )                              /*!< Position of PORT field. */
#define GPIOTE_INTENCLR_PORT_Msk         ( 0x1UL << GPIOTE_INTENCLR_PORT_Pos ) /*!< Bit mask of PORT field. */
#define GPIOTE_INTENCLR_PORT_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define GPIOTE_INTENCLR_PORT_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define GPIOTE_INTENCLR_PORT_Clear       ( 1UL )                               /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event IN[7] */
#define GPIOTE_INTENCLR_IN7_Pos          ( 7UL )                              /*!< Position of IN7 field. */
#define GPIOTE_INTENCLR_IN7_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN7_Pos ) /*!< Bit mask of IN7 field. */
#define GPIOTE_INTENCLR_IN7_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN7_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN7_Clear        ( 1UL )                              /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event IN[6] */
#define GPIOTE_INTENCLR_IN6_Pos          ( 6UL )                              /*!< Position of IN6 field. */
#define GPIOTE_INTENCLR_IN6_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN6_Pos ) /*!< Bit mask of IN6 field. */
#define GPIOTE_INTENCLR_IN6_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN6_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN6_Clear        ( 1UL )                              /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event IN[5] */
#define GPIOTE_INTENCLR_IN5_Pos          ( 5UL )                              /*!< Position of IN5 field. */
#define GPIOTE_INTENCLR_IN5_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN5_Pos ) /*!< Bit mask of IN5 field. */
#define GPIOTE_INTENCLR_IN5_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN5_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN5_Clear        ( 1UL )                              /*!< Disable */

