FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 23 : Pin 23 */
#define GPIO_OUTCLR_PIN23_Pos      ( 23UL )                           /*!< Position of PIN23 field. */
#define GPIO_OUTCLR_PIN23_Msk      ( 0x1UL << GPIO_OUTCLR_PIN23_Pos ) /*!< Bit mask of PIN23 field. */
#define GPIO_OUTCLR_PIN23_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN23_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN23_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 22 : Pin 22 */
#define GPIO_OUTCLR_PIN22_Pos      ( 22UL )                           /*!< Position of PIN22 field. */
#define GPIO_OUTCLR_PIN22_Msk      ( 0x1UL << GPIO_OUTCLR_PIN22_Pos ) /*!< Bit mask of PIN22 field. */
#define GPIO_OUTCLR_PIN22_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN22_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN22_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 21 : Pin 21 */
#define GPIO_OUTCLR_PIN21_Pos      ( 21UL )                           /*!< Position of PIN21 field. */
#define GPIO_OUTCLR_PIN21_Msk      ( 0x1UL << GPIO_OUTCLR_PIN21_Pos ) /*!< Bit mask of PIN21 field. */
#define GPIO_OUTCLR_PIN21_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN21_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN21_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 20 : Pin 20 */
#define GPIO_OUTCLR_PIN20_Pos      ( 20UL )                           /*!< Position of PIN20 field. */
#define GPIO_OUTCLR_PIN20_Msk      ( 0x1UL << GPIO_OUTCLR_PIN20_Pos ) /*!< Bit mask of PIN20 field. */
#define GPIO_OUTCLR_PIN20_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN20_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN20_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 19 : Pin 19 */
#define GPIO_OUTCLR_PIN19_Pos      ( 19UL )                           /*!< Position of PIN19 field. */
#define GPIO_OUTCLR_PIN19_Msk      ( 0x1UL << GPIO_OUTCLR_PIN19_Pos ) /*!< Bit mask of PIN19 field. */
#define GPIO_OUTCLR_PIN19_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN19_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN19_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 18 : Pin 18 */
#define GPIO_OUTCLR_PIN18_Pos      ( 18UL )                           /*!< Position of PIN18 field. */
#define GPIO_OUTCLR_PIN18_Msk      ( 0x1UL << GPIO_OUTCLR_PIN18_Pos ) /*!< Bit mask of PIN18 field. */
#define GPIO_OUTCLR_PIN18_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN18_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN18_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 17 : Pin 17 */
#define GPIO_OUTCLR_PIN17_Pos      ( 17UL )                           /*!< Position of PIN17 field. */
#define GPIO_OUTCLR_PIN17_Msk      ( 0x1UL << GPIO_OUTCLR_PIN17_Pos ) /*!< Bit mask of PIN17 field. */
#define GPIO_OUTCLR_PIN17_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN17_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN17_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 16 : Pin 16 */
#define GPIO_OUTCLR_PIN16_Pos      ( 16UL )                           /*!< Position of PIN16 field. */
#define GPIO_OUTCLR_PIN16_Msk      ( 0x1UL << GPIO_OUTCLR_PIN16_Pos ) /*!< Bit mask of PIN16 field. */
#define GPIO_OUTCLR_PIN16_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN16_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN16_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 15 : Pin 15 */
#define GPIO_OUTCLR_PIN15_Pos      ( 15UL )                           /*!< Position of PIN15 field. */
#define GPIO_OUTCLR_PIN15_Msk      ( 0x1UL << GPIO_OUTCLR_PIN15_Pos ) /*!< Bit mask of PIN15 field. */
#define GPIO_OUTCLR_PIN15_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN15_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN15_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 14 : Pin 14 */
#define GPIO_OUTCLR_PIN14_Pos      ( 14UL )                           /*!< Position of PIN14 field. */
#define GPIO_OUTCLR_PIN14_Msk      ( 0x1UL << GPIO_OUTCLR_PIN14_Pos ) /*!< Bit mask of PIN14 field. */
#define GPIO_OUTCLR_PIN14_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN14_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN14_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 13 : Pin 13 */
#define GPIO_OUTCLR_PIN13_Pos      ( 13UL )                           /*!< Position of PIN13 field. */
#define GPIO_OUTCLR_PIN13_Msk      ( 0x1UL << GPIO_OUTCLR_PIN13_Pos ) /*!< Bit mask of PIN13 field. */
#define GPIO_OUTCLR_PIN13_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN13_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN13_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 12 : Pin 12 */
#define GPIO_OUTCLR_PIN12_Pos      ( 12UL )                           /*!< Position of PIN12 field. */
#define GPIO_OUTCLR_PIN12_Msk      ( 0x1UL << GPIO_OUTCLR_PIN12_Pos ) /*!< Bit mask of PIN12 field. */
#define GPIO_OUTCLR_PIN12_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN12_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN12_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 11 : Pin 11 */
#define GPIO_OUTCLR_PIN11_Pos      ( 11UL )                           /*!< Position of PIN11 field. */
#define GPIO_OUTCLR_PIN11_Msk      ( 0x1UL << GPIO_OUTCLR_PIN11_Pos ) /*!< Bit mask of PIN11 field. */
#define GPIO_OUTCLR_PIN11_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN11_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN11_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 10 : Pin 10 */
#define GPIO_OUTCLR_PIN10_Pos      ( 10UL )                           /*!< Position of PIN10 field. */
#define GPIO_OUTCLR_PIN10_Msk      ( 0x1UL << GPIO_OUTCLR_PIN10_Pos ) /*!< Bit mask of PIN10 field. */
#define GPIO_OUTCLR_PIN10_Low      ( 0UL )                            /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN10_High     ( 1UL )                            /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN10_Clear    ( 1UL )                            /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 9 : Pin 9 */
#define GPIO_OUTCLR_PIN9_Pos       ( 9UL )                           /*!< Position of PIN9 field. */
#define GPIO_OUTCLR_PIN9_Msk       ( 0x1UL << GPIO_OUTCLR_PIN9_Pos ) /*!< Bit mask of PIN9 field. */
#define GPIO_OUTCLR_PIN9_Low       ( 0UL )                           /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN9_High      ( 1UL )                           /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN9_Clear     ( 1UL )                           /*!< Write: a '1' sets the pin low; a '0' has no effect */

