FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 23 : Pin 23 */
#define GPIO_IN_PIN23_Pos     ( 23UL )                       /*!< Position of PIN23 field. */
#define GPIO_IN_PIN23_Msk     ( 0x1UL << GPIO_IN_PIN23_Pos ) /*!< Bit mask of PIN23 field. */
#define GPIO_IN_PIN23_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN23_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 22 : Pin 22 */
#define GPIO_IN_PIN22_Pos     ( 22UL )                       /*!< Position of PIN22 field. */
#define GPIO_IN_PIN22_Msk     ( 0x1UL << GPIO_IN_PIN22_Pos ) /*!< Bit mask of PIN22 field. */
#define GPIO_IN_PIN22_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN22_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 21 : Pin 21 */
#define GPIO_IN_PIN21_Pos     ( 21UL )                       /*!< Position of PIN21 field. */
#define GPIO_IN_PIN21_Msk     ( 0x1UL << GPIO_IN_PIN21_Pos ) /*!< Bit mask of PIN21 field. */
#define GPIO_IN_PIN21_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN21_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 20 : Pin 20 */
#define GPIO_IN_PIN20_Pos     ( 20UL )                       /*!< Position of PIN20 field. */
#define GPIO_IN_PIN20_Msk     ( 0x1UL << GPIO_IN_PIN20_Pos ) /*!< Bit mask of PIN20 field. */
#define GPIO_IN_PIN20_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN20_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 19 : Pin 19 */
#define GPIO_IN_PIN19_Pos     ( 19UL )                       /*!< Position of PIN19 field. */
#define GPIO_IN_PIN19_Msk     ( 0x1UL << GPIO_IN_PIN19_Pos ) /*!< Bit mask of PIN19 field. */
#define GPIO_IN_PIN19_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN19_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 18 : Pin 18 */
#define GPIO_IN_PIN18_Pos     ( 18UL )                       /*!< Position of PIN18 field. */
#define GPIO_IN_PIN18_Msk     ( 0x1UL << GPIO_IN_PIN18_Pos ) /*!< Bit mask of PIN18 field. */
#define GPIO_IN_PIN18_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN18_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 17 : Pin 17 */
#define GPIO_IN_PIN17_Pos     ( 17UL )                       /*!< Position of PIN17 field. */
#define GPIO_IN_PIN17_Msk     ( 0x1UL << GPIO_IN_PIN17_Pos ) /*!< Bit mask of PIN17 field. */
#define GPIO_IN_PIN17_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN17_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 16 : Pin 16 */
#define GPIO_IN_PIN16_Pos     ( 16UL )                       /*!< Position of PIN16 field. */
#define GPIO_IN_PIN16_Msk     ( 0x1UL << GPIO_IN_PIN16_Pos ) /*!< Bit mask of PIN16 field. */
#define GPIO_IN_PIN16_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN16_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 15 : Pin 15 */
#define GPIO_IN_PIN15_Pos     ( 15UL )                       /*!< Position of PIN15 field. */
#define GPIO_IN_PIN15_Msk     ( 0x1UL << GPIO_IN_PIN15_Pos ) /*!< Bit mask of PIN15 field. */
#define GPIO_IN_PIN15_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN15_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 14 : Pin 14 */
#define GPIO_IN_PIN14_Pos     ( 14UL )                       /*!< Position of PIN14 field. */
#define GPIO_IN_PIN14_Msk     ( 0x1UL << GPIO_IN_PIN14_Pos ) /*!< Bit mask of PIN14 field. */
#define GPIO_IN_PIN14_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN14_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 13 : Pin 13 */
#define GPIO_IN_PIN13_Pos     ( 13UL )                       /*!< Position of PIN13 field. */
#define GPIO_IN_PIN13_Msk     ( 0x1UL << GPIO_IN_PIN13_Pos ) /*!< Bit mask of PIN13 field. */
#define GPIO_IN_PIN13_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN13_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 12 : Pin 12 */
#define GPIO_IN_PIN12_Pos     ( 12UL )                       /*!< Position of PIN12 field. */
#define GPIO_IN_PIN12_Msk     ( 0x1UL << GPIO_IN_PIN12_Pos ) /*!< Bit mask of PIN12 field. */
#define GPIO_IN_PIN12_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN12_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 11 : Pin 11 */
#define GPIO_IN_PIN11_Pos     ( 11UL )                       /*!< Position of PIN11 field. */
#define GPIO_IN_PIN11_Msk     ( 0x1UL << GPIO_IN_PIN11_Pos ) /*!< Bit mask of PIN11 field. */
#define GPIO_IN_PIN11_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN11_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 10 : Pin 10 */
#define GPIO_IN_PIN10_Pos     ( 10UL )                       /*!< Position of PIN10 field. */
#define GPIO_IN_PIN10_Msk     ( 0x1UL << GPIO_IN_PIN10_Pos ) /*!< Bit mask of PIN10 field. */
#define GPIO_IN_PIN10_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN10_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 9 : Pin 9 */
#define GPIO_IN_PIN9_Pos      ( 9UL )                       /*!< Position of PIN9 field. */
#define GPIO_IN_PIN9_Msk      ( 0x1UL << GPIO_IN_PIN9_Pos ) /*!< Bit mask of PIN9 field. */
#define GPIO_IN_PIN9_Low      ( 0UL )                       /*!< Pin input is low */
#define GPIO_IN_PIN9_High     ( 1UL )                       /*!< Pin input is high */

/* Bit 8 : Pin 8 */
#define GPIO_IN_PIN8_Pos      ( 8UL )                       /*!< Position of PIN8 field. */
#define GPIO_IN_PIN8_Msk      ( 0x1UL << GPIO_IN_PIN8_Pos ) /*!< Bit mask of PIN8 field. */
#define GPIO_IN_PIN8_Low      ( 0UL )                       /*!< Pin input is low */
#define GPIO_IN_PIN8_High     ( 1UL )                       /*!< Pin input is high */

/* Bit 7 : Pin 7 */
#define GPIO_IN_PIN7_Pos      ( 7UL )                       /*!< Position of PIN7 field. */
#define GPIO_IN_PIN7_Msk      ( 0x1UL << GPIO_IN_PIN7_Pos ) /*!< Bit mask of PIN7 field. */
#define GPIO_IN_PIN7_Low      ( 0UL )                       /*!< Pin input is low */
#define GPIO_IN_PIN7_High     ( 1UL )                       /*!< Pin input is high */

/* Bit 6 : Pin 6 */
#define GPIO_IN_PIN6_Pos      ( 6UL )                       /*!< Position of PIN6 field. */
#define GPIO_IN_PIN6_Msk      ( 0x1UL << GPIO_IN_PIN6_Pos ) /*!< Bit mask of PIN6 field. */
#define GPIO_IN_PIN6_Low      ( 0UL )                       /*!< Pin input is low */
#define GPIO_IN_PIN6_High     ( 1UL )                       /*!< Pin input is high */

/* Bit 5 : Pin 5 */
#define GPIO_IN_PIN5_Pos      ( 5UL )                       /*!< Position of PIN5 field. */
#define GPIO_IN_PIN5_Msk      ( 0x1UL << GPIO_IN_PIN5_Pos ) /*!< Bit mask of PIN5 field. */
#define GPIO_IN_PIN5_Low      ( 0UL )                       /*!< Pin input is low */
#define GPIO_IN_PIN5_High     ( 1UL )                       /*!< Pin input is high */

/* Bit 4 : Pin 4 */
#define GPIO_IN_PIN4_Pos      ( 4UL )                       /*!< Position of PIN4 field. */
#define GPIO_IN_PIN4_Msk      ( 0x1UL << GPIO_IN_PIN4_Pos ) /*!< Bit mask of PIN4 field. */
#define GPIO_IN_PIN4_Low      ( 0UL )                       /*!< Pin input is low */
#define GPIO_IN_PIN4_High     ( 1UL )                       /*!< Pin input is high */

/* Bit 3 : Pin 3 */
#define GPIO_IN_PIN3_Pos      ( 3UL )                       /*!< Position of PIN3 field. */
#define GPIO_IN_PIN3_Msk      ( 0x1UL << GPIO_IN_PIN3_Pos ) /*!< Bit mask of PIN3 field. */
#define GPIO_IN_PIN3_Low      ( 0UL )                       /*!< Pin input is low */
#define GPIO_IN_PIN3_High     ( 1UL )                       /*!< Pin input is high */

/* Bit 2 : Pin 2 */
#define GPIO_IN_PIN2_Pos      ( 2UL )                       /*!< Position of PIN2 field. */
#define GPIO_IN_PIN2_Msk      ( 0x1UL << GPIO_IN_PIN2_Pos ) /*!< Bit mask of PIN2 field. */
#define GPIO_IN_PIN2_Low      ( 0UL )                       /*!< Pin input is low */
#define GPIO_IN_PIN2_High     ( 1UL )                       /*!< Pin input is high */

/* Bit 1 : Pin 1 */
#define GPIO_IN_PIN1_Pos      ( 1UL )                       /*!< Position of PIN1 field. */
#define GPIO_IN_PIN1_Msk      ( 0x1UL << GPIO_IN_PIN1_Pos ) /*!< Bit mask of PIN1 field. */
#define GPIO_IN_PIN1_Low      ( 0UL )                       /*!< Pin input is low */
#define GPIO_IN_PIN1_High     ( 1UL )                       /*!< Pin input is high */

/* Bit 0 : Pin 0 */
#define GPIO_IN_PIN0_Pos      ( 0UL )                       /*!< Position of PIN0 field. */
#define GPIO_IN_PIN0_Msk      ( 0x1UL << GPIO_IN_PIN0_Pos ) /*!< Bit mask of PIN0 field. */
#define GPIO_IN_PIN0_Low      ( 0UL )                       /*!< Pin input is low */
#define GPIO_IN_PIN0_High     ( 1UL )                       /*!< Pin input is high */

/* Register: GPIO_DIR */
/* Description: Direction of GPIO pins */

/* Bit 31 : Pin 31 */
#define GPIO_DIR_PIN31_Pos       ( 31UL )                        /*!< Position of PIN31 field. */
#define GPIO_DIR_PIN31_Msk       ( 0x1UL << GPIO_DIR_PIN31_Pos ) /*!< Bit mask of PIN31 field. */
#define GPIO_DIR_PIN31_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN31_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 30 : Pin 30 */
#define GPIO_DIR_PIN30_Pos       ( 30UL )                        /*!< Position of PIN30 field. */
#define GPIO_DIR_PIN30_Msk       ( 0x1UL << GPIO_DIR_PIN30_Pos ) /*!< Bit mask of PIN30 field. */
#define GPIO_DIR_PIN30_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN30_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 29 : Pin 29 */
#define GPIO_DIR_PIN29_Pos       ( 29UL )                        /*!< Position of PIN29 field. */
#define GPIO_DIR_PIN29_Msk       ( 0x1UL << GPIO_DIR_PIN29_Pos ) /*!< Bit mask of PIN29 field. */
#define GPIO_DIR_PIN29_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN29_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 28 : Pin 28 */
#define GPIO_DIR_PIN28_Pos       ( 28UL )                        /*!< Position of PIN28 field. */
#define GPIO_DIR_PIN28_Msk       ( 0x1UL << GPIO_DIR_PIN28_Pos ) /*!< Bit mask of PIN28 field. */
#define GPIO_DIR_PIN28_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN28_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 27 : Pin 27 */
#define GPIO_DIR_PIN27_Pos       ( 27UL )                        /*!< Position of PIN27 field. */
#define GPIO_DIR_PIN27_Msk       ( 0x1UL << GPIO_DIR_PIN27_Pos ) /*!< Bit mask of PIN27 field. */
#define GPIO_DIR_PIN27_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN27_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 26 : Pin 26 */
#define GPIO_DIR_PIN26_Pos       ( 26UL )                        /*!< Position of PIN26 field. */
#define GPIO_DIR_PIN26_Msk       ( 0x1UL << GPIO_DIR_PIN26_Pos ) /*!< Bit mask of PIN26 field. */
#define GPIO_DIR_PIN26_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN26_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 25 : Pin 25 */
#define GPIO_DIR_PIN25_Pos       ( 25UL )                        /*!< Position of PIN25 field. */
#define GPIO_DIR_PIN25_Msk       ( 0x1UL << GPIO_DIR_PIN25_Pos ) /*!< Bit mask of PIN25 field. */
#define GPIO_DIR_PIN25_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN25_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 24 : Pin 24 */
#define GPIO_DIR_PIN24_Pos       ( 24UL )                        /*!< Position of PIN24 field. */
#define GPIO_DIR_PIN24_Msk       ( 0x1UL << GPIO_DIR_PIN24_Pos ) /*!< Bit mask of PIN24 field. */
#define GPIO_DIR_PIN24_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN24_Output    ( 1UL )                         /*!< Pin set as output */

