FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 6 : Set as input pin 6 */
#define GPIO_DIRCLR_PIN6_Pos        ( 6UL )                           /*!< Position of PIN6 field. */
#define GPIO_DIRCLR_PIN6_Msk        ( 0x1UL << GPIO_DIRCLR_PIN6_Pos ) /*!< Bit mask of PIN6 field. */
#define GPIO_DIRCLR_PIN6_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN6_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN6_Clear      ( 1UL )                           /*!< Write: a '1' sets pin to input; a '0' has no effect */

/* Bit 5 : Set as input pin 5 */
#define GPIO_DIRCLR_PIN5_Pos        ( 5UL )                           /*!< Position of PIN5 field. */
#define GPIO_DIRCLR_PIN5_Msk        ( 0x1UL << GPIO_DIRCLR_PIN5_Pos ) /*!< Bit mask of PIN5 field. */
#define GPIO_DIRCLR_PIN5_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN5_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN5_Clear      ( 1UL )                           /*!< Write: a '1' sets pin to input; a '0' has no effect */

/* Bit 4 : Set as input pin 4 */
#define GPIO_DIRCLR_PIN4_Pos        ( 4UL )                           /*!< Position of PIN4 field. */
#define GPIO_DIRCLR_PIN4_Msk        ( 0x1UL << GPIO_DIRCLR_PIN4_Pos ) /*!< Bit mask of PIN4 field. */
#define GPIO_DIRCLR_PIN4_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN4_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN4_Clear      ( 1UL )                           /*!< Write: a '1' sets pin to input; a '0' has no effect */

/* Bit 3 : Set as input pin 3 */
#define GPIO_DIRCLR_PIN3_Pos        ( 3UL )                           /*!< Position of PIN3 field. */
#define GPIO_DIRCLR_PIN3_Msk        ( 0x1UL << GPIO_DIRCLR_PIN3_Pos ) /*!< Bit mask of PIN3 field. */
#define GPIO_DIRCLR_PIN3_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN3_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN3_Clear      ( 1UL )                           /*!< Write: a '1' sets pin to input; a '0' has no effect */

/* Bit 2 : Set as input pin 2 */
#define GPIO_DIRCLR_PIN2_Pos        ( 2UL )                           /*!< Position of PIN2 field. */
#define GPIO_DIRCLR_PIN2_Msk        ( 0x1UL << GPIO_DIRCLR_PIN2_Pos ) /*!< Bit mask of PIN2 field. */
#define GPIO_DIRCLR_PIN2_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN2_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN2_Clear      ( 1UL )                           /*!< Write: a '1' sets pin to input; a '0' has no effect */

/* Bit 1 : Set as input pin 1 */
#define GPIO_DIRCLR_PIN1_Pos        ( 1UL )                           /*!< Position of PIN1 field. */
#define GPIO_DIRCLR_PIN1_Msk        ( 0x1UL << GPIO_DIRCLR_PIN1_Pos ) /*!< Bit mask of PIN1 field. */
#define GPIO_DIRCLR_PIN1_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN1_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN1_Clear      ( 1UL )                           /*!< Write: a '1' sets pin to input; a '0' has no effect */

/* Bit 0 : Set as input pin 0 */
#define GPIO_DIRCLR_PIN0_Pos        ( 0UL )                           /*!< Position of PIN0 field. */
#define GPIO_DIRCLR_PIN0_Msk        ( 0x1UL << GPIO_DIRCLR_PIN0_Pos ) /*!< Bit mask of PIN0 field. */
#define GPIO_DIRCLR_PIN0_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN0_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN0_Clear      ( 1UL )                           /*!< Write: a '1' sets pin to input; a '0' has no effect */

/* Register: GPIO_LATCH */
/* Description: Latch register indicating what GPIO pins that have met the criteria set in the PIN_CNF[n].SENSE registers */

/* Bit 31 : Status on whether PIN31 has met criteria set in PIN_CNF31.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN31_Pos           ( 31UL )                          /*!< Position of PIN31 field. */
#define GPIO_LATCH_PIN31_Msk           ( 0x1UL << GPIO_LATCH_PIN31_Pos ) /*!< Bit mask of PIN31 field. */
#define GPIO_LATCH_PIN31_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN31_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 30 : Status on whether PIN30 has met criteria set in PIN_CNF30.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN30_Pos           ( 30UL )                          /*!< Position of PIN30 field. */
#define GPIO_LATCH_PIN30_Msk           ( 0x1UL << GPIO_LATCH_PIN30_Pos ) /*!< Bit mask of PIN30 field. */
#define GPIO_LATCH_PIN30_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN30_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 29 : Status on whether PIN29 has met criteria set in PIN_CNF29.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN29_Pos           ( 29UL )                          /*!< Position of PIN29 field. */
#define GPIO_LATCH_PIN29_Msk           ( 0x1UL << GPIO_LATCH_PIN29_Pos ) /*!< Bit mask of PIN29 field. */
#define GPIO_LATCH_PIN29_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN29_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 28 : Status on whether PIN28 has met criteria set in PIN_CNF28.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN28_Pos           ( 28UL )                          /*!< Position of PIN28 field. */
#define GPIO_LATCH_PIN28_Msk           ( 0x1UL << GPIO_LATCH_PIN28_Pos ) /*!< Bit mask of PIN28 field. */
#define GPIO_LATCH_PIN28_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN28_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 27 : Status on whether PIN27 has met criteria set in PIN_CNF27.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN27_Pos           ( 27UL )                          /*!< Position of PIN27 field. */
#define GPIO_LATCH_PIN27_Msk           ( 0x1UL << GPIO_LATCH_PIN27_Pos ) /*!< Bit mask of PIN27 field. */
#define GPIO_LATCH_PIN27_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN27_Latched       ( 1UL )                           /*!< Criteria has been met */

