FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 12 : Status on whether PIN12 has met criteria set in PIN_CNF12.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN12_Pos           ( 12UL )                          /*!< Position of PIN12 field. */
#define GPIO_LATCH_PIN12_Msk           ( 0x1UL << GPIO_LATCH_PIN12_Pos ) /*!< Bit mask of PIN12 field. */
#define GPIO_LATCH_PIN12_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN12_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 11 : Status on whether PIN11 has met criteria set in PIN_CNF11.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN11_Pos           ( 11UL )                          /*!< Position of PIN11 field. */
#define GPIO_LATCH_PIN11_Msk           ( 0x1UL << GPIO_LATCH_PIN11_Pos ) /*!< Bit mask of PIN11 field. */
#define GPIO_LATCH_PIN11_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN11_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 10 : Status on whether PIN10 has met criteria set in PIN_CNF10.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN10_Pos           ( 10UL )                          /*!< Position of PIN10 field. */
#define GPIO_LATCH_PIN10_Msk           ( 0x1UL << GPIO_LATCH_PIN10_Pos ) /*!< Bit mask of PIN10 field. */
#define GPIO_LATCH_PIN10_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN10_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 9 : Status on whether PIN9 has met criteria set in PIN_CNF9.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN9_Pos            ( 9UL )                          /*!< Position of PIN9 field. */
#define GPIO_LATCH_PIN9_Msk            ( 0x1UL << GPIO_LATCH_PIN9_Pos ) /*!< Bit mask of PIN9 field. */
#define GPIO_LATCH_PIN9_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN9_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 8 : Status on whether PIN8 has met criteria set in PIN_CNF8.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN8_Pos            ( 8UL )                          /*!< Position of PIN8 field. */
#define GPIO_LATCH_PIN8_Msk            ( 0x1UL << GPIO_LATCH_PIN8_Pos ) /*!< Bit mask of PIN8 field. */
#define GPIO_LATCH_PIN8_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN8_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 7 : Status on whether PIN7 has met criteria set in PIN_CNF7.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN7_Pos            ( 7UL )                          /*!< Position of PIN7 field. */
#define GPIO_LATCH_PIN7_Msk            ( 0x1UL << GPIO_LATCH_PIN7_Pos ) /*!< Bit mask of PIN7 field. */
#define GPIO_LATCH_PIN7_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN7_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 6 : Status on whether PIN6 has met criteria set in PIN_CNF6.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN6_Pos            ( 6UL )                          /*!< Position of PIN6 field. */
#define GPIO_LATCH_PIN6_Msk            ( 0x1UL << GPIO_LATCH_PIN6_Pos ) /*!< Bit mask of PIN6 field. */
#define GPIO_LATCH_PIN6_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN6_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 5 : Status on whether PIN5 has met criteria set in PIN_CNF5.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN5_Pos            ( 5UL )                          /*!< Position of PIN5 field. */
#define GPIO_LATCH_PIN5_Msk            ( 0x1UL << GPIO_LATCH_PIN5_Pos ) /*!< Bit mask of PIN5 field. */
#define GPIO_LATCH_PIN5_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN5_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 4 : Status on whether PIN4 has met criteria set in PIN_CNF4.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN4_Pos            ( 4UL )                          /*!< Position of PIN4 field. */
#define GPIO_LATCH_PIN4_Msk            ( 0x1UL << GPIO_LATCH_PIN4_Pos ) /*!< Bit mask of PIN4 field. */
#define GPIO_LATCH_PIN4_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN4_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 3 : Status on whether PIN3 has met criteria set in PIN_CNF3.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN3_Pos            ( 3UL )                          /*!< Position of PIN3 field. */
#define GPIO_LATCH_PIN3_Msk            ( 0x1UL << GPIO_LATCH_PIN3_Pos ) /*!< Bit mask of PIN3 field. */
#define GPIO_LATCH_PIN3_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN3_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 2 : Status on whether PIN2 has met criteria set in PIN_CNF2.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN2_Pos            ( 2UL )                          /*!< Position of PIN2 field. */
#define GPIO_LATCH_PIN2_Msk            ( 0x1UL << GPIO_LATCH_PIN2_Pos ) /*!< Bit mask of PIN2 field. */
#define GPIO_LATCH_PIN2_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN2_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 1 : Status on whether PIN1 has met criteria set in PIN_CNF1.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN1_Pos            ( 1UL )                          /*!< Position of PIN1 field. */
#define GPIO_LATCH_PIN1_Msk            ( 0x1UL << GPIO_LATCH_PIN1_Pos ) /*!< Bit mask of PIN1 field. */
#define GPIO_LATCH_PIN1_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN1_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 0 : Status on whether PIN0 has met criteria set in PIN_CNF0.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN0_Pos            ( 0UL )                          /*!< Position of PIN0 field. */
#define GPIO_LATCH_PIN0_Msk            ( 0x1UL << GPIO_LATCH_PIN0_Pos ) /*!< Bit mask of PIN0 field. */
#define GPIO_LATCH_PIN0_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN0_Latched        ( 1UL )                          /*!< Criteria has been met */

