FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: GPIO_DETECTMODE */
/* Description: Select between default DETECT signal behavior and LDETECT mode */

/* Bit 0 : Select between default DETECT signal behavior and LDETECT mode */
#define GPIO_DETECTMODE_DETECTMODE_Pos        ( 0UL )                                     /*!< Position of DETECTMODE field. */
#define GPIO_DETECTMODE_DETECTMODE_Msk        ( 0x1UL << GPIO_DETECTMODE_DETECTMODE_Pos ) /*!< Bit mask of DETECTMODE field. */
#define GPIO_DETECTMODE_DETECTMODE_Default    ( 0UL )                                     /*!< DETECT directly connected to PIN DETECT signals */
#define GPIO_DETECTMODE_DETECTMODE_LDETECT    ( 1UL )                                     /*!< Use the latched LDETECT behavior */

/* Register: GPIO_PIN_CNF */
/* Description: Description collection: Configuration of GPIO pins */

/* Bits 17..16 : Pin sensing mechanism */
#define GPIO_PIN_CNF_SENSE_Pos           ( 16UL )                            /*!< Position of SENSE field. */
#define GPIO_PIN_CNF_SENSE_Msk           ( 0x3UL << GPIO_PIN_CNF_SENSE_Pos ) /*!< Bit mask of SENSE field. */
#define GPIO_PIN_CNF_SENSE_Disabled      ( 0UL )                             /*!< Disabled */
#define GPIO_PIN_CNF_SENSE_High          ( 2UL )                             /*!< Sense for high level */
#define GPIO_PIN_CNF_SENSE_Low           ( 3UL )                             /*!< Sense for low level */

/* Bits 10..8 : Drive configuration */
#define GPIO_PIN_CNF_DRIVE_Pos           ( 8UL )                             /*!< Position of DRIVE field. */
#define GPIO_PIN_CNF_DRIVE_Msk           ( 0x7UL << GPIO_PIN_CNF_DRIVE_Pos ) /*!< Bit mask of DRIVE field. */
#define GPIO_PIN_CNF_DRIVE_S0S1          ( 0UL )                             /*!< Standard '0', standard '1' */
#define GPIO_PIN_CNF_DRIVE_H0S1          ( 1UL )                             /*!< High drive '0', standard '1' */
#define GPIO_PIN_CNF_DRIVE_S0H1          ( 2UL )                             /*!< Standard '0', high drive '1' */
#define GPIO_PIN_CNF_DRIVE_H0H1          ( 3UL )                             /*!< High drive '0', high 'drive '1'' */
#define GPIO_PIN_CNF_DRIVE_D0S1          ( 4UL )                             /*!< Disconnect '0' standard '1' (normally used for wired-or connections) */
#define GPIO_PIN_CNF_DRIVE_D0H1          ( 5UL )                             /*!< Disconnect '0', high drive '1' (normally used for wired-or connections) */
#define GPIO_PIN_CNF_DRIVE_S0D1          ( 6UL )                             /*!< Standard '0'. disconnect '1' (normally used for wired-and connections) */
#define GPIO_PIN_CNF_DRIVE_H0D1          ( 7UL )                             /*!< High drive '0', disconnect '1' (normally used for wired-and connections) */

/* Bits 3..2 : Pull configuration */
#define GPIO_PIN_CNF_PULL_Pos            ( 2UL )                            /*!< Position of PULL field. */
#define GPIO_PIN_CNF_PULL_Msk            ( 0x3UL << GPIO_PIN_CNF_PULL_Pos ) /*!< Bit mask of PULL field. */
#define GPIO_PIN_CNF_PULL_Disabled       ( 0UL )                            /*!< No pull */
#define GPIO_PIN_CNF_PULL_Pulldown       ( 1UL )                            /*!< Pull down on pin */
#define GPIO_PIN_CNF_PULL_Pullup         ( 3UL )                            /*!< Pull up on pin */

/* Bit 1 : Connect or disconnect input buffer */
#define GPIO_PIN_CNF_INPUT_Pos           ( 1UL )                             /*!< Position of INPUT field. */
#define GPIO_PIN_CNF_INPUT_Msk           ( 0x1UL << GPIO_PIN_CNF_INPUT_Pos ) /*!< Bit mask of INPUT field. */
#define GPIO_PIN_CNF_INPUT_Connect       ( 0UL )                             /*!< Connect input buffer */
#define GPIO_PIN_CNF_INPUT_Disconnect    ( 1UL )                             /*!< Disconnect input buffer */

/* Bit 0 : Pin direction. Same physical register as DIR register */
#define GPIO_PIN_CNF_DIR_Pos             ( 0UL )                           /*!< Position of DIR field. */
#define GPIO_PIN_CNF_DIR_Msk             ( 0x1UL << GPIO_PIN_CNF_DIR_Pos ) /*!< Bit mask of DIR field. */
#define GPIO_PIN_CNF_DIR_Input           ( 0UL )                           /*!< Configure pin as an input pin */
#define GPIO_PIN_CNF_DIR_Output          ( 1UL )                           /*!< Configure pin as an output pin */


/* Peripheral: POWER */
/* Description: Power control */

/* Register: POWER_TASKS_CONSTLAT */
/* Description: Enable Constant Latency mode */

/* Bit 0 : Enable Constant Latency mode */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos        ( 0UL )                                              /*!< Position of TASKS_CONSTLAT field. */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Msk        ( 0x1UL << POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos ) /*!< Bit mask of TASKS_CONSTLAT field. */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger    ( 1UL )                                              /*!< Trigger task */

/* Register: POWER_TASKS_LOWPWR */
/* Description: Enable Low-power mode (variable latency) */

/* Bit 0 : Enable Low-power mode (variable latency) */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos        ( 0UL )                                          /*!< Position of TASKS_LOWPWR field. */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Msk        ( 0x1UL << POWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos ) /*!< Bit mask of TASKS_LOWPWR field. */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: POWER_EVENTS_POFWARN */
/* Description: Power failure warning */

/* Bit 0 : Power failure warning */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Pos             ( 0UL )                                              /*!< Position of EVENTS_POFWARN field. */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Msk             ( 0x1UL << POWER_EVENTS_POFWARN_EVENTS_POFWARN_Pos ) /*!< Bit mask of EVENTS_POFWARN field. */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: POWER_EVENTS_SLEEPENTER */
/* Description: CPU entered WFI/WFE sleep */

/* Bit 0 : CPU entered WFI/WFE sleep */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Pos             ( 0UL )                                                    /*!< Position of EVENTS_SLEEPENTER field. */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Msk             ( 0x1UL << POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Pos ) /*!< Bit mask of EVENTS_SLEEPENTER field. */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_NotGenerated    ( 0UL )                                                    /*!< Event not generated */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Generated       ( 1UL )                                                    /*!< Event generated */

