FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: POWER_EVENTS_SLEEPEXIT */
/* Description: CPU exited WFI/WFE sleep */

/* Bit 0 : CPU exited WFI/WFE sleep */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos             ( 0UL )                                                  /*!< Position of EVENTS_SLEEPEXIT field. */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Msk             ( 0x1UL << POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos ) /*!< Bit mask of EVENTS_SLEEPEXIT field. */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: POWER_INTENSET */
/* Description: Enable interrupt */

/* Bit 6 : Write '1' to enable interrupt for event SLEEPEXIT */
#define POWER_INTENSET_SLEEPEXIT_Pos          ( 6UL )                                   /*!< Position of SLEEPEXIT field. */
#define POWER_INTENSET_SLEEPEXIT_Msk          ( 0x1UL << POWER_INTENSET_SLEEPEXIT_Pos ) /*!< Bit mask of SLEEPEXIT field. */
#define POWER_INTENSET_SLEEPEXIT_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define POWER_INTENSET_SLEEPEXIT_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define POWER_INTENSET_SLEEPEXIT_Set          ( 1UL )                                   /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event SLEEPENTER */
#define POWER_INTENSET_SLEEPENTER_Pos         ( 5UL )                                    /*!< Position of SLEEPENTER field. */
#define POWER_INTENSET_SLEEPENTER_Msk         ( 0x1UL << POWER_INTENSET_SLEEPENTER_Pos ) /*!< Bit mask of SLEEPENTER field. */
#define POWER_INTENSET_SLEEPENTER_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define POWER_INTENSET_SLEEPENTER_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define POWER_INTENSET_SLEEPENTER_Set         ( 1UL )                                    /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event POFWARN */
#define POWER_INTENSET_POFWARN_Pos            ( 2UL )                                 /*!< Position of POFWARN field. */
#define POWER_INTENSET_POFWARN_Msk            ( 0x1UL << POWER_INTENSET_POFWARN_Pos ) /*!< Bit mask of POFWARN field. */
#define POWER_INTENSET_POFWARN_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define POWER_INTENSET_POFWARN_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define POWER_INTENSET_POFWARN_Set            ( 1UL )                                 /*!< Enable */

/* Register: POWER_INTENCLR */
/* Description: Disable interrupt */

/* Bit 6 : Write '1' to disable interrupt for event SLEEPEXIT */
#define POWER_INTENCLR_SLEEPEXIT_Pos          ( 6UL )                                   /*!< Position of SLEEPEXIT field. */
#define POWER_INTENCLR_SLEEPEXIT_Msk          ( 0x1UL << POWER_INTENCLR_SLEEPEXIT_Pos ) /*!< Bit mask of SLEEPEXIT field. */
#define POWER_INTENCLR_SLEEPEXIT_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define POWER_INTENCLR_SLEEPEXIT_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define POWER_INTENCLR_SLEEPEXIT_Clear        ( 1UL )                                   /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event SLEEPENTER */
#define POWER_INTENCLR_SLEEPENTER_Pos         ( 5UL )                                    /*!< Position of SLEEPENTER field. */
#define POWER_INTENCLR_SLEEPENTER_Msk         ( 0x1UL << POWER_INTENCLR_SLEEPENTER_Pos ) /*!< Bit mask of SLEEPENTER field. */
#define POWER_INTENCLR_SLEEPENTER_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define POWER_INTENCLR_SLEEPENTER_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define POWER_INTENCLR_SLEEPENTER_Clear       ( 1UL )                                    /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event POFWARN */
#define POWER_INTENCLR_POFWARN_Pos            ( 2UL )                                 /*!< Position of POFWARN field. */
#define POWER_INTENCLR_POFWARN_Msk            ( 0x1UL << POWER_INTENCLR_POFWARN_Pos ) /*!< Bit mask of POFWARN field. */
#define POWER_INTENCLR_POFWARN_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define POWER_INTENCLR_POFWARN_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define POWER_INTENCLR_POFWARN_Clear          ( 1UL )                                 /*!< Disable */

/* Register: POWER_RESETREAS */
/* Description: Reset reason */

/* Bit 18 : Reset due to wake up from System OFF mode when wakeup is triggered from entering into debug interface mode */
#define POWER_RESETREAS_DIF_Pos                 ( 18UL )                             /*!< Position of DIF field. */
#define POWER_RESETREAS_DIF_Msk                 ( 0x1UL << POWER_RESETREAS_DIF_Pos ) /*!< Bit mask of DIF field. */
#define POWER_RESETREAS_DIF_NotDetected         ( 0UL )                              /*!< Not detected */
#define POWER_RESETREAS_DIF_Detected            ( 1UL )                              /*!< Detected */

/* Bit 16 : Reset due to wake up from System OFF mode when wakeup is triggered from DETECT signal from GPIO */
#define POWER_RESETREAS_OFF_Pos                 ( 16UL )                             /*!< Position of OFF field. */
#define POWER_RESETREAS_OFF_Msk                 ( 0x1UL << POWER_RESETREAS_OFF_Pos ) /*!< Bit mask of OFF field. */
#define POWER_RESETREAS_OFF_NotDetected         ( 0UL )                              /*!< Not detected */
#define POWER_RESETREAS_OFF_Detected            ( 1UL )                              /*!< Detected */

/* Bit 3 : Reset from CPU lock-up detected */
#define POWER_RESETREAS_LOCKUP_Pos              ( 3UL )                                 /*!< Position of LOCKUP field. */
#define POWER_RESETREAS_LOCKUP_Msk              ( 0x1UL << POWER_RESETREAS_LOCKUP_Pos ) /*!< Bit mask of LOCKUP field. */
#define POWER_RESETREAS_LOCKUP_NotDetected      ( 0UL )                                 /*!< Not detected */
#define POWER_RESETREAS_LOCKUP_Detected         ( 1UL )                                 /*!< Detected */

/* Bit 2 : Reset from soft reset detected */
#define POWER_RESETREAS_SREQ_Pos                ( 2UL )                               /*!< Position of SREQ field. */
#define POWER_RESETREAS_SREQ_Msk                ( 0x1UL << POWER_RESETREAS_SREQ_Pos ) /*!< Bit mask of SREQ field. */
#define POWER_RESETREAS_SREQ_NotDetected        ( 0UL )                               /*!< Not detected */
#define POWER_RESETREAS_SREQ_Detected           ( 1UL )                               /*!< Detected */

/* Bit 1 : Reset from watchdog detected */
#define POWER_RESETREAS_DOG_Pos                 ( 1UL )                              /*!< Position of DOG field. */
#define POWER_RESETREAS_DOG_Msk                 ( 0x1UL << POWER_RESETREAS_DOG_Pos ) /*!< Bit mask of DOG field. */
#define POWER_RESETREAS_DOG_NotDetected         ( 0UL )                              /*!< Not detected */
#define POWER_RESETREAS_DOG_Detected            ( 1UL )                              /*!< Detected */

/* Bit 0 : Reset from pin-reset detected */
#define POWER_RESETREAS_RESETPIN_Pos            ( 0UL )                                   /*!< Position of RESETPIN field. */
#define POWER_RESETREAS_RESETPIN_Msk            ( 0x1UL << POWER_RESETREAS_RESETPIN_Pos ) /*!< Bit mask of RESETPIN field. */
#define POWER_RESETREAS_RESETPIN_NotDetected    ( 0UL )                                   /*!< Not detected */
#define POWER_RESETREAS_RESETPIN_Detected       ( 1UL )                                   /*!< Detected */

/* Register: POWER_SYSTEMOFF */
/* Description: System OFF register */

/* Bit 0 : Enable System OFF mode */
#define POWER_SYSTEMOFF_SYSTEMOFF_Pos      ( 0UL )                                    /*!< Position of SYSTEMOFF field. */
#define POWER_SYSTEMOFF_SYSTEMOFF_Msk      ( 0x1UL << POWER_SYSTEMOFF_SYSTEMOFF_Pos ) /*!< Bit mask of SYSTEMOFF field. */
#define POWER_SYSTEMOFF_SYSTEMOFF_Enter    ( 1UL )                                    /*!< Enable System OFF mode */

/* Register: POWER_POFCON */
/* Description: Power failure comparator configuration */

/* Bits 4..1 : Power failure comparator threshold setting */
#define POWER_POFCON_THRESHOLD_Pos    ( 1UL )                                 /*!< Position of THRESHOLD field. */
#define POWER_POFCON_THRESHOLD_Msk    ( 0xFUL << POWER_POFCON_THRESHOLD_Pos ) /*!< Bit mask of THRESHOLD field. */
#define POWER_POFCON_THRESHOLD_V17    ( 4UL )                                 /*!< Set threshold to 1.7 V */
#define POWER_POFCON_THRESHOLD_V18    ( 5UL )                                 /*!< Set threshold to 1.8 V */
#define POWER_POFCON_THRESHOLD_V19    ( 6UL )                                 /*!< Set threshold to 1.9 V */
#define POWER_POFCON_THRESHOLD_V20    ( 7UL )                                 /*!< Set threshold to 2.0 V */
#define POWER_POFCON_THRESHOLD_V21    ( 8UL )                                 /*!< Set threshold to 2.1 V */
#define POWER_POFCON_THRESHOLD_V22    ( 9UL )                                 /*!< Set threshold to 2.2 V */
#define POWER_POFCON_THRESHOLD_V23    ( 10UL )                                /*!< Set threshold to 2.3 V */
#define POWER_POFCON_THRESHOLD_V24    ( 11UL )                                /*!< Set threshold to 2.4 V */
#define POWER_POFCON_THRESHOLD_V25    ( 12UL )                                /*!< Set threshold to 2.5 V */
#define POWER_POFCON_THRESHOLD_V26    ( 13UL )                                /*!< Set threshold to 2.6 V */
#define POWER_POFCON_THRESHOLD_V27    ( 14UL )                                /*!< Set threshold to 2.7 V */
#define POWER_POFCON_THRESHOLD_V28    ( 15UL )                                /*!< Set threshold to 2.8 V */

/* Bit 0 : Enable or disable power failure comparator */
#define POWER_POFCON_POF_Pos          ( 0UL )                           /*!< Position of POF field. */
#define POWER_POFCON_POF_Msk          ( 0x1UL << POWER_POFCON_POF_Pos ) /*!< Bit mask of POF field. */
#define POWER_POFCON_POF_Disabled     ( 0UL )                           /*!< Disable */
#define POWER_POFCON_POF_Enabled      ( 1UL )                           /*!< Enable */

