FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: POWER_GPREGRET */
/* Description: General purpose retention register */

/* Bits 7..0 : General purpose retention register */
#define POWER_GPREGRET_GPREGRET_Pos    ( 0UL )                                   /*!< Position of GPREGRET field. */
#define POWER_GPREGRET_GPREGRET_Msk    ( 0xFFUL << POWER_GPREGRET_GPREGRET_Pos ) /*!< Bit mask of GPREGRET field. */

/* Register: POWER_GPREGRET2 */
/* Description: General purpose retention register */

/* Bits 7..0 : General purpose retention register */
#define POWER_GPREGRET2_GPREGRET_Pos    ( 0UL )                                    /*!< Position of GPREGRET field. */
#define POWER_GPREGRET2_GPREGRET_Msk    ( 0xFFUL << POWER_GPREGRET2_GPREGRET_Pos ) /*!< Bit mask of GPREGRET field. */

/* Register: POWER_DCDCEN */
/* Description: DC/DC enable register */

/* Bit 0 : Enable or disable DC/DC converter */
#define POWER_DCDCEN_DCDCEN_Pos         ( 0UL )                              /*!< Position of DCDCEN field. */
#define POWER_DCDCEN_DCDCEN_Msk         ( 0x1UL << POWER_DCDCEN_DCDCEN_Pos ) /*!< Bit mask of DCDCEN field. */
#define POWER_DCDCEN_DCDCEN_Disabled    ( 0UL )                              /*!< Disable */
#define POWER_DCDCEN_DCDCEN_Enabled     ( 1UL )                              /*!< Enable */

/* Register: POWER_RAM_POWER */
/* Description: Description cluster: RAMn power control register. The RAM size will vary depending on product variant, and the RAMn register will only be present if the corresponding RAM AHB slave is present on the device. */

/* Bit 17 : Keep retention on RAM section S1 when RAM section is in OFF */
#define POWER_RAM_POWER_S1RETENTION_Pos    ( 17UL )                                     /*!< Position of S1RETENTION field. */
#define POWER_RAM_POWER_S1RETENTION_Msk    ( 0x1UL << POWER_RAM_POWER_S1RETENTION_Pos ) /*!< Bit mask of S1RETENTION field. */
#define POWER_RAM_POWER_S1RETENTION_Off    ( 0UL )                                      /*!< Off */
#define POWER_RAM_POWER_S1RETENTION_On     ( 1UL )                                      /*!< On */

/* Bit 16 : Keep retention on RAM section S0 when RAM section is in OFF */
#define POWER_RAM_POWER_S0RETENTION_Pos    ( 16UL )                                     /*!< Position of S0RETENTION field. */
#define POWER_RAM_POWER_S0RETENTION_Msk    ( 0x1UL << POWER_RAM_POWER_S0RETENTION_Pos ) /*!< Bit mask of S0RETENTION field. */
#define POWER_RAM_POWER_S0RETENTION_Off    ( 0UL )                                      /*!< Off */
#define POWER_RAM_POWER_S0RETENTION_On     ( 1UL )                                      /*!< On */

/* Bit 1 : Keep RAM section S1 ON or OFF in System ON mode. */
#define POWER_RAM_POWER_S1POWER_Pos        ( 1UL )                                  /*!< Position of S1POWER field. */
#define POWER_RAM_POWER_S1POWER_Msk        ( 0x1UL << POWER_RAM_POWER_S1POWER_Pos ) /*!< Bit mask of S1POWER field. */
#define POWER_RAM_POWER_S1POWER_Off        ( 0UL )                                  /*!< Off */
#define POWER_RAM_POWER_S1POWER_On         ( 1UL )                                  /*!< On */

/* Bit 0 : Keep RAM section S0 ON or OFF in System ON mode. */
#define POWER_RAM_POWER_S0POWER_Pos        ( 0UL )                                  /*!< Position of S0POWER field. */
#define POWER_RAM_POWER_S0POWER_Msk        ( 0x1UL << POWER_RAM_POWER_S0POWER_Pos ) /*!< Bit mask of S0POWER field. */
#define POWER_RAM_POWER_S0POWER_Off        ( 0UL )                                  /*!< Off */
#define POWER_RAM_POWER_S0POWER_On         ( 1UL )                                  /*!< On */

/* Register: POWER_RAM_POWERSET */
/* Description: Description cluster: RAMn power control set register */

/* Bit 17 : Keep retention on RAM section S1 when RAM section is switched off */
#define POWER_RAM_POWERSET_S1RETENTION_Pos    ( 17UL )                                        /*!< Position of S1RETENTION field. */
#define POWER_RAM_POWERSET_S1RETENTION_Msk    ( 0x1UL << POWER_RAM_POWERSET_S1RETENTION_Pos ) /*!< Bit mask of S1RETENTION field. */
#define POWER_RAM_POWERSET_S1RETENTION_On     ( 1UL )                                         /*!< On */

/* Bit 16 : Keep retention on RAM section S0 when RAM section is switched off */
#define POWER_RAM_POWERSET_S0RETENTION_Pos    ( 16UL )                                        /*!< Position of S0RETENTION field. */
#define POWER_RAM_POWERSET_S0RETENTION_Msk    ( 0x1UL << POWER_RAM_POWERSET_S0RETENTION_Pos ) /*!< Bit mask of S0RETENTION field. */
#define POWER_RAM_POWERSET_S0RETENTION_On     ( 1UL )                                         /*!< On */

/* Bit 1 : Keep RAM section S1 of RAMn on or off in System ON mode */
#define POWER_RAM_POWERSET_S1POWER_Pos        ( 1UL )                                     /*!< Position of S1POWER field. */
#define POWER_RAM_POWERSET_S1POWER_Msk        ( 0x1UL << POWER_RAM_POWERSET_S1POWER_Pos ) /*!< Bit mask of S1POWER field. */
#define POWER_RAM_POWERSET_S1POWER_On         ( 1UL )                                     /*!< On */

/* Bit 0 : Keep RAM section S0 of RAMn on or off in System ON mode */
#define POWER_RAM_POWERSET_S0POWER_Pos        ( 0UL )                                     /*!< Position of S0POWER field. */
#define POWER_RAM_POWERSET_S0POWER_Msk        ( 0x1UL << POWER_RAM_POWERSET_S0POWER_Pos ) /*!< Bit mask of S0POWER field. */
#define POWER_RAM_POWERSET_S0POWER_On         ( 1UL )                                     /*!< On */

/* Register: POWER_RAM_POWERCLR */
/* Description: Description cluster: RAMn power control clear register */

/* Bit 17 : Keep retention on RAM section S1 when RAM section is switched off */
#define POWER_RAM_POWERCLR_S1RETENTION_Pos    ( 17UL )                                        /*!< Position of S1RETENTION field. */
#define POWER_RAM_POWERCLR_S1RETENTION_Msk    ( 0x1UL << POWER_RAM_POWERCLR_S1RETENTION_Pos ) /*!< Bit mask of S1RETENTION field. */
#define POWER_RAM_POWERCLR_S1RETENTION_Off    ( 1UL )                                         /*!< Off */

/* Bit 16 : Keep retention on RAM section S0 when RAM section is switched off */
#define POWER_RAM_POWERCLR_S0RETENTION_Pos    ( 16UL )                                        /*!< Position of S0RETENTION field. */
#define POWER_RAM_POWERCLR_S0RETENTION_Msk    ( 0x1UL << POWER_RAM_POWERCLR_S0RETENTION_Pos ) /*!< Bit mask of S0RETENTION field. */
#define POWER_RAM_POWERCLR_S0RETENTION_Off    ( 1UL )                                         /*!< Off */

