FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 26 : Channel 26 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH26_Pos         ( 26UL )                          /*!< Position of CH26 field. */
#define PPI_CHENSET_CH26_Msk         ( 0x1UL << PPI_CHENSET_CH26_Pos ) /*!< Bit mask of CH26 field. */
#define PPI_CHENSET_CH26_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENSET_CH26_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENSET_CH26_Set         ( 1UL )                           /*!< Write: Enable channel */

/* Bit 25 : Channel 25 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH25_Pos         ( 25UL )                          /*!< Position of CH25 field. */
#define PPI_CHENSET_CH25_Msk         ( 0x1UL << PPI_CHENSET_CH25_Pos ) /*!< Bit mask of CH25 field. */
#define PPI_CHENSET_CH25_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENSET_CH25_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENSET_CH25_Set         ( 1UL )                           /*!< Write: Enable channel */

/* Bit 24 : Channel 24 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH24_Pos         ( 24UL )                          /*!< Position of CH24 field. */
#define PPI_CHENSET_CH24_Msk         ( 0x1UL << PPI_CHENSET_CH24_Pos ) /*!< Bit mask of CH24 field. */
#define PPI_CHENSET_CH24_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENSET_CH24_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENSET_CH24_Set         ( 1UL )                           /*!< Write: Enable channel */

/* Bit 23 : Channel 23 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH23_Pos         ( 23UL )                          /*!< Position of CH23 field. */
#define PPI_CHENSET_CH23_Msk         ( 0x1UL << PPI_CHENSET_CH23_Pos ) /*!< Bit mask of CH23 field. */
#define PPI_CHENSET_CH23_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENSET_CH23_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENSET_CH23_Set         ( 1UL )                           /*!< Write: Enable channel */

/* Bit 22 : Channel 22 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH22_Pos         ( 22UL )                          /*!< Position of CH22 field. */
#define PPI_CHENSET_CH22_Msk         ( 0x1UL << PPI_CHENSET_CH22_Pos ) /*!< Bit mask of CH22 field. */
#define PPI_CHENSET_CH22_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENSET_CH22_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENSET_CH22_Set         ( 1UL )                           /*!< Write: Enable channel */

/* Bit 21 : Channel 21 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH21_Pos         ( 21UL )                          /*!< Position of CH21 field. */
#define PPI_CHENSET_CH21_Msk         ( 0x1UL << PPI_CHENSET_CH21_Pos ) /*!< Bit mask of CH21 field. */
#define PPI_CHENSET_CH21_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENSET_CH21_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENSET_CH21_Set         ( 1UL )                           /*!< Write: Enable channel */

/* Bit 20 : Channel 20 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH20_Pos         ( 20UL )                          /*!< Position of CH20 field. */
#define PPI_CHENSET_CH20_Msk         ( 0x1UL << PPI_CHENSET_CH20_Pos ) /*!< Bit mask of CH20 field. */
#define PPI_CHENSET_CH20_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENSET_CH20_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENSET_CH20_Set         ( 1UL )                           /*!< Write: Enable channel */

/* Bit 9 : Channel 9 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH9_Pos          ( 9UL )                          /*!< Position of CH9 field. */
#define PPI_CHENSET_CH9_Msk          ( 0x1UL << PPI_CHENSET_CH9_Pos ) /*!< Bit mask of CH9 field. */
#define PPI_CHENSET_CH9_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENSET_CH9_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENSET_CH9_Set          ( 1UL )                          /*!< Write: Enable channel */

/* Bit 8 : Channel 8 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH8_Pos          ( 8UL )                          /*!< Position of CH8 field. */
#define PPI_CHENSET_CH8_Msk          ( 0x1UL << PPI_CHENSET_CH8_Pos ) /*!< Bit mask of CH8 field. */
#define PPI_CHENSET_CH8_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENSET_CH8_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENSET_CH8_Set          ( 1UL )                          /*!< Write: Enable channel */

/* Bit 7 : Channel 7 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH7_Pos          ( 7UL )                          /*!< Position of CH7 field. */
#define PPI_CHENSET_CH7_Msk          ( 0x1UL << PPI_CHENSET_CH7_Pos ) /*!< Bit mask of CH7 field. */
#define PPI_CHENSET_CH7_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENSET_CH7_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENSET_CH7_Set          ( 1UL )                          /*!< Write: Enable channel */

/* Bit 6 : Channel 6 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH6_Pos          ( 6UL )                          /*!< Position of CH6 field. */
#define PPI_CHENSET_CH6_Msk          ( 0x1UL << PPI_CHENSET_CH6_Pos ) /*!< Bit mask of CH6 field. */
#define PPI_CHENSET_CH6_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENSET_CH6_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENSET_CH6_Set          ( 1UL )                          /*!< Write: Enable channel */

/* Bit 5 : Channel 5 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH5_Pos          ( 5UL )                          /*!< Position of CH5 field. */
#define PPI_CHENSET_CH5_Msk          ( 0x1UL << PPI_CHENSET_CH5_Pos ) /*!< Bit mask of CH5 field. */
#define PPI_CHENSET_CH5_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENSET_CH5_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENSET_CH5_Set          ( 1UL )                          /*!< Write: Enable channel */

