FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 4 : Channel 4 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH4_Pos          ( 4UL )                          /*!< Position of CH4 field. */
#define PPI_CHENSET_CH4_Msk          ( 0x1UL << PPI_CHENSET_CH4_Pos ) /*!< Bit mask of CH4 field. */
#define PPI_CHENSET_CH4_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENSET_CH4_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENSET_CH4_Set          ( 1UL )                          /*!< Write: Enable channel */

/* Bit 3 : Channel 3 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH3_Pos          ( 3UL )                          /*!< Position of CH3 field. */
#define PPI_CHENSET_CH3_Msk          ( 0x1UL << PPI_CHENSET_CH3_Pos ) /*!< Bit mask of CH3 field. */
#define PPI_CHENSET_CH3_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENSET_CH3_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENSET_CH3_Set          ( 1UL )                          /*!< Write: Enable channel */

/* Bit 2 : Channel 2 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH2_Pos          ( 2UL )                          /*!< Position of CH2 field. */
#define PPI_CHENSET_CH2_Msk          ( 0x1UL << PPI_CHENSET_CH2_Pos ) /*!< Bit mask of CH2 field. */
#define PPI_CHENSET_CH2_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENSET_CH2_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENSET_CH2_Set          ( 1UL )                          /*!< Write: Enable channel */

/* Bit 1 : Channel 1 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH1_Pos          ( 1UL )                          /*!< Position of CH1 field. */
#define PPI_CHENSET_CH1_Msk          ( 0x1UL << PPI_CHENSET_CH1_Pos ) /*!< Bit mask of CH1 field. */
#define PPI_CHENSET_CH1_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENSET_CH1_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENSET_CH1_Set          ( 1UL )                          /*!< Write: Enable channel */

/* Bit 0 : Channel 0 enable set register.  Writing '0' has no effect. */
#define PPI_CHENSET_CH0_Pos          ( 0UL )                          /*!< Position of CH0 field. */
#define PPI_CHENSET_CH0_Msk          ( 0x1UL << PPI_CHENSET_CH0_Pos ) /*!< Bit mask of CH0 field. */
#define PPI_CHENSET_CH0_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENSET_CH0_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENSET_CH0_Set          ( 1UL )                          /*!< Write: Enable channel */

/* Register: PPI_CHENCLR */
/* Description: Channel enable clear register */

/* Bit 31 : Channel 31 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH31_Pos         ( 31UL )                          /*!< Position of CH31 field. */
#define PPI_CHENCLR_CH31_Msk         ( 0x1UL << PPI_CHENCLR_CH31_Pos ) /*!< Bit mask of CH31 field. */
#define PPI_CHENCLR_CH31_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH31_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH31_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 30 : Channel 30 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH30_Pos         ( 30UL )                          /*!< Position of CH30 field. */
#define PPI_CHENCLR_CH30_Msk         ( 0x1UL << PPI_CHENCLR_CH30_Pos ) /*!< Bit mask of CH30 field. */
#define PPI_CHENCLR_CH30_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH30_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH30_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 29 : Channel 29 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH29_Pos         ( 29UL )                          /*!< Position of CH29 field. */
#define PPI_CHENCLR_CH29_Msk         ( 0x1UL << PPI_CHENCLR_CH29_Pos ) /*!< Bit mask of CH29 field. */
#define PPI_CHENCLR_CH29_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH29_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH29_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 28 : Channel 28 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH28_Pos         ( 28UL )                          /*!< Position of CH28 field. */
#define PPI_CHENCLR_CH28_Msk         ( 0x1UL << PPI_CHENCLR_CH28_Pos ) /*!< Bit mask of CH28 field. */
#define PPI_CHENCLR_CH28_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH28_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH28_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 27 : Channel 27 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH27_Pos         ( 27UL )                          /*!< Position of CH27 field. */
#define PPI_CHENCLR_CH27_Msk         ( 0x1UL << PPI_CHENCLR_CH27_Pos ) /*!< Bit mask of CH27 field. */
#define PPI_CHENCLR_CH27_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH27_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH27_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 26 : Channel 26 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH26_Pos         ( 26UL )                          /*!< Position of CH26 field. */
#define PPI_CHENCLR_CH26_Msk         ( 0x1UL << PPI_CHENCLR_CH26_Pos ) /*!< Bit mask of CH26 field. */
#define PPI_CHENCLR_CH26_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH26_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH26_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 25 : Channel 25 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH25_Pos         ( 25UL )                          /*!< Position of CH25 field. */
#define PPI_CHENCLR_CH25_Msk         ( 0x1UL << PPI_CHENCLR_CH25_Pos ) /*!< Bit mask of CH25 field. */
#define PPI_CHENCLR_CH25_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH25_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH25_Clear       ( 1UL )                           /*!< Write: disable channel */

