FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 24 : Channel 24 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH24_Pos         ( 24UL )                          /*!< Position of CH24 field. */
#define PPI_CHENCLR_CH24_Msk         ( 0x1UL << PPI_CHENCLR_CH24_Pos ) /*!< Bit mask of CH24 field. */
#define PPI_CHENCLR_CH24_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH24_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH24_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 23 : Channel 23 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH23_Pos         ( 23UL )                          /*!< Position of CH23 field. */
#define PPI_CHENCLR_CH23_Msk         ( 0x1UL << PPI_CHENCLR_CH23_Pos ) /*!< Bit mask of CH23 field. */
#define PPI_CHENCLR_CH23_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH23_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH23_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 22 : Channel 22 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH22_Pos         ( 22UL )                          /*!< Position of CH22 field. */
#define PPI_CHENCLR_CH22_Msk         ( 0x1UL << PPI_CHENCLR_CH22_Pos ) /*!< Bit mask of CH22 field. */
#define PPI_CHENCLR_CH22_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH22_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH22_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 21 : Channel 21 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH21_Pos         ( 21UL )                          /*!< Position of CH21 field. */
#define PPI_CHENCLR_CH21_Msk         ( 0x1UL << PPI_CHENCLR_CH21_Pos ) /*!< Bit mask of CH21 field. */
#define PPI_CHENCLR_CH21_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH21_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH21_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 20 : Channel 20 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH20_Pos         ( 20UL )                          /*!< Position of CH20 field. */
#define PPI_CHENCLR_CH20_Msk         ( 0x1UL << PPI_CHENCLR_CH20_Pos ) /*!< Bit mask of CH20 field. */
#define PPI_CHENCLR_CH20_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH20_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH20_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 9 : Channel 9 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH9_Pos          ( 9UL )                          /*!< Position of CH9 field. */
#define PPI_CHENCLR_CH9_Msk          ( 0x1UL << PPI_CHENCLR_CH9_Pos ) /*!< Bit mask of CH9 field. */
#define PPI_CHENCLR_CH9_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH9_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH9_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 8 : Channel 8 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH8_Pos          ( 8UL )                          /*!< Position of CH8 field. */
#define PPI_CHENCLR_CH8_Msk          ( 0x1UL << PPI_CHENCLR_CH8_Pos ) /*!< Bit mask of CH8 field. */
#define PPI_CHENCLR_CH8_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH8_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH8_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 7 : Channel 7 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH7_Pos          ( 7UL )                          /*!< Position of CH7 field. */
#define PPI_CHENCLR_CH7_Msk          ( 0x1UL << PPI_CHENCLR_CH7_Pos ) /*!< Bit mask of CH7 field. */
#define PPI_CHENCLR_CH7_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH7_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH7_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 6 : Channel 6 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH6_Pos          ( 6UL )                          /*!< Position of CH6 field. */
#define PPI_CHENCLR_CH6_Msk          ( 0x1UL << PPI_CHENCLR_CH6_Pos ) /*!< Bit mask of CH6 field. */
#define PPI_CHENCLR_CH6_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH6_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH6_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 5 : Channel 5 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH5_Pos          ( 5UL )                          /*!< Position of CH5 field. */
#define PPI_CHENCLR_CH5_Msk          ( 0x1UL << PPI_CHENCLR_CH5_Pos ) /*!< Bit mask of CH5 field. */
#define PPI_CHENCLR_CH5_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH5_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH5_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 4 : Channel 4 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH4_Pos          ( 4UL )                          /*!< Position of CH4 field. */
#define PPI_CHENCLR_CH4_Msk          ( 0x1UL << PPI_CHENCLR_CH4_Pos ) /*!< Bit mask of CH4 field. */
#define PPI_CHENCLR_CH4_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH4_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH4_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 3 : Channel 3 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH3_Pos          ( 3UL )                          /*!< Position of CH3 field. */
#define PPI_CHENCLR_CH3_Msk          ( 0x1UL << PPI_CHENCLR_CH3_Pos ) /*!< Bit mask of CH3 field. */
#define PPI_CHENCLR_CH3_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH3_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH3_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 2 : Channel 2 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH2_Pos          ( 2UL )                          /*!< Position of CH2 field. */
#define PPI_CHENCLR_CH2_Msk          ( 0x1UL << PPI_CHENCLR_CH2_Pos ) /*!< Bit mask of CH2 field. */
#define PPI_CHENCLR_CH2_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH2_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH2_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 1 : Channel 1 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH1_Pos          ( 1UL )                          /*!< Position of CH1 field. */
#define PPI_CHENCLR_CH1_Msk          ( 0x1UL << PPI_CHENCLR_CH1_Pos ) /*!< Bit mask of CH1 field. */
#define PPI_CHENCLR_CH1_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH1_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH1_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 0 : Channel 0 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH0_Pos          ( 0UL )                          /*!< Position of CH0 field. */
#define PPI_CHENCLR_CH0_Msk          ( 0x1UL << PPI_CHENCLR_CH0_Pos ) /*!< Bit mask of CH0 field. */
#define PPI_CHENCLR_CH0_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH0_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH0_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Register: PPI_CH_EEP */
/* Description: Description cluster: Channel n event endpoint */

