FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bits 31..0 : Pointer to event register. Accepts only addresses to registers from the Event group. */
#define PPI_CH_EEP_EEP_Pos    ( 0UL )                                /*!< Position of EEP field. */
#define PPI_CH_EEP_EEP_Msk    ( 0xFFFFFFFFUL << PPI_CH_EEP_EEP_Pos ) /*!< Bit mask of EEP field. */

/* Register: PPI_CH_TEP */
/* Description: Description cluster: Channel n task endpoint */

/* Bits 31..0 : Pointer to task register. Accepts only addresses to registers from the Task group. */
#define PPI_CH_TEP_TEP_Pos    ( 0UL )                                /*!< Position of TEP field. */
#define PPI_CH_TEP_TEP_Msk    ( 0xFFFFFFFFUL << PPI_CH_TEP_TEP_Pos ) /*!< Bit mask of TEP field. */

/* Register: PPI_CHG */
/* Description: Description collection: Channel group n */

/* Bit 31 : Include or exclude channel 31 */
#define PPI_CHG_CH31_Pos         ( 31UL )                      /*!< Position of CH31 field. */
#define PPI_CHG_CH31_Msk         ( 0x1UL << PPI_CHG_CH31_Pos ) /*!< Bit mask of CH31 field. */
#define PPI_CHG_CH31_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH31_Included    ( 1UL )                       /*!< Include */

/* Bit 30 : Include or exclude channel 30 */
#define PPI_CHG_CH30_Pos         ( 30UL )                      /*!< Position of CH30 field. */
#define PPI_CHG_CH30_Msk         ( 0x1UL << PPI_CHG_CH30_Pos ) /*!< Bit mask of CH30 field. */
#define PPI_CHG_CH30_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH30_Included    ( 1UL )                       /*!< Include */

/* Bit 29 : Include or exclude channel 29 */
#define PPI_CHG_CH29_Pos         ( 29UL )                      /*!< Position of CH29 field. */
#define PPI_CHG_CH29_Msk         ( 0x1UL << PPI_CHG_CH29_Pos ) /*!< Bit mask of CH29 field. */
#define PPI_CHG_CH29_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH29_Included    ( 1UL )                       /*!< Include */

/* Bit 28 : Include or exclude channel 28 */
#define PPI_CHG_CH28_Pos         ( 28UL )                      /*!< Position of CH28 field. */
#define PPI_CHG_CH28_Msk         ( 0x1UL << PPI_CHG_CH28_Pos ) /*!< Bit mask of CH28 field. */
#define PPI_CHG_CH28_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH28_Included    ( 1UL )                       /*!< Include */

/* Bit 27 : Include or exclude channel 27 */
#define PPI_CHG_CH27_Pos         ( 27UL )                      /*!< Position of CH27 field. */
#define PPI_CHG_CH27_Msk         ( 0x1UL << PPI_CHG_CH27_Pos ) /*!< Bit mask of CH27 field. */
#define PPI_CHG_CH27_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH27_Included    ( 1UL )                       /*!< Include */

/* Bit 26 : Include or exclude channel 26 */
#define PPI_CHG_CH26_Pos         ( 26UL )                      /*!< Position of CH26 field. */
#define PPI_CHG_CH26_Msk         ( 0x1UL << PPI_CHG_CH26_Pos ) /*!< Bit mask of CH26 field. */
#define PPI_CHG_CH26_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH26_Included    ( 1UL )                       /*!< Include */

/* Bit 25 : Include or exclude channel 25 */
#define PPI_CHG_CH25_Pos         ( 25UL )                      /*!< Position of CH25 field. */
#define PPI_CHG_CH25_Msk         ( 0x1UL << PPI_CHG_CH25_Pos ) /*!< Bit mask of CH25 field. */
#define PPI_CHG_CH25_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH25_Included    ( 1UL )                       /*!< Include */

/* Bit 24 : Include or exclude channel 24 */
#define PPI_CHG_CH24_Pos         ( 24UL )                      /*!< Position of CH24 field. */
#define PPI_CHG_CH24_Msk         ( 0x1UL << PPI_CHG_CH24_Pos ) /*!< Bit mask of CH24 field. */
#define PPI_CHG_CH24_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH24_Included    ( 1UL )                       /*!< Include */

/* Bit 23 : Include or exclude channel 23 */
#define PPI_CHG_CH23_Pos         ( 23UL )                      /*!< Position of CH23 field. */
#define PPI_CHG_CH23_Msk         ( 0x1UL << PPI_CHG_CH23_Pos ) /*!< Bit mask of CH23 field. */
#define PPI_CHG_CH23_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH23_Included    ( 1UL )                       /*!< Include */

/* Bit 22 : Include or exclude channel 22 */
#define PPI_CHG_CH22_Pos         ( 22UL )                      /*!< Position of CH22 field. */
#define PPI_CHG_CH22_Msk         ( 0x1UL << PPI_CHG_CH22_Pos ) /*!< Bit mask of CH22 field. */
#define PPI_CHG_CH22_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH22_Included    ( 1UL )                       /*!< Include */

/* Bit 21 : Include or exclude channel 21 */
#define PPI_CHG_CH21_Pos         ( 21UL )                      /*!< Position of CH21 field. */
#define PPI_CHG_CH21_Msk         ( 0x1UL << PPI_CHG_CH21_Pos ) /*!< Bit mask of CH21 field. */
#define PPI_CHG_CH21_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH21_Included    ( 1UL )                       /*!< Include */

/* Bit 20 : Include or exclude channel 20 */
#define PPI_CHG_CH20_Pos         ( 20UL )                      /*!< Position of CH20 field. */
#define PPI_CHG_CH20_Msk         ( 0x1UL << PPI_CHG_CH20_Pos ) /*!< Bit mask of CH20 field. */
#define PPI_CHG_CH20_Excluded    ( 0UL )                       /*!< Exclude */
#define PPI_CHG_CH20_Included    ( 1UL )                       /*!< Include */

/* Bit 9 : Include or exclude channel 9 */
#define PPI_CHG_CH9_Pos          ( 9UL )                      /*!< Position of CH9 field. */
#define PPI_CHG_CH9_Msk          ( 0x1UL << PPI_CHG_CH9_Pos ) /*!< Bit mask of CH9 field. */
#define PPI_CHG_CH9_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH9_Included     ( 1UL )                      /*!< Include */

/* Bit 8 : Include or exclude channel 8 */
#define PPI_CHG_CH8_Pos          ( 8UL )                      /*!< Position of CH8 field. */
#define PPI_CHG_CH8_Msk          ( 0x1UL << PPI_CHG_CH8_Pos ) /*!< Bit mask of CH8 field. */
#define PPI_CHG_CH8_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH8_Included     ( 1UL )                      /*!< Include */

