FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 2 : Shortcut between event REPORTRDY and task RDCLRACC */
#define QDEC_SHORTS_REPORTRDY_RDCLRACC_Pos           ( 2UL )                                         /*!< Position of REPORTRDY_RDCLRACC field. */
#define QDEC_SHORTS_REPORTRDY_RDCLRACC_Msk           ( 0x1UL << QDEC_SHORTS_REPORTRDY_RDCLRACC_Pos ) /*!< Bit mask of REPORTRDY_RDCLRACC field. */
#define QDEC_SHORTS_REPORTRDY_RDCLRACC_Disabled      ( 0UL )                                         /*!< Disable shortcut */
#define QDEC_SHORTS_REPORTRDY_RDCLRACC_Enabled       ( 1UL )                                         /*!< Enable shortcut */

/* Bit 1 : Shortcut between event SAMPLERDY and task STOP */
#define QDEC_SHORTS_SAMPLERDY_STOP_Pos               ( 1UL )                                     /*!< Position of SAMPLERDY_STOP field. */
#define QDEC_SHORTS_SAMPLERDY_STOP_Msk               ( 0x1UL << QDEC_SHORTS_SAMPLERDY_STOP_Pos ) /*!< Bit mask of SAMPLERDY_STOP field. */
#define QDEC_SHORTS_SAMPLERDY_STOP_Disabled          ( 0UL )                                     /*!< Disable shortcut */
#define QDEC_SHORTS_SAMPLERDY_STOP_Enabled           ( 1UL )                                     /*!< Enable shortcut */

/* Bit 0 : Shortcut between event REPORTRDY and task READCLRACC */
#define QDEC_SHORTS_REPORTRDY_READCLRACC_Pos         ( 0UL )                                           /*!< Position of REPORTRDY_READCLRACC field. */
#define QDEC_SHORTS_REPORTRDY_READCLRACC_Msk         ( 0x1UL << QDEC_SHORTS_REPORTRDY_READCLRACC_Pos ) /*!< Bit mask of REPORTRDY_READCLRACC field. */
#define QDEC_SHORTS_REPORTRDY_READCLRACC_Disabled    ( 0UL )                                           /*!< Disable shortcut */
#define QDEC_SHORTS_REPORTRDY_READCLRACC_Enabled     ( 1UL )                                           /*!< Enable shortcut */

/* Register: QDEC_INTENSET */
/* Description: Enable interrupt */

/* Bit 4 : Write '1' to enable interrupt for event STOPPED */
#define QDEC_INTENSET_STOPPED_Pos           ( 4UL )                                /*!< Position of STOPPED field. */
#define QDEC_INTENSET_STOPPED_Msk           ( 0x1UL << QDEC_INTENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define QDEC_INTENSET_STOPPED_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define QDEC_INTENSET_STOPPED_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define QDEC_INTENSET_STOPPED_Set           ( 1UL )                                /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event DBLRDY */
#define QDEC_INTENSET_DBLRDY_Pos            ( 3UL )                               /*!< Position of DBLRDY field. */
#define QDEC_INTENSET_DBLRDY_Msk            ( 0x1UL << QDEC_INTENSET_DBLRDY_Pos ) /*!< Bit mask of DBLRDY field. */
#define QDEC_INTENSET_DBLRDY_Disabled       ( 0UL )                               /*!< Read: Disabled */
#define QDEC_INTENSET_DBLRDY_Enabled        ( 1UL )                               /*!< Read: Enabled */
#define QDEC_INTENSET_DBLRDY_Set            ( 1UL )                               /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event ACCOF */
#define QDEC_INTENSET_ACCOF_Pos             ( 2UL )                              /*!< Position of ACCOF field. */
#define QDEC_INTENSET_ACCOF_Msk             ( 0x1UL << QDEC_INTENSET_ACCOF_Pos ) /*!< Bit mask of ACCOF field. */
#define QDEC_INTENSET_ACCOF_Disabled        ( 0UL )                              /*!< Read: Disabled */
#define QDEC_INTENSET_ACCOF_Enabled         ( 1UL )                              /*!< Read: Enabled */
#define QDEC_INTENSET_ACCOF_Set             ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event REPORTRDY */
#define QDEC_INTENSET_REPORTRDY_Pos         ( 1UL )                                  /*!< Position of REPORTRDY field. */
#define QDEC_INTENSET_REPORTRDY_Msk         ( 0x1UL << QDEC_INTENSET_REPORTRDY_Pos ) /*!< Bit mask of REPORTRDY field. */
#define QDEC_INTENSET_REPORTRDY_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define QDEC_INTENSET_REPORTRDY_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define QDEC_INTENSET_REPORTRDY_Set         ( 1UL )                                  /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event SAMPLERDY */
#define QDEC_INTENSET_SAMPLERDY_Pos         ( 0UL )                                  /*!< Position of SAMPLERDY field. */
#define QDEC_INTENSET_SAMPLERDY_Msk         ( 0x1UL << QDEC_INTENSET_SAMPLERDY_Pos ) /*!< Bit mask of SAMPLERDY field. */
#define QDEC_INTENSET_SAMPLERDY_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define QDEC_INTENSET_SAMPLERDY_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define QDEC_INTENSET_SAMPLERDY_Set         ( 1UL )                                  /*!< Enable */

/* Register: QDEC_INTENCLR */
/* Description: Disable interrupt */

/* Bit 4 : Write '1' to disable interrupt for event STOPPED */
#define QDEC_INTENCLR_STOPPED_Pos           ( 4UL )                                /*!< Position of STOPPED field. */
#define QDEC_INTENCLR_STOPPED_Msk           ( 0x1UL << QDEC_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define QDEC_INTENCLR_STOPPED_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define QDEC_INTENCLR_STOPPED_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define QDEC_INTENCLR_STOPPED_Clear         ( 1UL )                                /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event DBLRDY */
#define QDEC_INTENCLR_DBLRDY_Pos            ( 3UL )                               /*!< Position of DBLRDY field. */
#define QDEC_INTENCLR_DBLRDY_Msk            ( 0x1UL << QDEC_INTENCLR_DBLRDY_Pos ) /*!< Bit mask of DBLRDY field. */
#define QDEC_INTENCLR_DBLRDY_Disabled       ( 0UL )                               /*!< Read: Disabled */
#define QDEC_INTENCLR_DBLRDY_Enabled        ( 1UL )                               /*!< Read: Enabled */
#define QDEC_INTENCLR_DBLRDY_Clear          ( 1UL )                               /*!< Disable */

