FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 0 : Generated when last bit is sent on air, or received from air */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Pos             ( 0UL )                                            /*!< Position of EVENTS_PHYEND field. */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Msk             ( 0x1UL << RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Pos ) /*!< Bit mask of EVENTS_PHYEND field. */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: RADIO_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 21 : Shortcut between event PHYEND and task START */
#define RADIO_SHORTS_PHYEND_START_Pos              ( 21UL )                                   /*!< Position of PHYEND_START field. */
#define RADIO_SHORTS_PHYEND_START_Msk              ( 0x1UL << RADIO_SHORTS_PHYEND_START_Pos ) /*!< Bit mask of PHYEND_START field. */
#define RADIO_SHORTS_PHYEND_START_Disabled         ( 0UL )                                    /*!< Disable shortcut */
#define RADIO_SHORTS_PHYEND_START_Enabled          ( 1UL )                                    /*!< Enable shortcut */

/* Bit 20 : Shortcut between event PHYEND and task DISABLE */
#define RADIO_SHORTS_PHYEND_DISABLE_Pos            ( 20UL )                                     /*!< Position of PHYEND_DISABLE field. */
#define RADIO_SHORTS_PHYEND_DISABLE_Msk            ( 0x1UL << RADIO_SHORTS_PHYEND_DISABLE_Pos ) /*!< Bit mask of PHYEND_DISABLE field. */
#define RADIO_SHORTS_PHYEND_DISABLE_Disabled       ( 0UL )                                      /*!< Disable shortcut */
#define RADIO_SHORTS_PHYEND_DISABLE_Enabled        ( 1UL )                                      /*!< Enable shortcut */

/* Bit 19 : Shortcut between event RXREADY and task START */
#define RADIO_SHORTS_RXREADY_START_Pos             ( 19UL )                                    /*!< Position of RXREADY_START field. */
#define RADIO_SHORTS_RXREADY_START_Msk             ( 0x1UL << RADIO_SHORTS_RXREADY_START_Pos ) /*!< Bit mask of RXREADY_START field. */
#define RADIO_SHORTS_RXREADY_START_Disabled        ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_RXREADY_START_Enabled         ( 1UL )                                     /*!< Enable shortcut */

/* Bit 18 : Shortcut between event TXREADY and task START */
#define RADIO_SHORTS_TXREADY_START_Pos             ( 18UL )                                    /*!< Position of TXREADY_START field. */
#define RADIO_SHORTS_TXREADY_START_Msk             ( 0x1UL << RADIO_SHORTS_TXREADY_START_Pos ) /*!< Bit mask of TXREADY_START field. */
#define RADIO_SHORTS_TXREADY_START_Disabled        ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_TXREADY_START_Enabled         ( 1UL )                                     /*!< Enable shortcut */

/* Bit 8 : Shortcut between event DISABLED and task RSSISTOP */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Pos         ( 8UL )                                         /*!< Position of DISABLED_RSSISTOP field. */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Msk         ( 0x1UL << RADIO_SHORTS_DISABLED_RSSISTOP_Pos ) /*!< Bit mask of DISABLED_RSSISTOP field. */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Disabled    ( 0UL )                                         /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Enabled     ( 1UL )                                         /*!< Enable shortcut */

/* Bit 6 : Shortcut between event ADDRESS and task BCSTART */
#define RADIO_SHORTS_ADDRESS_BCSTART_Pos           ( 6UL )                                       /*!< Position of ADDRESS_BCSTART field. */
#define RADIO_SHORTS_ADDRESS_BCSTART_Msk           ( 0x1UL << RADIO_SHORTS_ADDRESS_BCSTART_Pos ) /*!< Bit mask of ADDRESS_BCSTART field. */
#define RADIO_SHORTS_ADDRESS_BCSTART_Disabled      ( 0UL )                                       /*!< Disable shortcut */
#define RADIO_SHORTS_ADDRESS_BCSTART_Enabled       ( 1UL )                                       /*!< Enable shortcut */

/* Bit 5 : Shortcut between event END and task START */
#define RADIO_SHORTS_END_START_Pos                 ( 5UL )                                 /*!< Position of END_START field. */
#define RADIO_SHORTS_END_START_Msk                 ( 0x1UL << RADIO_SHORTS_END_START_Pos ) /*!< Bit mask of END_START field. */
#define RADIO_SHORTS_END_START_Disabled            ( 0UL )                                 /*!< Disable shortcut */
#define RADIO_SHORTS_END_START_Enabled             ( 1UL )                                 /*!< Enable shortcut */

/* Bit 4 : Shortcut between event ADDRESS and task RSSISTART */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Pos         ( 4UL )                                         /*!< Position of ADDRESS_RSSISTART field. */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Msk         ( 0x1UL << RADIO_SHORTS_ADDRESS_RSSISTART_Pos ) /*!< Bit mask of ADDRESS_RSSISTART field. */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Disabled    ( 0UL )                                         /*!< Disable shortcut */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Enabled     ( 1UL )                                         /*!< Enable shortcut */

/* Bit 3 : Shortcut between event DISABLED and task RXEN */
#define RADIO_SHORTS_DISABLED_RXEN_Pos             ( 3UL )                                     /*!< Position of DISABLED_RXEN field. */
#define RADIO_SHORTS_DISABLED_RXEN_Msk             ( 0x1UL << RADIO_SHORTS_DISABLED_RXEN_Pos ) /*!< Bit mask of DISABLED_RXEN field. */
#define RADIO_SHORTS_DISABLED_RXEN_Disabled        ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_RXEN_Enabled         ( 1UL )                                     /*!< Enable shortcut */

/* Bit 2 : Shortcut between event DISABLED and task TXEN */
#define RADIO_SHORTS_DISABLED_TXEN_Pos             ( 2UL )                                     /*!< Position of DISABLED_TXEN field. */
#define RADIO_SHORTS_DISABLED_TXEN_Msk             ( 0x1UL << RADIO_SHORTS_DISABLED_TXEN_Pos ) /*!< Bit mask of DISABLED_TXEN field. */
#define RADIO_SHORTS_DISABLED_TXEN_Disabled        ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_TXEN_Enabled         ( 1UL )                                     /*!< Enable shortcut */

/* Bit 1 : Shortcut between event END and task DISABLE */
#define RADIO_SHORTS_END_DISABLE_Pos               ( 1UL )                                   /*!< Position of END_DISABLE field. */
#define RADIO_SHORTS_END_DISABLE_Msk               ( 0x1UL << RADIO_SHORTS_END_DISABLE_Pos ) /*!< Bit mask of END_DISABLE field. */
#define RADIO_SHORTS_END_DISABLE_Disabled          ( 0UL )                                   /*!< Disable shortcut */
#define RADIO_SHORTS_END_DISABLE_Enabled           ( 1UL )                                   /*!< Enable shortcut */

