FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 0 : Shortcut between event READY and task START */
#define RADIO_SHORTS_READY_START_Pos               ( 0UL )                                   /*!< Position of READY_START field. */
#define RADIO_SHORTS_READY_START_Msk               ( 0x1UL << RADIO_SHORTS_READY_START_Pos ) /*!< Bit mask of READY_START field. */
#define RADIO_SHORTS_READY_START_Disabled          ( 0UL )                                   /*!< Disable shortcut */
#define RADIO_SHORTS_READY_START_Enabled           ( 1UL )                                   /*!< Enable shortcut */

/* Register: RADIO_INTENSET */
/* Description: Enable interrupt */

/* Bit 27 : Write '1' to enable interrupt for event PHYEND */
#define RADIO_INTENSET_PHYEND_Pos           ( 27UL )                               /*!< Position of PHYEND field. */
#define RADIO_INTENSET_PHYEND_Msk           ( 0x1UL << RADIO_INTENSET_PHYEND_Pos ) /*!< Bit mask of PHYEND field. */
#define RADIO_INTENSET_PHYEND_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define RADIO_INTENSET_PHYEND_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define RADIO_INTENSET_PHYEND_Set           ( 1UL )                                /*!< Enable */

/* Bit 22 : Write '1' to enable interrupt for event RXREADY */
#define RADIO_INTENSET_RXREADY_Pos          ( 22UL )                                /*!< Position of RXREADY field. */
#define RADIO_INTENSET_RXREADY_Msk          ( 0x1UL << RADIO_INTENSET_RXREADY_Pos ) /*!< Bit mask of RXREADY field. */
#define RADIO_INTENSET_RXREADY_Disabled     ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_RXREADY_Enabled      ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_RXREADY_Set          ( 1UL )                                 /*!< Enable */

/* Bit 21 : Write '1' to enable interrupt for event TXREADY */
#define RADIO_INTENSET_TXREADY_Pos          ( 21UL )                                /*!< Position of TXREADY field. */
#define RADIO_INTENSET_TXREADY_Msk          ( 0x1UL << RADIO_INTENSET_TXREADY_Pos ) /*!< Bit mask of TXREADY field. */
#define RADIO_INTENSET_TXREADY_Disabled     ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_TXREADY_Enabled      ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_TXREADY_Set          ( 1UL )                                 /*!< Enable */

/* Bit 13 : Write '1' to enable interrupt for event CRCERROR */
#define RADIO_INTENSET_CRCERROR_Pos         ( 13UL )                                 /*!< Position of CRCERROR field. */
#define RADIO_INTENSET_CRCERROR_Msk         ( 0x1UL << RADIO_INTENSET_CRCERROR_Pos ) /*!< Bit mask of CRCERROR field. */
#define RADIO_INTENSET_CRCERROR_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_CRCERROR_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_CRCERROR_Set         ( 1UL )                                  /*!< Enable */

/* Bit 12 : Write '1' to enable interrupt for event CRCOK */
#define RADIO_INTENSET_CRCOK_Pos            ( 12UL )                              /*!< Position of CRCOK field. */
#define RADIO_INTENSET_CRCOK_Msk            ( 0x1UL << RADIO_INTENSET_CRCOK_Pos ) /*!< Bit mask of CRCOK field. */
#define RADIO_INTENSET_CRCOK_Disabled       ( 0UL )                               /*!< Read: Disabled */
#define RADIO_INTENSET_CRCOK_Enabled        ( 1UL )                               /*!< Read: Enabled */
#define RADIO_INTENSET_CRCOK_Set            ( 1UL )                               /*!< Enable */

/* Bit 10 : Write '1' to enable interrupt for event BCMATCH */
#define RADIO_INTENSET_BCMATCH_Pos          ( 10UL )                                /*!< Position of BCMATCH field. */
#define RADIO_INTENSET_BCMATCH_Msk          ( 0x1UL << RADIO_INTENSET_BCMATCH_Pos ) /*!< Bit mask of BCMATCH field. */
#define RADIO_INTENSET_BCMATCH_Disabled     ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_BCMATCH_Enabled      ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_BCMATCH_Set          ( 1UL )                                 /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event RSSIEND */
#define RADIO_INTENSET_RSSIEND_Pos          ( 7UL )                                 /*!< Position of RSSIEND field. */
#define RADIO_INTENSET_RSSIEND_Msk          ( 0x1UL << RADIO_INTENSET_RSSIEND_Pos ) /*!< Bit mask of RSSIEND field. */
#define RADIO_INTENSET_RSSIEND_Disabled     ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_RSSIEND_Enabled      ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_RSSIEND_Set          ( 1UL )                                 /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event DEVMISS */
#define RADIO_INTENSET_DEVMISS_Pos          ( 6UL )                                 /*!< Position of DEVMISS field. */
#define RADIO_INTENSET_DEVMISS_Msk          ( 0x1UL << RADIO_INTENSET_DEVMISS_Pos ) /*!< Bit mask of DEVMISS field. */
#define RADIO_INTENSET_DEVMISS_Disabled     ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_DEVMISS_Enabled      ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_DEVMISS_Set          ( 1UL )                                 /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event DEVMATCH */
#define RADIO_INTENSET_DEVMATCH_Pos         ( 5UL )                                  /*!< Position of DEVMATCH field. */
#define RADIO_INTENSET_DEVMATCH_Msk         ( 0x1UL << RADIO_INTENSET_DEVMATCH_Pos ) /*!< Bit mask of DEVMATCH field. */
#define RADIO_INTENSET_DEVMATCH_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_DEVMATCH_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_DEVMATCH_Set         ( 1UL )                                  /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event DISABLED */
#define RADIO_INTENSET_DISABLED_Pos         ( 4UL )                                  /*!< Position of DISABLED field. */
#define RADIO_INTENSET_DISABLED_Msk         ( 0x1UL << RADIO_INTENSET_DISABLED_Pos ) /*!< Bit mask of DISABLED field. */
#define RADIO_INTENSET_DISABLED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_DISABLED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_DISABLED_Set         ( 1UL )                                  /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event END */
#define RADIO_INTENSET_END_Pos              ( 3UL )                             /*!< Position of END field. */
#define RADIO_INTENSET_END_Msk              ( 0x1UL << RADIO_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define RADIO_INTENSET_END_Disabled         ( 0UL )                             /*!< Read: Disabled */
#define RADIO_INTENSET_END_Enabled          ( 1UL )                             /*!< Read: Enabled */
#define RADIO_INTENSET_END_Set              ( 1UL )                             /*!< Enable */

