FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bits 23..0 : CRC field of previously received packet */
#define RADIO_RXCRC_RXCRC_Pos    ( 0UL )                                 /*!< Position of RXCRC field. */
#define RADIO_RXCRC_RXCRC_Msk    ( 0xFFFFFFUL << RADIO_RXCRC_RXCRC_Pos ) /*!< Bit mask of RXCRC field. */

/* Register: RADIO_DAI */
/* Description: Device address match index */

/* Bits 2..0 : Device address match index */
#define RADIO_DAI_DAI_Pos    ( 0UL )                        /*!< Position of DAI field. */
#define RADIO_DAI_DAI_Msk    ( 0x7UL << RADIO_DAI_DAI_Pos ) /*!< Bit mask of DAI field. */

/* Register: RADIO_PDUSTAT */
/* Description: Payload status */

/* Bit 0 : Status on payload length vs. PCNF1.MAXLEN */
#define RADIO_PDUSTAT_PDUSTAT_Pos            ( 0UL )                                /*!< Position of PDUSTAT field. */
#define RADIO_PDUSTAT_PDUSTAT_Msk            ( 0x1UL << RADIO_PDUSTAT_PDUSTAT_Pos ) /*!< Bit mask of PDUSTAT field. */
#define RADIO_PDUSTAT_PDUSTAT_LessThan       ( 0UL )                                /*!< Payload less than PCNF1.MAXLEN */
#define RADIO_PDUSTAT_PDUSTAT_GreaterThan    ( 1UL )                                /*!< Payload greater than PCNF1.MAXLEN */

/* Register: RADIO_PACKETPTR */
/* Description: Packet pointer */

/* Bits 31..0 : Packet pointer */
#define RADIO_PACKETPTR_PACKETPTR_Pos    ( 0UL )                                           /*!< Position of PACKETPTR field. */
#define RADIO_PACKETPTR_PACKETPTR_Msk    ( 0xFFFFFFFFUL << RADIO_PACKETPTR_PACKETPTR_Pos ) /*!< Bit mask of PACKETPTR field. */

/* Register: RADIO_FREQUENCY */
/* Description: Frequency */

/* Bit 8 : Channel map selection */
#define RADIO_FREQUENCY_MAP_Pos          ( 8UL )                              /*!< Position of MAP field. */
#define RADIO_FREQUENCY_MAP_Msk          ( 0x1UL << RADIO_FREQUENCY_MAP_Pos ) /*!< Bit mask of MAP field. */
#define RADIO_FREQUENCY_MAP_Default      ( 0UL )                              /*!< Channel map between 2400 MHZ .. 2500 MHz */
#define RADIO_FREQUENCY_MAP_Low          ( 1UL )                              /*!< Channel map between 2360 MHZ .. 2460 MHz */

/* Bits 6..0 : Radio channel frequency */
#define RADIO_FREQUENCY_FREQUENCY_Pos    ( 0UL )                                     /*!< Position of FREQUENCY field. */
#define RADIO_FREQUENCY_FREQUENCY_Msk    ( 0x7FUL << RADIO_FREQUENCY_FREQUENCY_Pos ) /*!< Bit mask of FREQUENCY field. */

/* Register: RADIO_TXPOWER */
/* Description: Output power */

/* Bits 7..0 : RADIO output power */
#define RADIO_TXPOWER_TXPOWER_Pos         ( 0UL )                                 /*!< Position of TXPOWER field. */
#define RADIO_TXPOWER_TXPOWER_Msk         ( 0xFFUL << RADIO_TXPOWER_TXPOWER_Pos ) /*!< Bit mask of TXPOWER field. */
#define RADIO_TXPOWER_TXPOWER_0dBm        ( 0x0UL )                               /*!< 0 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos3dBm     ( 0x3UL )                               /*!< +3 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos4dBm     ( 0x4UL )                               /*!< +4 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg40dBm    ( 0xD8UL )                              /*!< -40 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg30dBm    ( 0xE2UL )                              /*!< Deprecated enumerator -  -40 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg20dBm    ( 0xECUL )                              /*!< -20 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg16dBm    ( 0xF0UL )                              /*!< -16 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg12dBm    ( 0xF4UL )                              /*!< -12 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg8dBm     ( 0xF8UL )                              /*!< -8 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg4dBm     ( 0xFCUL )                              /*!< -4 dBm */

/* Register: RADIO_MODE */
/* Description: Data rate and modulation */

/* Bits 3..0 : Radio data rate and modulation setting. The radio supports frequency-shift keying (FSK) modulation. */
#define RADIO_MODE_MODE_Pos          ( 0UL )                          /*!< Position of MODE field. */
#define RADIO_MODE_MODE_Msk          ( 0xFUL << RADIO_MODE_MODE_Pos ) /*!< Bit mask of MODE field. */
#define RADIO_MODE_MODE_Nrf_1Mbit    ( 0UL )                          /*!< 1 Mbps Nordic proprietary radio mode */
#define RADIO_MODE_MODE_Nrf_2Mbit    ( 1UL )                          /*!< 2 Mbps Nordic proprietary radio mode */
#define RADIO_MODE_MODE_Ble_1Mbit    ( 3UL )                          /*!< 1 Mbps BLE */
#define RADIO_MODE_MODE_Ble_2Mbit    ( 4UL )                          /*!< 2 Mbps BLE */

/* Register: RADIO_PCNF0 */
/* Description: Packet configuration register 0 */

/* Bit 26 : Indicates if LENGTH field contains CRC or not */
#define RADIO_PCNF0_CRCINC_Pos          ( 26UL )                            /*!< Position of CRCINC field. */
#define RADIO_PCNF0_CRCINC_Msk          ( 0x1UL << RADIO_PCNF0_CRCINC_Pos ) /*!< Bit mask of CRCINC field. */
#define RADIO_PCNF0_CRCINC_Exclude      ( 0UL )                             /*!< LENGTH does not contain CRC */
#define RADIO_PCNF0_CRCINC_Include      ( 1UL )                             /*!< LENGTH includes CRC */

/* Bits 25..24 : Length of preamble on air. Decision point: TASKS_START task */
#define RADIO_PCNF0_PLEN_Pos            ( 24UL )                          /*!< Position of PLEN field. */
#define RADIO_PCNF0_PLEN_Msk            ( 0x3UL << RADIO_PCNF0_PLEN_Pos ) /*!< Bit mask of PLEN field. */
#define RADIO_PCNF0_PLEN_8bit           ( 0UL )                           /*!< 8-bit preamble */
#define RADIO_PCNF0_PLEN_16bit          ( 1UL )                           /*!< 16-bit preamble */

/* Bit 20 : Include or exclude S1 field in RAM */
#define RADIO_PCNF0_S1INCL_Pos          ( 20UL )                            /*!< Position of S1INCL field. */
#define RADIO_PCNF0_S1INCL_Msk          ( 0x1UL << RADIO_PCNF0_S1INCL_Pos ) /*!< Bit mask of S1INCL field. */
#define RADIO_PCNF0_S1INCL_Automatic    ( 0UL )                             /*!< Include S1 field in RAM only if S1LEN &gt; 0 */
#define RADIO_PCNF0_S1INCL_Include      ( 1UL )                             /*!< Always include S1 field in RAM independent of S1LEN */

/* Bits 19..16 : Length on air of S1 field in number of bits */
#define RADIO_PCNF0_S1LEN_Pos           ( 16UL )                           /*!< Position of S1LEN field. */
#define RADIO_PCNF0_S1LEN_Msk           ( 0xFUL << RADIO_PCNF0_S1LEN_Pos ) /*!< Bit mask of S1LEN field. */

/* Bit 8 : Length on air of S0 field in number of bytes */
#define RADIO_PCNF0_S0LEN_Pos           ( 8UL )                            /*!< Position of S0LEN field. */
#define RADIO_PCNF0_S0LEN_Msk           ( 0x1UL << RADIO_PCNF0_S0LEN_Pos ) /*!< Bit mask of S0LEN field. */

/* Bits 3..0 : Length on air of LENGTH field in number of bits */
#define RADIO_PCNF0_LFLEN_Pos           ( 0UL )                            /*!< Position of LFLEN field. */
#define RADIO_PCNF0_LFLEN_Msk           ( 0xFUL << RADIO_PCNF0_LFLEN_Pos ) /*!< Bit mask of LFLEN field. */

/* Register: RADIO_PCNF1 */
/* Description: Packet configuration register 1 */

/* Bit 25 : Enable or disable packet whitening */
#define RADIO_PCNF1_WHITEEN_Pos         ( 25UL )                             /*!< Position of WHITEEN field. */
#define RADIO_PCNF1_WHITEEN_Msk         ( 0x1UL << RADIO_PCNF1_WHITEEN_Pos ) /*!< Bit mask of WHITEEN field. */
#define RADIO_PCNF1_WHITEEN_Disabled    ( 0UL )                              /*!< Disable */
#define RADIO_PCNF1_WHITEEN_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 24 : On-air endianness of packet, this applies to the S0, LENGTH, S1, and the PAYLOAD fields. */
#define RADIO_PCNF1_ENDIAN_Pos          ( 24UL )                            /*!< Position of ENDIAN field. */
#define RADIO_PCNF1_ENDIAN_Msk          ( 0x1UL << RADIO_PCNF1_ENDIAN_Pos ) /*!< Bit mask of ENDIAN field. */
#define RADIO_PCNF1_ENDIAN_Little       ( 0UL )                             /*!< Least significant bit on air first */
#define RADIO_PCNF1_ENDIAN_Big          ( 1UL )                             /*!< Most significant bit on air first */

