FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bits 18..16 : Base address length in number of bytes */
#define RADIO_PCNF1_BALEN_Pos           ( 16UL )                           /*!< Position of BALEN field. */
#define RADIO_PCNF1_BALEN_Msk           ( 0x7UL << RADIO_PCNF1_BALEN_Pos ) /*!< Bit mask of BALEN field. */

/* Bits 15..8 : Static length in number of bytes */
#define RADIO_PCNF1_STATLEN_Pos         ( 8UL )                               /*!< Position of STATLEN field. */
#define RADIO_PCNF1_STATLEN_Msk         ( 0xFFUL << RADIO_PCNF1_STATLEN_Pos ) /*!< Bit mask of STATLEN field. */

/* Bits 7..0 : Maximum length of packet payload. If the packet payload is larger than MAXLEN, the radio will truncate the payload to MAXLEN. */
#define RADIO_PCNF1_MAXLEN_Pos          ( 0UL )                              /*!< Position of MAXLEN field. */
#define RADIO_PCNF1_MAXLEN_Msk          ( 0xFFUL << RADIO_PCNF1_MAXLEN_Pos ) /*!< Bit mask of MAXLEN field. */

/* Register: RADIO_BASE0 */
/* Description: Base address 0 */

/* Bits 31..0 : Base address 0 */
#define RADIO_BASE0_BASE0_Pos    ( 0UL )                                   /*!< Position of BASE0 field. */
#define RADIO_BASE0_BASE0_Msk    ( 0xFFFFFFFFUL << RADIO_BASE0_BASE0_Pos ) /*!< Bit mask of BASE0 field. */

/* Register: RADIO_BASE1 */
/* Description: Base address 1 */

/* Bits 31..0 : Base address 1 */
#define RADIO_BASE1_BASE1_Pos    ( 0UL )                                   /*!< Position of BASE1 field. */
#define RADIO_BASE1_BASE1_Msk    ( 0xFFFFFFFFUL << RADIO_BASE1_BASE1_Pos ) /*!< Bit mask of BASE1 field. */

/* Register: RADIO_PREFIX0 */
/* Description: Prefixes bytes for logical addresses 0-3 */

/* Bits 31..24 : Address prefix 3. */
#define RADIO_PREFIX0_AP3_Pos    ( 24UL )                            /*!< Position of AP3 field. */
#define RADIO_PREFIX0_AP3_Msk    ( 0xFFUL << RADIO_PREFIX0_AP3_Pos ) /*!< Bit mask of AP3 field. */

/* Bits 23..16 : Address prefix 2. */
#define RADIO_PREFIX0_AP2_Pos    ( 16UL )                            /*!< Position of AP2 field. */
#define RADIO_PREFIX0_AP2_Msk    ( 0xFFUL << RADIO_PREFIX0_AP2_Pos ) /*!< Bit mask of AP2 field. */

/* Bits 15..8 : Address prefix 1. */
#define RADIO_PREFIX0_AP1_Pos    ( 8UL )                             /*!< Position of AP1 field. */
#define RADIO_PREFIX0_AP1_Msk    ( 0xFFUL << RADIO_PREFIX0_AP1_Pos ) /*!< Bit mask of AP1 field. */

/* Bits 7..0 : Address prefix 0. */
#define RADIO_PREFIX0_AP0_Pos    ( 0UL )                             /*!< Position of AP0 field. */
#define RADIO_PREFIX0_AP0_Msk    ( 0xFFUL << RADIO_PREFIX0_AP0_Pos ) /*!< Bit mask of AP0 field. */

/* Register: RADIO_PREFIX1 */
/* Description: Prefixes bytes for logical addresses 4-7 */

/* Bits 31..24 : Address prefix 7. */
#define RADIO_PREFIX1_AP7_Pos    ( 24UL )                            /*!< Position of AP7 field. */
#define RADIO_PREFIX1_AP7_Msk    ( 0xFFUL << RADIO_PREFIX1_AP7_Pos ) /*!< Bit mask of AP7 field. */

/* Bits 23..16 : Address prefix 6. */
#define RADIO_PREFIX1_AP6_Pos    ( 16UL )                            /*!< Position of AP6 field. */
#define RADIO_PREFIX1_AP6_Msk    ( 0xFFUL << RADIO_PREFIX1_AP6_Pos ) /*!< Bit mask of AP6 field. */

/* Bits 15..8 : Address prefix 5. */
#define RADIO_PREFIX1_AP5_Pos    ( 8UL )                             /*!< Position of AP5 field. */
#define RADIO_PREFIX1_AP5_Msk    ( 0xFFUL << RADIO_PREFIX1_AP5_Pos ) /*!< Bit mask of AP5 field. */

/* Bits 7..0 : Address prefix 4. */
#define RADIO_PREFIX1_AP4_Pos    ( 0UL )                             /*!< Position of AP4 field. */
#define RADIO_PREFIX1_AP4_Msk    ( 0xFFUL << RADIO_PREFIX1_AP4_Pos ) /*!< Bit mask of AP4 field. */

/* Register: RADIO_TXADDRESS */
/* Description: Transmit address select */

/* Bits 2..0 : Transmit address select */
#define RADIO_TXADDRESS_TXADDRESS_Pos    ( 0UL )                                    /*!< Position of TXADDRESS field. */
#define RADIO_TXADDRESS_TXADDRESS_Msk    ( 0x7UL << RADIO_TXADDRESS_TXADDRESS_Pos ) /*!< Bit mask of TXADDRESS field. */

/* Register: RADIO_RXADDRESSES */
/* Description: Receive address select */

/* Bit 7 : Enable or disable reception on logical address 7. */
#define RADIO_RXADDRESSES_ADDR7_Pos         ( 7UL )                                  /*!< Position of ADDR7 field. */
#define RADIO_RXADDRESSES_ADDR7_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR7_Pos ) /*!< Bit mask of ADDR7 field. */
#define RADIO_RXADDRESSES_ADDR7_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR7_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 6 : Enable or disable reception on logical address 6. */
#define RADIO_RXADDRESSES_ADDR6_Pos         ( 6UL )                                  /*!< Position of ADDR6 field. */
#define RADIO_RXADDRESSES_ADDR6_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR6_Pos ) /*!< Bit mask of ADDR6 field. */
#define RADIO_RXADDRESSES_ADDR6_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR6_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 5 : Enable or disable reception on logical address 5. */
#define RADIO_RXADDRESSES_ADDR5_Pos         ( 5UL )                                  /*!< Position of ADDR5 field. */
#define RADIO_RXADDRESSES_ADDR5_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR5_Pos ) /*!< Bit mask of ADDR5 field. */
#define RADIO_RXADDRESSES_ADDR5_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR5_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 4 : Enable or disable reception on logical address 4. */
#define RADIO_RXADDRESSES_ADDR4_Pos         ( 4UL )                                  /*!< Position of ADDR4 field. */
#define RADIO_RXADDRESSES_ADDR4_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR4_Pos ) /*!< Bit mask of ADDR4 field. */
#define RADIO_RXADDRESSES_ADDR4_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR4_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 3 : Enable or disable reception on logical address 3. */
#define RADIO_RXADDRESSES_ADDR3_Pos         ( 3UL )                                  /*!< Position of ADDR3 field. */
#define RADIO_RXADDRESSES_ADDR3_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR3_Pos ) /*!< Bit mask of ADDR3 field. */
#define RADIO_RXADDRESSES_ADDR3_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR3_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 2 : Enable or disable reception on logical address 2. */
#define RADIO_RXADDRESSES_ADDR2_Pos         ( 2UL )                                  /*!< Position of ADDR2 field. */
#define RADIO_RXADDRESSES_ADDR2_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR2_Pos ) /*!< Bit mask of ADDR2 field. */
#define RADIO_RXADDRESSES_ADDR2_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR2_Enabled     ( 1UL )                                  /*!< Enable */

