FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 1 : Enable or disable reception on logical address 1. */
#define RADIO_RXADDRESSES_ADDR1_Pos         ( 1UL )                                  /*!< Position of ADDR1 field. */
#define RADIO_RXADDRESSES_ADDR1_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR1_Pos ) /*!< Bit mask of ADDR1 field. */
#define RADIO_RXADDRESSES_ADDR1_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR1_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 0 : Enable or disable reception on logical address 0. */
#define RADIO_RXADDRESSES_ADDR0_Pos         ( 0UL )                                  /*!< Position of ADDR0 field. */
#define RADIO_RXADDRESSES_ADDR0_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR0_Pos ) /*!< Bit mask of ADDR0 field. */
#define RADIO_RXADDRESSES_ADDR0_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR0_Enabled     ( 1UL )                                  /*!< Enable */

/* Register: RADIO_CRCCNF */
/* Description: CRC configuration */

/* Bits 9..8 : Include or exclude packet address field out of CRC calculation. */
#define RADIO_CRCCNF_SKIPADDR_Pos        ( 8UL )                                /*!< Position of SKIPADDR field. */
#define RADIO_CRCCNF_SKIPADDR_Msk        ( 0x3UL << RADIO_CRCCNF_SKIPADDR_Pos ) /*!< Bit mask of SKIPADDR field. */
#define RADIO_CRCCNF_SKIPADDR_Include    ( 0UL )                                /*!< CRC calculation includes address field */
#define RADIO_CRCCNF_SKIPADDR_Skip       ( 1UL )                                /*!< CRC calculation does not include address field. The CRC calculation will start at the first byte after the address. */

/* Bits 1..0 : CRC length in number of bytes */
#define RADIO_CRCCNF_LEN_Pos             ( 0UL )                           /*!< Position of LEN field. */
#define RADIO_CRCCNF_LEN_Msk             ( 0x3UL << RADIO_CRCCNF_LEN_Pos ) /*!< Bit mask of LEN field. */
#define RADIO_CRCCNF_LEN_Disabled        ( 0UL )                           /*!< CRC length is zero and CRC calculation is disabled */
#define RADIO_CRCCNF_LEN_One             ( 1UL )                           /*!< CRC length is one byte and CRC calculation is enabled */
#define RADIO_CRCCNF_LEN_Two             ( 2UL )                           /*!< CRC length is two bytes and CRC calculation is enabled */
#define RADIO_CRCCNF_LEN_Three           ( 3UL )                           /*!< CRC length is three bytes and CRC calculation is enabled */

/* Register: RADIO_CRCPOLY */
/* Description: CRC polynomial */

/* Bits 23..0 : CRC polynomial */
#define RADIO_CRCPOLY_CRCPOLY_Pos    ( 0UL )                                     /*!< Position of CRCPOLY field. */
#define RADIO_CRCPOLY_CRCPOLY_Msk    ( 0xFFFFFFUL << RADIO_CRCPOLY_CRCPOLY_Pos ) /*!< Bit mask of CRCPOLY field. */

/* Register: RADIO_CRCINIT */
/* Description: CRC initial value */

/* Bits 23..0 : CRC initial value */
#define RADIO_CRCINIT_CRCINIT_Pos    ( 0UL )                                     /*!< Position of CRCINIT field. */
#define RADIO_CRCINIT_CRCINIT_Msk    ( 0xFFFFFFUL << RADIO_CRCINIT_CRCINIT_Pos ) /*!< Bit mask of CRCINIT field. */

/* Register: RADIO_TIFS */
/* Description: Interframe spacing in us */

/* Bits 9..0 : Interframe spacing in us. */
#define RADIO_TIFS_TIFS_Pos    ( 0UL )                            /*!< Position of TIFS field. */
#define RADIO_TIFS_TIFS_Msk    ( 0x3FFUL << RADIO_TIFS_TIFS_Pos ) /*!< Bit mask of TIFS field. */

/* Register: RADIO_RSSISAMPLE */
/* Description: RSSI sample */

/* Bits 6..0 : RSSI sample. */
#define RADIO_RSSISAMPLE_RSSISAMPLE_Pos    ( 0UL )                                       /*!< Position of RSSISAMPLE field. */
#define RADIO_RSSISAMPLE_RSSISAMPLE_Msk    ( 0x7FUL << RADIO_RSSISAMPLE_RSSISAMPLE_Pos ) /*!< Bit mask of RSSISAMPLE field. */

/* Register: RADIO_STATE */
/* Description: Current radio state */

/* Bits 3..0 : Current radio state */
#define RADIO_STATE_STATE_Pos          ( 0UL )                            /*!< Position of STATE field. */
#define RADIO_STATE_STATE_Msk          ( 0xFUL << RADIO_STATE_STATE_Pos ) /*!< Bit mask of STATE field. */
#define RADIO_STATE_STATE_Disabled     ( 0UL )                            /*!< RADIO is in the Disabled state */
#define RADIO_STATE_STATE_RxRu         ( 1UL )                            /*!< RADIO is in the RXRU state */
#define RADIO_STATE_STATE_RxIdle       ( 2UL )                            /*!< RADIO is in the RXIDLE state */
#define RADIO_STATE_STATE_Rx           ( 3UL )                            /*!< RADIO is in the RX state */
#define RADIO_STATE_STATE_RxDisable    ( 4UL )                            /*!< RADIO is in the RXDISABLED state */
#define RADIO_STATE_STATE_TxRu         ( 9UL )                            /*!< RADIO is in the TXRU state */
#define RADIO_STATE_STATE_TxIdle       ( 10UL )                           /*!< RADIO is in the TXIDLE state */
#define RADIO_STATE_STATE_Tx           ( 11UL )                           /*!< RADIO is in the TX state */
#define RADIO_STATE_STATE_TxDisable    ( 12UL )                           /*!< RADIO is in the TXDISABLED state */

/* Register: RADIO_DATAWHITEIV */
/* Description: Data whitening initial value */

/* Bits 6..0 : Data whitening initial value. Bit 6 is hardwired to '1', writing '0' to it has no effect, and it will always be read back and used by the device as '1'. */
#define RADIO_DATAWHITEIV_DATAWHITEIV_Pos    ( 0UL )                                         /*!< Position of DATAWHITEIV field. */
#define RADIO_DATAWHITEIV_DATAWHITEIV_Msk    ( 0x7FUL << RADIO_DATAWHITEIV_DATAWHITEIV_Pos ) /*!< Bit mask of DATAWHITEIV field. */

/* Register: RADIO_BCC */
/* Description: Bit counter compare */

/* Bits 31..0 : Bit counter compare */
#define RADIO_BCC_BCC_Pos    ( 0UL )                               /*!< Position of BCC field. */
#define RADIO_BCC_BCC_Msk    ( 0xFFFFFFFFUL << RADIO_BCC_BCC_Pos ) /*!< Bit mask of BCC field. */

/* Register: RADIO_DAB */
/* Description: Description collection: Device address base segment n */

/* Bits 31..0 : Device address base segment n */
#define RADIO_DAB_DAB_Pos    ( 0UL )                               /*!< Position of DAB field. */
#define RADIO_DAB_DAB_Msk    ( 0xFFFFFFFFUL << RADIO_DAB_DAB_Pos ) /*!< Bit mask of DAB field. */

/* Register: RADIO_DAP */
/* Description: Description collection: Device address prefix n */

/* Bits 15..0 : Device address prefix n */
#define RADIO_DAP_DAP_Pos    ( 0UL )                           /*!< Position of DAP field. */
#define RADIO_DAP_DAP_Msk    ( 0xFFFFUL << RADIO_DAP_DAP_Pos ) /*!< Bit mask of DAP field. */

/* Register: RADIO_DACNF */
/* Description: Device address match configuration */

/* Bit 15 : TxAdd for device address 7 */
#define RADIO_DACNF_TXADD7_Pos       ( 15UL )                            /*!< Position of TXADD7 field. */
#define RADIO_DACNF_TXADD7_Msk       ( 0x1UL << RADIO_DACNF_TXADD7_Pos ) /*!< Bit mask of TXADD7 field. */

