FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 14 : TxAdd for device address 6 */
#define RADIO_DACNF_TXADD6_Pos       ( 14UL )                            /*!< Position of TXADD6 field. */
#define RADIO_DACNF_TXADD6_Msk       ( 0x1UL << RADIO_DACNF_TXADD6_Pos ) /*!< Bit mask of TXADD6 field. */

/* Bit 13 : TxAdd for device address 5 */
#define RADIO_DACNF_TXADD5_Pos       ( 13UL )                            /*!< Position of TXADD5 field. */
#define RADIO_DACNF_TXADD5_Msk       ( 0x1UL << RADIO_DACNF_TXADD5_Pos ) /*!< Bit mask of TXADD5 field. */

/* Bit 12 : TxAdd for device address 4 */
#define RADIO_DACNF_TXADD4_Pos       ( 12UL )                            /*!< Position of TXADD4 field. */
#define RADIO_DACNF_TXADD4_Msk       ( 0x1UL << RADIO_DACNF_TXADD4_Pos ) /*!< Bit mask of TXADD4 field. */

/* Bit 11 : TxAdd for device address 3 */
#define RADIO_DACNF_TXADD3_Pos       ( 11UL )                            /*!< Position of TXADD3 field. */
#define RADIO_DACNF_TXADD3_Msk       ( 0x1UL << RADIO_DACNF_TXADD3_Pos ) /*!< Bit mask of TXADD3 field. */

/* Bit 10 : TxAdd for device address 2 */
#define RADIO_DACNF_TXADD2_Pos       ( 10UL )                            /*!< Position of TXADD2 field. */
#define RADIO_DACNF_TXADD2_Msk       ( 0x1UL << RADIO_DACNF_TXADD2_Pos ) /*!< Bit mask of TXADD2 field. */

/* Bit 9 : TxAdd for device address 1 */
#define RADIO_DACNF_TXADD1_Pos       ( 9UL )                             /*!< Position of TXADD1 field. */
#define RADIO_DACNF_TXADD1_Msk       ( 0x1UL << RADIO_DACNF_TXADD1_Pos ) /*!< Bit mask of TXADD1 field. */

/* Bit 8 : TxAdd for device address 0 */
#define RADIO_DACNF_TXADD0_Pos       ( 8UL )                             /*!< Position of TXADD0 field. */
#define RADIO_DACNF_TXADD0_Msk       ( 0x1UL << RADIO_DACNF_TXADD0_Pos ) /*!< Bit mask of TXADD0 field. */

/* Bit 7 : Enable or disable device address matching using device address 7 */
#define RADIO_DACNF_ENA7_Pos         ( 7UL )                           /*!< Position of ENA7 field. */
#define RADIO_DACNF_ENA7_Msk         ( 0x1UL << RADIO_DACNF_ENA7_Pos ) /*!< Bit mask of ENA7 field. */
#define RADIO_DACNF_ENA7_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA7_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 6 : Enable or disable device address matching using device address 6 */
#define RADIO_DACNF_ENA6_Pos         ( 6UL )                           /*!< Position of ENA6 field. */
#define RADIO_DACNF_ENA6_Msk         ( 0x1UL << RADIO_DACNF_ENA6_Pos ) /*!< Bit mask of ENA6 field. */
#define RADIO_DACNF_ENA6_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA6_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 5 : Enable or disable device address matching using device address 5 */
#define RADIO_DACNF_ENA5_Pos         ( 5UL )                           /*!< Position of ENA5 field. */
#define RADIO_DACNF_ENA5_Msk         ( 0x1UL << RADIO_DACNF_ENA5_Pos ) /*!< Bit mask of ENA5 field. */
#define RADIO_DACNF_ENA5_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA5_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 4 : Enable or disable device address matching using device address 4 */
#define RADIO_DACNF_ENA4_Pos         ( 4UL )                           /*!< Position of ENA4 field. */
#define RADIO_DACNF_ENA4_Msk         ( 0x1UL << RADIO_DACNF_ENA4_Pos ) /*!< Bit mask of ENA4 field. */
#define RADIO_DACNF_ENA4_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA4_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 3 : Enable or disable device address matching using device address 3 */
#define RADIO_DACNF_ENA3_Pos         ( 3UL )                           /*!< Position of ENA3 field. */
#define RADIO_DACNF_ENA3_Msk         ( 0x1UL << RADIO_DACNF_ENA3_Pos ) /*!< Bit mask of ENA3 field. */
#define RADIO_DACNF_ENA3_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA3_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 2 : Enable or disable device address matching using device address 2 */
#define RADIO_DACNF_ENA2_Pos         ( 2UL )                           /*!< Position of ENA2 field. */
#define RADIO_DACNF_ENA2_Msk         ( 0x1UL << RADIO_DACNF_ENA2_Pos ) /*!< Bit mask of ENA2 field. */
#define RADIO_DACNF_ENA2_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA2_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 1 : Enable or disable device address matching using device address 1 */
#define RADIO_DACNF_ENA1_Pos         ( 1UL )                           /*!< Position of ENA1 field. */
#define RADIO_DACNF_ENA1_Msk         ( 0x1UL << RADIO_DACNF_ENA1_Pos ) /*!< Bit mask of ENA1 field. */
#define RADIO_DACNF_ENA1_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA1_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 0 : Enable or disable device address matching using device address 0 */
#define RADIO_DACNF_ENA0_Pos         ( 0UL )                           /*!< Position of ENA0 field. */
#define RADIO_DACNF_ENA0_Msk         ( 0x1UL << RADIO_DACNF_ENA0_Pos ) /*!< Bit mask of ENA0 field. */
#define RADIO_DACNF_ENA0_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA0_Enabled     ( 1UL )                           /*!< Enabled */

/* Register: RADIO_MODECNF0 */
/* Description: Radio mode configuration register 0 */

/* Bits 9..8 : Default TX value */
#define RADIO_MODECNF0_DTX_Pos       ( 8UL )                             /*!< Position of DTX field. */
#define RADIO_MODECNF0_DTX_Msk       ( 0x3UL << RADIO_MODECNF0_DTX_Pos ) /*!< Bit mask of DTX field. */
#define RADIO_MODECNF0_DTX_B1        ( 0UL )                             /*!< Transmit '1' */
#define RADIO_MODECNF0_DTX_B0        ( 1UL )                             /*!< Transmit '0' */
#define RADIO_MODECNF0_DTX_Center    ( 2UL )                             /*!< Transmit center frequency */

