FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 0 : Radio ramp-up time */
#define RADIO_MODECNF0_RU_Pos        ( 0UL )                            /*!< Position of RU field. */
#define RADIO_MODECNF0_RU_Msk        ( 0x1UL << RADIO_MODECNF0_RU_Pos ) /*!< Bit mask of RU field. */
#define RADIO_MODECNF0_RU_Default    ( 0UL )                            /*!< Default ramp-up time (tRXEN and tTXEN), compatible with firmware written for nRF51 */
#define RADIO_MODECNF0_RU_Fast       ( 1UL )                            /*!< Fast ramp-up (tRXEN,FAST and tTXEN,FAST), see electrical specifications for more information */

/* Register: RADIO_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define RADIO_POWER_POWER_Pos         ( 0UL )                            /*!< Position of POWER field. */
#define RADIO_POWER_POWER_Msk         ( 0x1UL << RADIO_POWER_POWER_Pos ) /*!< Bit mask of POWER field. */
#define RADIO_POWER_POWER_Disabled    ( 0UL )                            /*!< Peripheral is powered off */
#define RADIO_POWER_POWER_Enabled     ( 1UL )                            /*!< Peripheral is powered on */


/* Peripheral: RNG */
/* Description: Random Number Generator */

/* Register: RNG_TASKS_START */
/* Description: Task starting the random number generator */

/* Bit 0 : Task starting the random number generator */
#define RNG_TASKS_START_TASKS_START_Pos        ( 0UL )                                      /*!< Position of TASKS_START field. */
#define RNG_TASKS_START_TASKS_START_Msk        ( 0x1UL << RNG_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define RNG_TASKS_START_TASKS_START_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: RNG_TASKS_STOP */
/* Description: Task stopping the random number generator */

/* Bit 0 : Task stopping the random number generator */
#define RNG_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define RNG_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << RNG_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define RNG_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: RNG_EVENTS_VALRDY */
/* Description: Event being generated for every new random number written to the VALUE register */

/* Bit 0 : Event being generated for every new random number written to the VALUE register */
#define RNG_EVENTS_VALRDY_EVENTS_VALRDY_Pos             ( 0UL )                                          /*!< Position of EVENTS_VALRDY field. */
#define RNG_EVENTS_VALRDY_EVENTS_VALRDY_Msk             ( 0x1UL << RNG_EVENTS_VALRDY_EVENTS_VALRDY_Pos ) /*!< Bit mask of EVENTS_VALRDY field. */
#define RNG_EVENTS_VALRDY_EVENTS_VALRDY_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define RNG_EVENTS_VALRDY_EVENTS_VALRDY_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: RNG_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 0 : Shortcut between event VALRDY and task STOP */
#define RNG_SHORTS_VALRDY_STOP_Pos         ( 0UL )                                 /*!< Position of VALRDY_STOP field. */
#define RNG_SHORTS_VALRDY_STOP_Msk         ( 0x1UL << RNG_SHORTS_VALRDY_STOP_Pos ) /*!< Bit mask of VALRDY_STOP field. */
#define RNG_SHORTS_VALRDY_STOP_Disabled    ( 0UL )                                 /*!< Disable shortcut */
#define RNG_SHORTS_VALRDY_STOP_Enabled     ( 1UL )                                 /*!< Enable shortcut */

/* Register: RNG_INTENSET */
/* Description: Enable interrupt */

/* Bit 0 : Write '1' to enable interrupt for event VALRDY */
#define RNG_INTENSET_VALRDY_Pos         ( 0UL )                              /*!< Position of VALRDY field. */
#define RNG_INTENSET_VALRDY_Msk         ( 0x1UL << RNG_INTENSET_VALRDY_Pos ) /*!< Bit mask of VALRDY field. */
#define RNG_INTENSET_VALRDY_Disabled    ( 0UL )                              /*!< Read: Disabled */
#define RNG_INTENSET_VALRDY_Enabled     ( 1UL )                              /*!< Read: Enabled */
#define RNG_INTENSET_VALRDY_Set         ( 1UL )                              /*!< Enable */

/* Register: RNG_INTENCLR */
/* Description: Disable interrupt */

/* Bit 0 : Write '1' to disable interrupt for event VALRDY */
#define RNG_INTENCLR_VALRDY_Pos         ( 0UL )                              /*!< Position of VALRDY field. */
#define RNG_INTENCLR_VALRDY_Msk         ( 0x1UL << RNG_INTENCLR_VALRDY_Pos ) /*!< Bit mask of VALRDY field. */
#define RNG_INTENCLR_VALRDY_Disabled    ( 0UL )                              /*!< Read: Disabled */
#define RNG_INTENCLR_VALRDY_Enabled     ( 1UL )                              /*!< Read: Enabled */
#define RNG_INTENCLR_VALRDY_Clear       ( 1UL )                              /*!< Disable */

/* Register: RNG_CONFIG */
/* Description: Configuration register */

/* Bit 0 : Bias correction */
#define RNG_CONFIG_DERCEN_Pos         ( 0UL )                            /*!< Position of DERCEN field. */
#define RNG_CONFIG_DERCEN_Msk         ( 0x1UL << RNG_CONFIG_DERCEN_Pos ) /*!< Bit mask of DERCEN field. */
#define RNG_CONFIG_DERCEN_Disabled    ( 0UL )                            /*!< Disabled */
#define RNG_CONFIG_DERCEN_Enabled     ( 1UL )                            /*!< Enabled */

/* Register: RNG_VALUE */
/* Description: Output random number */

/* Bits 7..0 : Generated random number */
#define RNG_VALUE_VALUE_Pos    ( 0UL )                           /*!< Position of VALUE field. */
#define RNG_VALUE_VALUE_Msk    ( 0xFFUL << RNG_VALUE_VALUE_Pos ) /*!< Bit mask of VALUE field. */


/* Peripheral: RTC */
/* Description: Real time counter 0 */

/* Register: RTC_TASKS_START */
/* Description: Start RTC COUNTER */

/* Bit 0 : Start RTC COUNTER */
#define RTC_TASKS_START_TASKS_START_Pos        ( 0UL )                                      /*!< Position of TASKS_START field. */
#define RTC_TASKS_START_TASKS_START_Msk        ( 0x1UL << RTC_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define RTC_TASKS_START_TASKS_START_Trigger    ( 1UL )                                      /*!< Trigger task */

