FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: RTC_TASKS_STOP */
/* Description: Stop RTC COUNTER */

/* Bit 0 : Stop RTC COUNTER */
#define RTC_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define RTC_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << RTC_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define RTC_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: RTC_TASKS_CLEAR */
/* Description: Clear RTC COUNTER */

/* Bit 0 : Clear RTC COUNTER */
#define RTC_TASKS_CLEAR_TASKS_CLEAR_Pos        ( 0UL )                                      /*!< Position of TASKS_CLEAR field. */
#define RTC_TASKS_CLEAR_TASKS_CLEAR_Msk        ( 0x1UL << RTC_TASKS_CLEAR_TASKS_CLEAR_Pos ) /*!< Bit mask of TASKS_CLEAR field. */
#define RTC_TASKS_CLEAR_TASKS_CLEAR_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: RTC_TASKS_TRIGOVRFLW */
/* Description: Set COUNTER to 0xFFFFF0 */

/* Bit 0 : Set COUNTER to 0xFFFFF0 */
#define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos        ( 0UL )                                                /*!< Position of TASKS_TRIGOVRFLW field. */
#define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Msk        ( 0x1UL << RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos ) /*!< Bit mask of TASKS_TRIGOVRFLW field. */
#define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Trigger    ( 1UL )                                                /*!< Trigger task */

/* Register: RTC_EVENTS_TICK */
/* Description: Event on COUNTER increment */

/* Bit 0 : Event on COUNTER increment */
#define RTC_EVENTS_TICK_EVENTS_TICK_Pos             ( 0UL )                                      /*!< Position of EVENTS_TICK field. */
#define RTC_EVENTS_TICK_EVENTS_TICK_Msk             ( 0x1UL << RTC_EVENTS_TICK_EVENTS_TICK_Pos ) /*!< Bit mask of EVENTS_TICK field. */
#define RTC_EVENTS_TICK_EVENTS_TICK_NotGenerated    ( 0UL )                                      /*!< Event not generated */
#define RTC_EVENTS_TICK_EVENTS_TICK_Generated       ( 1UL )                                      /*!< Event generated */

/* Register: RTC_EVENTS_OVRFLW */
/* Description: Event on COUNTER overflow */

/* Bit 0 : Event on COUNTER overflow */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos             ( 0UL )                                          /*!< Position of EVENTS_OVRFLW field. */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Msk             ( 0x1UL << RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos ) /*!< Bit mask of EVENTS_OVRFLW field. */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: RTC_EVENTS_COMPARE */
/* Description: Description collection: Compare event on CC[n] match */

/* Bit 0 : Compare event on CC[n] match */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos             ( 0UL )                                            /*!< Position of EVENTS_COMPARE field. */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Msk             ( 0x1UL << RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos ) /*!< Bit mask of EVENTS_COMPARE field. */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: RTC_INTENSET */
/* Description: Enable interrupt */

/* Bit 19 : Write '1' to enable interrupt for event COMPARE[3] */
#define RTC_INTENSET_COMPARE3_Pos         ( 19UL )                               /*!< Position of COMPARE3 field. */
#define RTC_INTENSET_COMPARE3_Msk         ( 0x1UL << RTC_INTENSET_COMPARE3_Pos ) /*!< Bit mask of COMPARE3 field. */
#define RTC_INTENSET_COMPARE3_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENSET_COMPARE3_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENSET_COMPARE3_Set         ( 1UL )                                /*!< Enable */

/* Bit 18 : Write '1' to enable interrupt for event COMPARE[2] */
#define RTC_INTENSET_COMPARE2_Pos         ( 18UL )                               /*!< Position of COMPARE2 field. */
#define RTC_INTENSET_COMPARE2_Msk         ( 0x1UL << RTC_INTENSET_COMPARE2_Pos ) /*!< Bit mask of COMPARE2 field. */
#define RTC_INTENSET_COMPARE2_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENSET_COMPARE2_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENSET_COMPARE2_Set         ( 1UL )                                /*!< Enable */

/* Bit 17 : Write '1' to enable interrupt for event COMPARE[1] */
#define RTC_INTENSET_COMPARE1_Pos         ( 17UL )                               /*!< Position of COMPARE1 field. */
#define RTC_INTENSET_COMPARE1_Msk         ( 0x1UL << RTC_INTENSET_COMPARE1_Pos ) /*!< Bit mask of COMPARE1 field. */
#define RTC_INTENSET_COMPARE1_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENSET_COMPARE1_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENSET_COMPARE1_Set         ( 1UL )                                /*!< Enable */

/* Bit 16 : Write '1' to enable interrupt for event COMPARE[0] */
#define RTC_INTENSET_COMPARE0_Pos         ( 16UL )                               /*!< Position of COMPARE0 field. */
#define RTC_INTENSET_COMPARE0_Msk         ( 0x1UL << RTC_INTENSET_COMPARE0_Pos ) /*!< Bit mask of COMPARE0 field. */
#define RTC_INTENSET_COMPARE0_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENSET_COMPARE0_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENSET_COMPARE0_Set         ( 1UL )                                /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event OVRFLW */
#define RTC_INTENSET_OVRFLW_Pos           ( 1UL )                              /*!< Position of OVRFLW field. */
#define RTC_INTENSET_OVRFLW_Msk           ( 0x1UL << RTC_INTENSET_OVRFLW_Pos ) /*!< Bit mask of OVRFLW field. */
#define RTC_INTENSET_OVRFLW_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define RTC_INTENSET_OVRFLW_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define RTC_INTENSET_OVRFLW_Set           ( 1UL )                              /*!< Enable */

