FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 0 : Write '1' to enable interrupt for event TICK */
#define RTC_INTENSET_TICK_Pos             ( 0UL )                            /*!< Position of TICK field. */
#define RTC_INTENSET_TICK_Msk             ( 0x1UL << RTC_INTENSET_TICK_Pos ) /*!< Bit mask of TICK field. */
#define RTC_INTENSET_TICK_Disabled        ( 0UL )                            /*!< Read: Disabled */
#define RTC_INTENSET_TICK_Enabled         ( 1UL )                            /*!< Read: Enabled */
#define RTC_INTENSET_TICK_Set             ( 1UL )                            /*!< Enable */

/* Register: RTC_INTENCLR */
/* Description: Disable interrupt */

/* Bit 19 : Write '1' to disable interrupt for event COMPARE[3] */
#define RTC_INTENCLR_COMPARE3_Pos         ( 19UL )                               /*!< Position of COMPARE3 field. */
#define RTC_INTENCLR_COMPARE3_Msk         ( 0x1UL << RTC_INTENCLR_COMPARE3_Pos ) /*!< Bit mask of COMPARE3 field. */
#define RTC_INTENCLR_COMPARE3_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENCLR_COMPARE3_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENCLR_COMPARE3_Clear       ( 1UL )                                /*!< Disable */

/* Bit 18 : Write '1' to disable interrupt for event COMPARE[2] */
#define RTC_INTENCLR_COMPARE2_Pos         ( 18UL )                               /*!< Position of COMPARE2 field. */
#define RTC_INTENCLR_COMPARE2_Msk         ( 0x1UL << RTC_INTENCLR_COMPARE2_Pos ) /*!< Bit mask of COMPARE2 field. */
#define RTC_INTENCLR_COMPARE2_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENCLR_COMPARE2_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENCLR_COMPARE2_Clear       ( 1UL )                                /*!< Disable */

/* Bit 17 : Write '1' to disable interrupt for event COMPARE[1] */
#define RTC_INTENCLR_COMPARE1_Pos         ( 17UL )                               /*!< Position of COMPARE1 field. */
#define RTC_INTENCLR_COMPARE1_Msk         ( 0x1UL << RTC_INTENCLR_COMPARE1_Pos ) /*!< Bit mask of COMPARE1 field. */
#define RTC_INTENCLR_COMPARE1_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENCLR_COMPARE1_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENCLR_COMPARE1_Clear       ( 1UL )                                /*!< Disable */

/* Bit 16 : Write '1' to disable interrupt for event COMPARE[0] */
#define RTC_INTENCLR_COMPARE0_Pos         ( 16UL )                               /*!< Position of COMPARE0 field. */
#define RTC_INTENCLR_COMPARE0_Msk         ( 0x1UL << RTC_INTENCLR_COMPARE0_Pos ) /*!< Bit mask of COMPARE0 field. */
#define RTC_INTENCLR_COMPARE0_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_INTENCLR_COMPARE0_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_INTENCLR_COMPARE0_Clear       ( 1UL )                                /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event OVRFLW */
#define RTC_INTENCLR_OVRFLW_Pos           ( 1UL )                              /*!< Position of OVRFLW field. */
#define RTC_INTENCLR_OVRFLW_Msk           ( 0x1UL << RTC_INTENCLR_OVRFLW_Pos ) /*!< Bit mask of OVRFLW field. */
#define RTC_INTENCLR_OVRFLW_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define RTC_INTENCLR_OVRFLW_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define RTC_INTENCLR_OVRFLW_Clear         ( 1UL )                              /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event TICK */
#define RTC_INTENCLR_TICK_Pos             ( 0UL )                            /*!< Position of TICK field. */
#define RTC_INTENCLR_TICK_Msk             ( 0x1UL << RTC_INTENCLR_TICK_Pos ) /*!< Bit mask of TICK field. */
#define RTC_INTENCLR_TICK_Disabled        ( 0UL )                            /*!< Read: Disabled */
#define RTC_INTENCLR_TICK_Enabled         ( 1UL )                            /*!< Read: Enabled */
#define RTC_INTENCLR_TICK_Clear           ( 1UL )                            /*!< Disable */

/* Register: RTC_EVTEN */
/* Description: Enable or disable event routing */

/* Bit 19 : Enable or disable event routing for event COMPARE[3] */
#define RTC_EVTEN_COMPARE3_Pos         ( 19UL )                            /*!< Position of COMPARE3 field. */
#define RTC_EVTEN_COMPARE3_Msk         ( 0x1UL << RTC_EVTEN_COMPARE3_Pos ) /*!< Bit mask of COMPARE3 field. */
#define RTC_EVTEN_COMPARE3_Disabled    ( 0UL )                             /*!< Disable */
#define RTC_EVTEN_COMPARE3_Enabled     ( 1UL )                             /*!< Disable */

/* Bit 18 : Enable or disable event routing for event COMPARE[2] */
#define RTC_EVTEN_COMPARE2_Pos         ( 18UL )                            /*!< Position of COMPARE2 field. */
#define RTC_EVTEN_COMPARE2_Msk         ( 0x1UL << RTC_EVTEN_COMPARE2_Pos ) /*!< Bit mask of COMPARE2 field. */
#define RTC_EVTEN_COMPARE2_Disabled    ( 0UL )                             /*!< Disable */
#define RTC_EVTEN_COMPARE2_Enabled     ( 1UL )                             /*!< Disable */

/* Bit 17 : Enable or disable event routing for event COMPARE[1] */
#define RTC_EVTEN_COMPARE1_Pos         ( 17UL )                            /*!< Position of COMPARE1 field. */
#define RTC_EVTEN_COMPARE1_Msk         ( 0x1UL << RTC_EVTEN_COMPARE1_Pos ) /*!< Bit mask of COMPARE1 field. */
#define RTC_EVTEN_COMPARE1_Disabled    ( 0UL )                             /*!< Disable */
#define RTC_EVTEN_COMPARE1_Enabled     ( 1UL )                             /*!< Disable */

/* Bit 16 : Enable or disable event routing for event COMPARE[0] */
#define RTC_EVTEN_COMPARE0_Pos         ( 16UL )                            /*!< Position of COMPARE0 field. */
#define RTC_EVTEN_COMPARE0_Msk         ( 0x1UL << RTC_EVTEN_COMPARE0_Pos ) /*!< Bit mask of COMPARE0 field. */
#define RTC_EVTEN_COMPARE0_Disabled    ( 0UL )                             /*!< Disable */
#define RTC_EVTEN_COMPARE0_Enabled     ( 1UL )                             /*!< Disable */

/* Bit 1 : Enable or disable event routing for event OVRFLW */
#define RTC_EVTEN_OVRFLW_Pos           ( 1UL )                           /*!< Position of OVRFLW field. */
#define RTC_EVTEN_OVRFLW_Msk           ( 0x1UL << RTC_EVTEN_OVRFLW_Pos ) /*!< Bit mask of OVRFLW field. */
#define RTC_EVTEN_OVRFLW_Disabled      ( 0UL )                           /*!< Disable */
#define RTC_EVTEN_OVRFLW_Enabled       ( 1UL )                           /*!< Disable */

/* Bit 0 : Enable or disable event routing for event TICK */
#define RTC_EVTEN_TICK_Pos             ( 0UL )                         /*!< Position of TICK field. */
#define RTC_EVTEN_TICK_Msk             ( 0x1UL << RTC_EVTEN_TICK_Pos ) /*!< Bit mask of TICK field. */
#define RTC_EVTEN_TICK_Disabled        ( 0UL )                         /*!< Disable */
#define RTC_EVTEN_TICK_Enabled         ( 1UL )                         /*!< Disable */

/* Register: RTC_EVTENSET */
/* Description: Enable event routing */

/* Bit 19 : Write '1' to enable event routing for event COMPARE[3] */
#define RTC_EVTENSET_COMPARE3_Pos         ( 19UL )                               /*!< Position of COMPARE3 field. */
#define RTC_EVTENSET_COMPARE3_Msk         ( 0x1UL << RTC_EVTENSET_COMPARE3_Pos ) /*!< Bit mask of COMPARE3 field. */
#define RTC_EVTENSET_COMPARE3_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_EVTENSET_COMPARE3_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_EVTENSET_COMPARE3_Set         ( 1UL )                                /*!< Enable */

