FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: SAADC_EVENTS_CH_LIMITH */
/* Description: Description cluster: Last results is equal or above CH[n].LIMIT.HIGH */

/* Bit 0 : Last results is equal or above CH[n].LIMIT.HIGH */
#define SAADC_EVENTS_CH_LIMITH_LIMITH_Pos             ( 0UL )                                        /*!< Position of LIMITH field. */
#define SAADC_EVENTS_CH_LIMITH_LIMITH_Msk             ( 0x1UL << SAADC_EVENTS_CH_LIMITH_LIMITH_Pos ) /*!< Bit mask of LIMITH field. */
#define SAADC_EVENTS_CH_LIMITH_LIMITH_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define SAADC_EVENTS_CH_LIMITH_LIMITH_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: SAADC_EVENTS_CH_LIMITL */
/* Description: Description cluster: Last results is equal or below CH[n].LIMIT.LOW */

/* Bit 0 : Last results is equal or below CH[n].LIMIT.LOW */
#define SAADC_EVENTS_CH_LIMITL_LIMITL_Pos             ( 0UL )                                        /*!< Position of LIMITL field. */
#define SAADC_EVENTS_CH_LIMITL_LIMITL_Msk             ( 0x1UL << SAADC_EVENTS_CH_LIMITL_LIMITL_Pos ) /*!< Bit mask of LIMITL field. */
#define SAADC_EVENTS_CH_LIMITL_LIMITL_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define SAADC_EVENTS_CH_LIMITL_LIMITL_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: SAADC_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 21 : Enable or disable interrupt for event CH7LIMITL */
#define SAADC_INTEN_CH7LIMITL_Pos             ( 21UL )                               /*!< Position of CH7LIMITL field. */
#define SAADC_INTEN_CH7LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH7LIMITL_Pos ) /*!< Bit mask of CH7LIMITL field. */
#define SAADC_INTEN_CH7LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH7LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 20 : Enable or disable interrupt for event CH7LIMITH */
#define SAADC_INTEN_CH7LIMITH_Pos             ( 20UL )                               /*!< Position of CH7LIMITH field. */
#define SAADC_INTEN_CH7LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH7LIMITH_Pos ) /*!< Bit mask of CH7LIMITH field. */
#define SAADC_INTEN_CH7LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH7LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 19 : Enable or disable interrupt for event CH6LIMITL */
#define SAADC_INTEN_CH6LIMITL_Pos             ( 19UL )                               /*!< Position of CH6LIMITL field. */
#define SAADC_INTEN_CH6LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH6LIMITL_Pos ) /*!< Bit mask of CH6LIMITL field. */
#define SAADC_INTEN_CH6LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH6LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 18 : Enable or disable interrupt for event CH6LIMITH */
#define SAADC_INTEN_CH6LIMITH_Pos             ( 18UL )                               /*!< Position of CH6LIMITH field. */
#define SAADC_INTEN_CH6LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH6LIMITH_Pos ) /*!< Bit mask of CH6LIMITH field. */
#define SAADC_INTEN_CH6LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH6LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 17 : Enable or disable interrupt for event CH5LIMITL */
#define SAADC_INTEN_CH5LIMITL_Pos             ( 17UL )                               /*!< Position of CH5LIMITL field. */
#define SAADC_INTEN_CH5LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH5LIMITL_Pos ) /*!< Bit mask of CH5LIMITL field. */
#define SAADC_INTEN_CH5LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH5LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 16 : Enable or disable interrupt for event CH5LIMITH */
#define SAADC_INTEN_CH5LIMITH_Pos             ( 16UL )                               /*!< Position of CH5LIMITH field. */
#define SAADC_INTEN_CH5LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH5LIMITH_Pos ) /*!< Bit mask of CH5LIMITH field. */
#define SAADC_INTEN_CH5LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH5LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 15 : Enable or disable interrupt for event CH4LIMITL */
#define SAADC_INTEN_CH4LIMITL_Pos             ( 15UL )                               /*!< Position of CH4LIMITL field. */
#define SAADC_INTEN_CH4LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH4LIMITL_Pos ) /*!< Bit mask of CH4LIMITL field. */
#define SAADC_INTEN_CH4LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH4LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 14 : Enable or disable interrupt for event CH4LIMITH */
#define SAADC_INTEN_CH4LIMITH_Pos             ( 14UL )                               /*!< Position of CH4LIMITH field. */
#define SAADC_INTEN_CH4LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH4LIMITH_Pos ) /*!< Bit mask of CH4LIMITH field. */
#define SAADC_INTEN_CH4LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH4LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 13 : Enable or disable interrupt for event CH3LIMITL */
#define SAADC_INTEN_CH3LIMITL_Pos             ( 13UL )                               /*!< Position of CH3LIMITL field. */
#define SAADC_INTEN_CH3LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH3LIMITL_Pos ) /*!< Bit mask of CH3LIMITL field. */
#define SAADC_INTEN_CH3LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH3LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 12 : Enable or disable interrupt for event CH3LIMITH */
#define SAADC_INTEN_CH3LIMITH_Pos             ( 12UL )                               /*!< Position of CH3LIMITH field. */
#define SAADC_INTEN_CH3LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH3LIMITH_Pos ) /*!< Bit mask of CH3LIMITH field. */
#define SAADC_INTEN_CH3LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH3LIMITH_Enabled         ( 1UL )                                /*!< Enable */

