FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 11 : Enable or disable interrupt for event CH2LIMITL */
#define SAADC_INTEN_CH2LIMITL_Pos             ( 11UL )                               /*!< Position of CH2LIMITL field. */
#define SAADC_INTEN_CH2LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH2LIMITL_Pos ) /*!< Bit mask of CH2LIMITL field. */
#define SAADC_INTEN_CH2LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH2LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 10 : Enable or disable interrupt for event CH2LIMITH */
#define SAADC_INTEN_CH2LIMITH_Pos             ( 10UL )                               /*!< Position of CH2LIMITH field. */
#define SAADC_INTEN_CH2LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH2LIMITH_Pos ) /*!< Bit mask of CH2LIMITH field. */
#define SAADC_INTEN_CH2LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH2LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event CH1LIMITL */
#define SAADC_INTEN_CH1LIMITL_Pos             ( 9UL )                                /*!< Position of CH1LIMITL field. */
#define SAADC_INTEN_CH1LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH1LIMITL_Pos ) /*!< Bit mask of CH1LIMITL field. */
#define SAADC_INTEN_CH1LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH1LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 8 : Enable or disable interrupt for event CH1LIMITH */
#define SAADC_INTEN_CH1LIMITH_Pos             ( 8UL )                                /*!< Position of CH1LIMITH field. */
#define SAADC_INTEN_CH1LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH1LIMITH_Pos ) /*!< Bit mask of CH1LIMITH field. */
#define SAADC_INTEN_CH1LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH1LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event CH0LIMITL */
#define SAADC_INTEN_CH0LIMITL_Pos             ( 7UL )                                /*!< Position of CH0LIMITL field. */
#define SAADC_INTEN_CH0LIMITL_Msk             ( 0x1UL << SAADC_INTEN_CH0LIMITL_Pos ) /*!< Bit mask of CH0LIMITL field. */
#define SAADC_INTEN_CH0LIMITL_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH0LIMITL_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event CH0LIMITH */
#define SAADC_INTEN_CH0LIMITH_Pos             ( 6UL )                                /*!< Position of CH0LIMITH field. */
#define SAADC_INTEN_CH0LIMITH_Msk             ( 0x1UL << SAADC_INTEN_CH0LIMITH_Pos ) /*!< Bit mask of CH0LIMITH field. */
#define SAADC_INTEN_CH0LIMITH_Disabled        ( 0UL )                                /*!< Disable */
#define SAADC_INTEN_CH0LIMITH_Enabled         ( 1UL )                                /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event STOPPED */
#define SAADC_INTEN_STOPPED_Pos               ( 5UL )                              /*!< Position of STOPPED field. */
#define SAADC_INTEN_STOPPED_Msk               ( 0x1UL << SAADC_INTEN_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define SAADC_INTEN_STOPPED_Disabled          ( 0UL )                              /*!< Disable */
#define SAADC_INTEN_STOPPED_Enabled           ( 1UL )                              /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event CALIBRATEDONE */
#define SAADC_INTEN_CALIBRATEDONE_Pos         ( 4UL )                                    /*!< Position of CALIBRATEDONE field. */
#define SAADC_INTEN_CALIBRATEDONE_Msk         ( 0x1UL << SAADC_INTEN_CALIBRATEDONE_Pos ) /*!< Bit mask of CALIBRATEDONE field. */
#define SAADC_INTEN_CALIBRATEDONE_Disabled    ( 0UL )                                    /*!< Disable */
#define SAADC_INTEN_CALIBRATEDONE_Enabled     ( 1UL )                                    /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event RESULTDONE */
#define SAADC_INTEN_RESULTDONE_Pos            ( 3UL )                                 /*!< Position of RESULTDONE field. */
#define SAADC_INTEN_RESULTDONE_Msk            ( 0x1UL << SAADC_INTEN_RESULTDONE_Pos ) /*!< Bit mask of RESULTDONE field. */
#define SAADC_INTEN_RESULTDONE_Disabled       ( 0UL )                                 /*!< Disable */
#define SAADC_INTEN_RESULTDONE_Enabled        ( 1UL )                                 /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event DONE */
#define SAADC_INTEN_DONE_Pos                  ( 2UL )                           /*!< Position of DONE field. */
#define SAADC_INTEN_DONE_Msk                  ( 0x1UL << SAADC_INTEN_DONE_Pos ) /*!< Bit mask of DONE field. */
#define SAADC_INTEN_DONE_Disabled             ( 0UL )                           /*!< Disable */
#define SAADC_INTEN_DONE_Enabled              ( 1UL )                           /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event END */
#define SAADC_INTEN_END_Pos                   ( 1UL )                          /*!< Position of END field. */
#define SAADC_INTEN_END_Msk                   ( 0x1UL << SAADC_INTEN_END_Pos ) /*!< Bit mask of END field. */
#define SAADC_INTEN_END_Disabled              ( 0UL )                          /*!< Disable */
#define SAADC_INTEN_END_Enabled               ( 1UL )                          /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event STARTED */
#define SAADC_INTEN_STARTED_Pos               ( 0UL )                              /*!< Position of STARTED field. */
#define SAADC_INTEN_STARTED_Msk               ( 0x1UL << SAADC_INTEN_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define SAADC_INTEN_STARTED_Disabled          ( 0UL )                              /*!< Disable */
#define SAADC_INTEN_STARTED_Enabled           ( 1UL )                              /*!< Enable */

/* Register: SAADC_INTENSET */
/* Description: Enable interrupt */

/* Bit 21 : Write '1' to enable interrupt for event CH7LIMITL */
#define SAADC_INTENSET_CH7LIMITL_Pos             ( 21UL )                                  /*!< Position of CH7LIMITL field. */
#define SAADC_INTENSET_CH7LIMITL_Msk             ( 0x1UL << SAADC_INTENSET_CH7LIMITL_Pos ) /*!< Bit mask of CH7LIMITL field. */
#define SAADC_INTENSET_CH7LIMITL_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH7LIMITL_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH7LIMITL_Set             ( 1UL )                                   /*!< Enable */

/* Bit 20 : Write '1' to enable interrupt for event CH7LIMITH */
#define SAADC_INTENSET_CH7LIMITH_Pos             ( 20UL )                                  /*!< Position of CH7LIMITH field. */
#define SAADC_INTENSET_CH7LIMITH_Msk             ( 0x1UL << SAADC_INTENSET_CH7LIMITH_Pos ) /*!< Bit mask of CH7LIMITH field. */
#define SAADC_INTENSET_CH7LIMITH_Disabled        ( 0UL )                                   /*!< Read: Disabled */
#define SAADC_INTENSET_CH7LIMITH_Enabled         ( 1UL )                                   /*!< Read: Enabled */
#define SAADC_INTENSET_CH7LIMITH_Set             ( 1UL )                                   /*!< Enable */

