FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: SAADC_STATUS */
/* Description: Status */

/* Bit 0 : Status */
#define SAADC_STATUS_STATUS_Pos      ( 0UL )                              /*!< Position of STATUS field. */
#define SAADC_STATUS_STATUS_Msk      ( 0x1UL << SAADC_STATUS_STATUS_Pos ) /*!< Bit mask of STATUS field. */
#define SAADC_STATUS_STATUS_Ready    ( 0UL )                              /*!< ADC is ready. No on-going conversion. */
#define SAADC_STATUS_STATUS_Busy     ( 1UL )                              /*!< ADC is busy. Conversion in progress. */

/* Register: SAADC_ENABLE */
/* Description: Enable or disable ADC */

/* Bit 0 : Enable or disable ADC */
#define SAADC_ENABLE_ENABLE_Pos         ( 0UL )                              /*!< Position of ENABLE field. */
#define SAADC_ENABLE_ENABLE_Msk         ( 0x1UL << SAADC_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define SAADC_ENABLE_ENABLE_Disabled    ( 0UL )                              /*!< Disable ADC */
#define SAADC_ENABLE_ENABLE_Enabled     ( 1UL )                              /*!< Enable ADC */

/* Register: SAADC_CH_PSELP */
/* Description: Description cluster: Input positive pin selection for CH[n] */

/* Bits 4..0 : Analog positive input channel */
#define SAADC_CH_PSELP_PSELP_Pos             ( 0UL )                                /*!< Position of PSELP field. */
#define SAADC_CH_PSELP_PSELP_Msk             ( 0x1FUL << SAADC_CH_PSELP_PSELP_Pos ) /*!< Bit mask of PSELP field. */
#define SAADC_CH_PSELP_PSELP_NC              ( 0UL )                                /*!< Not connected */
#define SAADC_CH_PSELP_PSELP_AnalogInput0    ( 1UL )                                /*!< AIN0 */
#define SAADC_CH_PSELP_PSELP_AnalogInput1    ( 2UL )                                /*!< AIN1 */
#define SAADC_CH_PSELP_PSELP_AnalogInput2    ( 3UL )                                /*!< AIN2 */
#define SAADC_CH_PSELP_PSELP_AnalogInput3    ( 4UL )                                /*!< AIN3 */
#define SAADC_CH_PSELP_PSELP_AnalogInput4    ( 5UL )                                /*!< AIN4 */
#define SAADC_CH_PSELP_PSELP_AnalogInput5    ( 6UL )                                /*!< AIN5 */
#define SAADC_CH_PSELP_PSELP_AnalogInput6    ( 7UL )                                /*!< AIN6 */
#define SAADC_CH_PSELP_PSELP_AnalogInput7    ( 8UL )                                /*!< AIN7 */
#define SAADC_CH_PSELP_PSELP_VDD             ( 9UL )                                /*!< VDD */

/* Register: SAADC_CH_PSELN */
/* Description: Description cluster: Input negative pin selection for CH[n] */

/* Bits 4..0 : Analog negative input, enables differential channel */
#define SAADC_CH_PSELN_PSELN_Pos             ( 0UL )                                /*!< Position of PSELN field. */
#define SAADC_CH_PSELN_PSELN_Msk             ( 0x1FUL << SAADC_CH_PSELN_PSELN_Pos ) /*!< Bit mask of PSELN field. */
#define SAADC_CH_PSELN_PSELN_NC              ( 0UL )                                /*!< Not connected */
#define SAADC_CH_PSELN_PSELN_AnalogInput0    ( 1UL )                                /*!< AIN0 */
#define SAADC_CH_PSELN_PSELN_AnalogInput1    ( 2UL )                                /*!< AIN1 */
#define SAADC_CH_PSELN_PSELN_AnalogInput2    ( 3UL )                                /*!< AIN2 */
#define SAADC_CH_PSELN_PSELN_AnalogInput3    ( 4UL )                                /*!< AIN3 */
#define SAADC_CH_PSELN_PSELN_AnalogInput4    ( 5UL )                                /*!< AIN4 */
#define SAADC_CH_PSELN_PSELN_AnalogInput5    ( 6UL )                                /*!< AIN5 */
#define SAADC_CH_PSELN_PSELN_AnalogInput6    ( 7UL )                                /*!< AIN6 */
#define SAADC_CH_PSELN_PSELN_AnalogInput7    ( 8UL )                                /*!< AIN7 */
#define SAADC_CH_PSELN_PSELN_VDD             ( 9UL )                                /*!< VDD */

/* Register: SAADC_CH_CONFIG */
/* Description: Description cluster: Input configuration for CH[n] */

/* Bit 24 : Enable burst mode */
#define SAADC_CH_CONFIG_BURST_Pos          ( 24UL )                               /*!< Position of BURST field. */
#define SAADC_CH_CONFIG_BURST_Msk          ( 0x1UL << SAADC_CH_CONFIG_BURST_Pos ) /*!< Bit mask of BURST field. */
#define SAADC_CH_CONFIG_BURST_Disabled     ( 0UL )                                /*!< Burst mode is disabled (normal operation) */
#define SAADC_CH_CONFIG_BURST_Enabled      ( 1UL )                                /*!< Burst mode is enabled. SAADC takes 2^OVERSAMPLE number of samples as fast as it can, and sends the average to Data RAM. */

/* Bit 20 : Enable differential mode */
#define SAADC_CH_CONFIG_MODE_Pos           ( 20UL )                              /*!< Position of MODE field. */
#define SAADC_CH_CONFIG_MODE_Msk           ( 0x1UL << SAADC_CH_CONFIG_MODE_Pos ) /*!< Bit mask of MODE field. */
#define SAADC_CH_CONFIG_MODE_SE            ( 0UL )                               /*!< Single ended, PSELN will be ignored, negative input to ADC shorted to GND */
#define SAADC_CH_CONFIG_MODE_Diff          ( 1UL )                               /*!< Differential */

/* Bits 18..16 : Acquisition time, the time the ADC uses to sample the input voltage */
#define SAADC_CH_CONFIG_TACQ_Pos           ( 16UL )                              /*!< Position of TACQ field. */
#define SAADC_CH_CONFIG_TACQ_Msk           ( 0x7UL << SAADC_CH_CONFIG_TACQ_Pos ) /*!< Bit mask of TACQ field. */
#define SAADC_CH_CONFIG_TACQ_3us           ( 0UL )                               /*!< 3 us */
#define SAADC_CH_CONFIG_TACQ_5us           ( 1UL )                               /*!< 5 us */
#define SAADC_CH_CONFIG_TACQ_10us          ( 2UL )                               /*!< 10 us */
#define SAADC_CH_CONFIG_TACQ_15us          ( 3UL )                               /*!< 15 us */
#define SAADC_CH_CONFIG_TACQ_20us          ( 4UL )                               /*!< 20 us */
#define SAADC_CH_CONFIG_TACQ_40us          ( 5UL )                               /*!< 40 us */

/* Bit 12 : Reference control */
#define SAADC_CH_CONFIG_REFSEL_Pos         ( 12UL )                                /*!< Position of REFSEL field. */
#define SAADC_CH_CONFIG_REFSEL_Msk         ( 0x1UL << SAADC_CH_CONFIG_REFSEL_Pos ) /*!< Bit mask of REFSEL field. */
#define SAADC_CH_CONFIG_REFSEL_Internal    ( 0UL )                                 /*!< Internal reference (0.6 V) */
#define SAADC_CH_CONFIG_REFSEL_VDD1_4      ( 1UL )                                 /*!< VDD/4 as reference */

/* Bits 10..8 : Gain control */
#define SAADC_CH_CONFIG_GAIN_Pos           ( 8UL )                               /*!< Position of GAIN field. */
#define SAADC_CH_CONFIG_GAIN_Msk           ( 0x7UL << SAADC_CH_CONFIG_GAIN_Pos ) /*!< Bit mask of GAIN field. */
#define SAADC_CH_CONFIG_GAIN_Gain1_6       ( 0UL )                               /*!< 1/6 */
#define SAADC_CH_CONFIG_GAIN_Gain1_5       ( 1UL )                               /*!< 1/5 */
#define SAADC_CH_CONFIG_GAIN_Gain1_4       ( 2UL )                               /*!< 1/4 */
#define SAADC_CH_CONFIG_GAIN_Gain1_3       ( 3UL )                               /*!< 1/3 */
#define SAADC_CH_CONFIG_GAIN_Gain1_2       ( 4UL )                               /*!< 1/2 */
#define SAADC_CH_CONFIG_GAIN_Gain1         ( 5UL )                               /*!< 1 */
#define SAADC_CH_CONFIG_GAIN_Gain2         ( 6UL )                               /*!< 2 */
#define SAADC_CH_CONFIG_GAIN_Gain4         ( 7UL )                               /*!< 4 */

