FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: SPI_EVENTS_READY */
/* Description: TXD byte sent and RXD byte received */

/* Bit 0 : TXD byte sent and RXD byte received */
#define SPI_EVENTS_READY_EVENTS_READY_Pos             ( 0UL )                                        /*!< Position of EVENTS_READY field. */
#define SPI_EVENTS_READY_EVENTS_READY_Msk             ( 0x1UL << SPI_EVENTS_READY_EVENTS_READY_Pos ) /*!< Bit mask of EVENTS_READY field. */
#define SPI_EVENTS_READY_EVENTS_READY_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define SPI_EVENTS_READY_EVENTS_READY_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: SPI_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Write '1' to enable interrupt for event READY */
#define SPI_INTENSET_READY_Pos         ( 2UL )                             /*!< Position of READY field. */
#define SPI_INTENSET_READY_Msk         ( 0x1UL << SPI_INTENSET_READY_Pos ) /*!< Bit mask of READY field. */
#define SPI_INTENSET_READY_Disabled    ( 0UL )                             /*!< Read: Disabled */
#define SPI_INTENSET_READY_Enabled     ( 1UL )                             /*!< Read: Enabled */
#define SPI_INTENSET_READY_Set         ( 1UL )                             /*!< Enable */

/* Register: SPI_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Write '1' to disable interrupt for event READY */
#define SPI_INTENCLR_READY_Pos         ( 2UL )                             /*!< Position of READY field. */
#define SPI_INTENCLR_READY_Msk         ( 0x1UL << SPI_INTENCLR_READY_Pos ) /*!< Bit mask of READY field. */
#define SPI_INTENCLR_READY_Disabled    ( 0UL )                             /*!< Read: Disabled */
#define SPI_INTENCLR_READY_Enabled     ( 1UL )                             /*!< Read: Enabled */
#define SPI_INTENCLR_READY_Clear       ( 1UL )                             /*!< Disable */

/* Register: SPI_ENABLE */
/* Description: Enable SPI */

/* Bits 3..0 : Enable or disable SPI */
#define SPI_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define SPI_ENABLE_ENABLE_Msk         ( 0xFUL << SPI_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define SPI_ENABLE_ENABLE_Disabled    ( 0UL )                            /*!< Disable SPI */
#define SPI_ENABLE_ENABLE_Enabled     ( 1UL )                            /*!< Enable SPI */

/* Register: SPI_PSEL_SCK */
/* Description: Pin select for SCK */

/* Bit 31 : Connection */
#define SPI_PSEL_SCK_CONNECT_Pos             ( 31UL )                              /*!< Position of CONNECT field. */
#define SPI_PSEL_SCK_CONNECT_Msk             ( 0x1UL << SPI_PSEL_SCK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPI_PSEL_SCK_CONNECT_Connected       ( 0UL )                               /*!< Connect */
#define SPI_PSEL_SCK_CONNECT_Disconnected    ( 1UL )                               /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPI_PSEL_SCK_PIN_Pos                 ( 0UL )                            /*!< Position of PIN field. */
#define SPI_PSEL_SCK_PIN_Msk                 ( 0x1FUL << SPI_PSEL_SCK_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPI_PSEL_MOSI */
/* Description: Pin select for MOSI signal */

/* Bit 31 : Connection */
#define SPI_PSEL_MOSI_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define SPI_PSEL_MOSI_CONNECT_Msk             ( 0x1UL << SPI_PSEL_MOSI_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPI_PSEL_MOSI_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define SPI_PSEL_MOSI_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPI_PSEL_MOSI_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define SPI_PSEL_MOSI_PIN_Msk                 ( 0x1FUL << SPI_PSEL_MOSI_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPI_PSEL_MISO */
/* Description: Pin select for MISO signal */

/* Bit 31 : Connection */
#define SPI_PSEL_MISO_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define SPI_PSEL_MISO_CONNECT_Msk             ( 0x1UL << SPI_PSEL_MISO_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPI_PSEL_MISO_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define SPI_PSEL_MISO_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPI_PSEL_MISO_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define SPI_PSEL_MISO_PIN_Msk                 ( 0x1FUL << SPI_PSEL_MISO_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPI_RXD */
/* Description: RXD register */

/* Bits 7..0 : RX data received. Double buffered */
#define SPI_RXD_RXD_Pos    ( 0UL )                       /*!< Position of RXD field. */
#define SPI_RXD_RXD_Msk    ( 0xFFUL << SPI_RXD_RXD_Pos ) /*!< Bit mask of RXD field. */

/* Register: SPI_TXD */
/* Description: TXD register */

/* Bits 7..0 : TX data to send. Double buffered. */
#define SPI_TXD_TXD_Pos    ( 0UL )                       /*!< Position of TXD field. */
#define SPI_TXD_TXD_Msk    ( 0xFFUL << SPI_TXD_TXD_Pos ) /*!< Bit mask of TXD field. */

/* Register: SPI_FREQUENCY */
/* Description: SPI frequency. Accuracy depends on the HFCLK source selected. */

/* Bits 31..0 : SPI master data rate */
#define SPI_FREQUENCY_FREQUENCY_Pos     ( 0UL )                                         /*!< Position of FREQUENCY field. */
#define SPI_FREQUENCY_FREQUENCY_Msk     ( 0xFFFFFFFFUL << SPI_FREQUENCY_FREQUENCY_Pos ) /*!< Bit mask of FREQUENCY field. */
#define SPI_FREQUENCY_FREQUENCY_K125    ( 0x02000000UL )                                /*!< 125 kbps */
#define SPI_FREQUENCY_FREQUENCY_K250    ( 0x04000000UL )                                /*!< 250 kbps */
#define SPI_FREQUENCY_FREQUENCY_K500    ( 0x08000000UL )                                /*!< 500 kbps */
#define SPI_FREQUENCY_FREQUENCY_M1      ( 0x10000000UL )                                /*!< 1 Mbps */
#define SPI_FREQUENCY_FREQUENCY_M2      ( 0x20000000UL )                                /*!< 2 Mbps */
#define SPI_FREQUENCY_FREQUENCY_M4      ( 0x40000000UL )                                /*!< 4 Mbps */
#define SPI_FREQUENCY_FREQUENCY_M8      ( 0x80000000UL )                                /*!< 8 Mbps */

/* Register: SPI_CONFIG */
/* Description: Configuration register */

/* Bit 2 : Serial clock (SCK) polarity */
#define SPI_CONFIG_CPOL_Pos           ( 2UL )                          /*!< Position of CPOL field. */
#define SPI_CONFIG_CPOL_Msk           ( 0x1UL << SPI_CONFIG_CPOL_Pos ) /*!< Bit mask of CPOL field. */
#define SPI_CONFIG_CPOL_ActiveHigh    ( 0UL )                          /*!< Active high */
#define SPI_CONFIG_CPOL_ActiveLow     ( 1UL )                          /*!< Active low */

/* Bit 1 : Serial clock (SCK) phase */
#define SPI_CONFIG_CPHA_Pos           ( 1UL )                          /*!< Position of CPHA field. */
#define SPI_CONFIG_CPHA_Msk           ( 0x1UL << SPI_CONFIG_CPHA_Pos ) /*!< Bit mask of CPHA field. */
#define SPI_CONFIG_CPHA_Leading       ( 0UL )                          /*!< Sample on leading edge of clock, shift serial data on trailing edge */
#define SPI_CONFIG_CPHA_Trailing      ( 1UL )                          /*!< Sample on trailing edge of clock, shift serial data on leading edge */

/* Bit 0 : Bit order */
#define SPI_CONFIG_ORDER_Pos          ( 0UL )                           /*!< Position of ORDER field. */
#define SPI_CONFIG_ORDER_Msk          ( 0x1UL << SPI_CONFIG_ORDER_Pos ) /*!< Bit mask of ORDER field. */
#define SPI_CONFIG_ORDER_MsbFirst     ( 0UL )                           /*!< Most significant bit shifted out first */
#define SPI_CONFIG_ORDER_LsbFirst     ( 1UL )                           /*!< Least significant bit shifted out first */


/* Peripheral: SPIM */
/* Description: Serial Peripheral Interface Master with EasyDMA */

/* Register: SPIM_TASKS_START */
/* Description: Start SPI transaction */

/* Bit 0 : Start SPI transaction */
#define SPIM_TASKS_START_TASKS_START_Pos        ( 0UL )                                       /*!< Position of TASKS_START field. */
#define SPIM_TASKS_START_TASKS_START_Msk        ( 0x1UL << SPIM_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define SPIM_TASKS_START_TASKS_START_Trigger    ( 1UL )                                       /*!< Trigger task */

/* Register: SPIM_TASKS_STOP */
/* Description: Stop SPI transaction */

/* Bit 0 : Stop SPI transaction */
#define SPIM_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define SPIM_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << SPIM_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define SPIM_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: SPIM_TASKS_SUSPEND */
/* Description: Suspend SPI transaction */

/* Bit 0 : Suspend SPI transaction */
#define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos        ( 0UL )                                           /*!< Position of TASKS_SUSPEND field. */
#define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Msk        ( 0x1UL << SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos ) /*!< Bit mask of TASKS_SUSPEND field. */
#define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: SPIM_TASKS_RESUME */
/* Description: Resume SPI transaction */

/* Bit 0 : Resume SPI transaction */
#define SPIM_TASKS_RESUME_TASKS_RESUME_Pos        ( 0UL )                                         /*!< Position of TASKS_RESUME field. */
#define SPIM_TASKS_RESUME_TASKS_RESUME_Msk        ( 0x1UL << SPIM_TASKS_RESUME_TASKS_RESUME_Pos ) /*!< Bit mask of TASKS_RESUME field. */
#define SPIM_TASKS_RESUME_TASKS_RESUME_Trigger    ( 1UL )                                         /*!< Trigger task */

/* Register: SPIM_EVENTS_STOPPED */
/* Description: SPI transaction has stopped */

/* Bit 0 : SPI transaction has stopped */
#define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                             /*!< Position of EVENTS_STOPPED field. */
#define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                             /*!< Event not generated */
#define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                             /*!< Event generated */

/* Register: SPIM_EVENTS_ENDRX */
/* Description: End of RXD buffer reached */

