FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 1 : Write '1' to disable interrupt for event STOPPED */
#define SPIM_INTENCLR_STOPPED_Pos         ( 1UL )                                /*!< Position of STOPPED field. */
#define SPIM_INTENCLR_STOPPED_Msk         ( 0x1UL << SPIM_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define SPIM_INTENCLR_STOPPED_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define SPIM_INTENCLR_STOPPED_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define SPIM_INTENCLR_STOPPED_Clear       ( 1UL )                                /*!< Disable */

/* Register: SPIM_ENABLE */
/* Description: Enable SPIM */

/* Bits 3..0 : Enable or disable SPIM */
#define SPIM_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define SPIM_ENABLE_ENABLE_Msk         ( 0xFUL << SPIM_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define SPIM_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< Disable SPIM */
#define SPIM_ENABLE_ENABLE_Enabled     ( 7UL )                             /*!< Enable SPIM */

/* Register: SPIM_PSEL_SCK */
/* Description: Pin select for SCK */

/* Bit 31 : Connection */
#define SPIM_PSEL_SCK_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define SPIM_PSEL_SCK_CONNECT_Msk             ( 0x1UL << SPIM_PSEL_SCK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIM_PSEL_SCK_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define SPIM_PSEL_SCK_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIM_PSEL_SCK_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define SPIM_PSEL_SCK_PIN_Msk                 ( 0x1FUL << SPIM_PSEL_SCK_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIM_PSEL_MOSI */
/* Description: Pin select for MOSI signal */

/* Bit 31 : Connection */
#define SPIM_PSEL_MOSI_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define SPIM_PSEL_MOSI_CONNECT_Msk             ( 0x1UL << SPIM_PSEL_MOSI_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIM_PSEL_MOSI_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define SPIM_PSEL_MOSI_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIM_PSEL_MOSI_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define SPIM_PSEL_MOSI_PIN_Msk                 ( 0x1FUL << SPIM_PSEL_MOSI_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIM_PSEL_MISO */
/* Description: Pin select for MISO signal */

/* Bit 31 : Connection */
#define SPIM_PSEL_MISO_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define SPIM_PSEL_MISO_CONNECT_Msk             ( 0x1UL << SPIM_PSEL_MISO_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIM_PSEL_MISO_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define SPIM_PSEL_MISO_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIM_PSEL_MISO_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define SPIM_PSEL_MISO_PIN_Msk                 ( 0x1FUL << SPIM_PSEL_MISO_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIM_FREQUENCY */
/* Description: SPI frequency. Accuracy depends on the HFCLK source selected. */

/* Bits 31..0 : SPI master data rate */
#define SPIM_FREQUENCY_FREQUENCY_Pos     ( 0UL )                                          /*!< Position of FREQUENCY field. */
#define SPIM_FREQUENCY_FREQUENCY_Msk     ( 0xFFFFFFFFUL << SPIM_FREQUENCY_FREQUENCY_Pos ) /*!< Bit mask of FREQUENCY field. */
#define SPIM_FREQUENCY_FREQUENCY_K125    ( 0x02000000UL )                                 /*!< 125 kbps */
#define SPIM_FREQUENCY_FREQUENCY_K250    ( 0x04000000UL )                                 /*!< 250 kbps */
#define SPIM_FREQUENCY_FREQUENCY_K500    ( 0x08000000UL )                                 /*!< 500 kbps */
#define SPIM_FREQUENCY_FREQUENCY_M1      ( 0x10000000UL )                                 /*!< 1 Mbps */
#define SPIM_FREQUENCY_FREQUENCY_M2      ( 0x20000000UL )                                 /*!< 2 Mbps */
#define SPIM_FREQUENCY_FREQUENCY_M4      ( 0x40000000UL )                                 /*!< 4 Mbps */
#define SPIM_FREQUENCY_FREQUENCY_M8      ( 0x80000000UL )                                 /*!< 8 Mbps */

/* Register: SPIM_RXD_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define SPIM_RXD_PTR_PTR_Pos    ( 0UL )                                  /*!< Position of PTR field. */
#define SPIM_RXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << SPIM_RXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: SPIM_RXD_MAXCNT */
/* Description: Maximum number of bytes in receive buffer */

/* Bits 13..0 : Maximum number of bytes in receive buffer */
#define SPIM_RXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define SPIM_RXD_MAXCNT_MAXCNT_Msk    ( 0x3FFFUL << SPIM_RXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: SPIM_RXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 13..0 : Number of bytes transferred in the last transaction */
#define SPIM_RXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                    /*!< Position of AMOUNT field. */
#define SPIM_RXD_AMOUNT_AMOUNT_Msk    ( 0x3FFFUL << SPIM_RXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: SPIM_RXD_LIST */
/* Description: EasyDMA list type */

/* Bits 1..0 : List type */
#define SPIM_RXD_LIST_LIST_Pos          ( 0UL )                             /*!< Position of LIST field. */
#define SPIM_RXD_LIST_LIST_Msk          ( 0x3UL << SPIM_RXD_LIST_LIST_Pos ) /*!< Bit mask of LIST field. */
#define SPIM_RXD_LIST_LIST_Disabled     ( 0UL )                             /*!< Disable EasyDMA list */
#define SPIM_RXD_LIST_LIST_ArrayList    ( 1UL )                             /*!< Use array list */

/* Register: SPIM_TXD_PTR */
/* Description: Data pointer */

