FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bits 31..0 : Data pointer */
#define SPIM_TXD_PTR_PTR_Pos    ( 0UL )                                  /*!< Position of PTR field. */
#define SPIM_TXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << SPIM_TXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: SPIM_TXD_MAXCNT */
/* Description: Maximum number of bytes in transmit buffer */

/* Bits 13..0 : Maximum number of bytes in transmit buffer */
#define SPIM_TXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define SPIM_TXD_MAXCNT_MAXCNT_Msk    ( 0x3FFFUL << SPIM_TXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: SPIM_TXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 13..0 : Number of bytes transferred in the last transaction */
#define SPIM_TXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                    /*!< Position of AMOUNT field. */
#define SPIM_TXD_AMOUNT_AMOUNT_Msk    ( 0x3FFFUL << SPIM_TXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: SPIM_TXD_LIST */
/* Description: EasyDMA list type */

/* Bits 1..0 : List type */
#define SPIM_TXD_LIST_LIST_Pos          ( 0UL )                             /*!< Position of LIST field. */
#define SPIM_TXD_LIST_LIST_Msk          ( 0x3UL << SPIM_TXD_LIST_LIST_Pos ) /*!< Bit mask of LIST field. */
#define SPIM_TXD_LIST_LIST_Disabled     ( 0UL )                             /*!< Disable EasyDMA list */
#define SPIM_TXD_LIST_LIST_ArrayList    ( 1UL )                             /*!< Use array list */

/* Register: SPIM_CONFIG */
/* Description: Configuration register */

/* Bit 2 : Serial clock (SCK) polarity */
#define SPIM_CONFIG_CPOL_Pos           ( 2UL )                           /*!< Position of CPOL field. */
#define SPIM_CONFIG_CPOL_Msk           ( 0x1UL << SPIM_CONFIG_CPOL_Pos ) /*!< Bit mask of CPOL field. */
#define SPIM_CONFIG_CPOL_ActiveHigh    ( 0UL )                           /*!< Active high */
#define SPIM_CONFIG_CPOL_ActiveLow     ( 1UL )                           /*!< Active low */

/* Bit 1 : Serial clock (SCK) phase */
#define SPIM_CONFIG_CPHA_Pos           ( 1UL )                           /*!< Position of CPHA field. */
#define SPIM_CONFIG_CPHA_Msk           ( 0x1UL << SPIM_CONFIG_CPHA_Pos ) /*!< Bit mask of CPHA field. */
#define SPIM_CONFIG_CPHA_Leading       ( 0UL )                           /*!< Sample on leading edge of clock, shift serial data on trailing edge */
#define SPIM_CONFIG_CPHA_Trailing      ( 1UL )                           /*!< Sample on trailing edge of clock, shift serial data on leading edge */

/* Bit 0 : Bit order */
#define SPIM_CONFIG_ORDER_Pos          ( 0UL )                            /*!< Position of ORDER field. */
#define SPIM_CONFIG_ORDER_Msk          ( 0x1UL << SPIM_CONFIG_ORDER_Pos ) /*!< Bit mask of ORDER field. */
#define SPIM_CONFIG_ORDER_MsbFirst     ( 0UL )                            /*!< Most significant bit shifted out first */
#define SPIM_CONFIG_ORDER_LsbFirst     ( 1UL )                            /*!< Least significant bit shifted out first */

/* Register: SPIM_ORC */
/* Description: Over-read character. Character clocked out in case and over-read of the TXD buffer. */

/* Bits 7..0 : Over-read character. Character clocked out in case and over-read of the TXD buffer. */
#define SPIM_ORC_ORC_Pos    ( 0UL )                        /*!< Position of ORC field. */
#define SPIM_ORC_ORC_Msk    ( 0xFFUL << SPIM_ORC_ORC_Pos ) /*!< Bit mask of ORC field. */


/* Peripheral: SPIS */
/* Description: SPI Slave */

/* Register: SPIS_TASKS_ACQUIRE */
/* Description: Acquire SPI semaphore */

/* Bit 0 : Acquire SPI semaphore */
#define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Pos        ( 0UL )                                           /*!< Position of TASKS_ACQUIRE field. */
#define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Msk        ( 0x1UL << SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Pos ) /*!< Bit mask of TASKS_ACQUIRE field. */
#define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: SPIS_TASKS_RELEASE */
/* Description: Release SPI semaphore, enabling the SPI slave to acquire it */

/* Bit 0 : Release SPI semaphore, enabling the SPI slave to acquire it */
#define SPIS_TASKS_RELEASE_TASKS_RELEASE_Pos        ( 0UL )                                           /*!< Position of TASKS_RELEASE field. */
#define SPIS_TASKS_RELEASE_TASKS_RELEASE_Msk        ( 0x1UL << SPIS_TASKS_RELEASE_TASKS_RELEASE_Pos ) /*!< Bit mask of TASKS_RELEASE field. */
#define SPIS_TASKS_RELEASE_TASKS_RELEASE_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: SPIS_EVENTS_END */
/* Description: Granted transaction completed */

/* Bit 0 : Granted transaction completed */
#define SPIS_EVENTS_END_EVENTS_END_Pos             ( 0UL )                                     /*!< Position of EVENTS_END field. */
#define SPIS_EVENTS_END_EVENTS_END_Msk             ( 0x1UL << SPIS_EVENTS_END_EVENTS_END_Pos ) /*!< Bit mask of EVENTS_END field. */
#define SPIS_EVENTS_END_EVENTS_END_NotGenerated    ( 0UL )                                     /*!< Event not generated */
#define SPIS_EVENTS_END_EVENTS_END_Generated       ( 1UL )                                     /*!< Event generated */

/* Register: SPIS_EVENTS_ENDRX */
/* Description: End of RXD buffer reached */

/* Bit 0 : End of RXD buffer reached */
#define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Pos             ( 0UL )                                         /*!< Position of EVENTS_ENDRX field. */
#define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Msk             ( 0x1UL << SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Pos ) /*!< Bit mask of EVENTS_ENDRX field. */
#define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define SPIS_EVENTS_ENDRX_EVENTS_ENDRX_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: SPIS_EVENTS_ACQUIRED */
/* Description: Semaphore acquired */

/* Bit 0 : Semaphore acquired */
#define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Pos             ( 0UL )                                               /*!< Position of EVENTS_ACQUIRED field. */
#define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Msk             ( 0x1UL << SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Pos ) /*!< Bit mask of EVENTS_ACQUIRED field. */
#define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_NotGenerated    ( 0UL )                                               /*!< Event not generated */
#define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Generated       ( 1UL )                                               /*!< Event generated */

/* Register: SPIS_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 2 : Shortcut between event END and task ACQUIRE */
#define SPIS_SHORTS_END_ACQUIRE_Pos         ( 2UL )                                  /*!< Position of END_ACQUIRE field. */
#define SPIS_SHORTS_END_ACQUIRE_Msk         ( 0x1UL << SPIS_SHORTS_END_ACQUIRE_Pos ) /*!< Bit mask of END_ACQUIRE field. */
#define SPIS_SHORTS_END_ACQUIRE_Disabled    ( 0UL )                                  /*!< Disable shortcut */
#define SPIS_SHORTS_END_ACQUIRE_Enabled     ( 1UL )                                  /*!< Enable shortcut */

/* Register: SPIS_INTENSET */
/* Description: Enable interrupt */

/* Bit 10 : Write '1' to enable interrupt for event ACQUIRED */
#define SPIS_INTENSET_ACQUIRED_Pos         ( 10UL )                                /*!< Position of ACQUIRED field. */
#define SPIS_INTENSET_ACQUIRED_Msk         ( 0x1UL << SPIS_INTENSET_ACQUIRED_Pos ) /*!< Bit mask of ACQUIRED field. */
#define SPIS_INTENSET_ACQUIRED_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define SPIS_INTENSET_ACQUIRED_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define SPIS_INTENSET_ACQUIRED_Set         ( 1UL )                                 /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event ENDRX */
#define SPIS_INTENSET_ENDRX_Pos            ( 4UL )                              /*!< Position of ENDRX field. */
#define SPIS_INTENSET_ENDRX_Msk            ( 0x1UL << SPIS_INTENSET_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define SPIS_INTENSET_ENDRX_Disabled       ( 0UL )                              /*!< Read: Disabled */
#define SPIS_INTENSET_ENDRX_Enabled        ( 1UL )                              /*!< Read: Enabled */
#define SPIS_INTENSET_ENDRX_Set            ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event END */
#define SPIS_INTENSET_END_Pos              ( 1UL )                            /*!< Position of END field. */
#define SPIS_INTENSET_END_Msk              ( 0x1UL << SPIS_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define SPIS_INTENSET_END_Disabled         ( 0UL )                            /*!< Read: Disabled */
#define SPIS_INTENSET_END_Enabled          ( 1UL )                            /*!< Read: Enabled */
#define SPIS_INTENSET_END_Set              ( 1UL )                            /*!< Enable */

