FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: SPIS_INTENCLR */
/* Description: Disable interrupt */

/* Bit 10 : Write '1' to disable interrupt for event ACQUIRED */
#define SPIS_INTENCLR_ACQUIRED_Pos         ( 10UL )                                /*!< Position of ACQUIRED field. */
#define SPIS_INTENCLR_ACQUIRED_Msk         ( 0x1UL << SPIS_INTENCLR_ACQUIRED_Pos ) /*!< Bit mask of ACQUIRED field. */
#define SPIS_INTENCLR_ACQUIRED_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define SPIS_INTENCLR_ACQUIRED_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define SPIS_INTENCLR_ACQUIRED_Clear       ( 1UL )                                 /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event ENDRX */
#define SPIS_INTENCLR_ENDRX_Pos            ( 4UL )                              /*!< Position of ENDRX field. */
#define SPIS_INTENCLR_ENDRX_Msk            ( 0x1UL << SPIS_INTENCLR_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define SPIS_INTENCLR_ENDRX_Disabled       ( 0UL )                              /*!< Read: Disabled */
#define SPIS_INTENCLR_ENDRX_Enabled        ( 1UL )                              /*!< Read: Enabled */
#define SPIS_INTENCLR_ENDRX_Clear          ( 1UL )                              /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event END */
#define SPIS_INTENCLR_END_Pos              ( 1UL )                            /*!< Position of END field. */
#define SPIS_INTENCLR_END_Msk              ( 0x1UL << SPIS_INTENCLR_END_Pos ) /*!< Bit mask of END field. */
#define SPIS_INTENCLR_END_Disabled         ( 0UL )                            /*!< Read: Disabled */
#define SPIS_INTENCLR_END_Enabled          ( 1UL )                            /*!< Read: Enabled */
#define SPIS_INTENCLR_END_Clear            ( 1UL )                            /*!< Disable */

/* Register: SPIS_SEMSTAT */
/* Description: Semaphore status register */

/* Bits 1..0 : Semaphore status */
#define SPIS_SEMSTAT_SEMSTAT_Pos           ( 0UL )                               /*!< Position of SEMSTAT field. */
#define SPIS_SEMSTAT_SEMSTAT_Msk           ( 0x3UL << SPIS_SEMSTAT_SEMSTAT_Pos ) /*!< Bit mask of SEMSTAT field. */
#define SPIS_SEMSTAT_SEMSTAT_Free          ( 0UL )                               /*!< Semaphore is free */
#define SPIS_SEMSTAT_SEMSTAT_CPU           ( 1UL )                               /*!< Semaphore is assigned to CPU */
#define SPIS_SEMSTAT_SEMSTAT_SPIS          ( 2UL )                               /*!< Semaphore is assigned to SPI slave */
#define SPIS_SEMSTAT_SEMSTAT_CPUPending    ( 3UL )                               /*!< Semaphore is assigned to SPI but a handover to the CPU is pending */

/* Register: SPIS_STATUS */
/* Description: Status from last transaction */

/* Bit 1 : RX buffer overflow detected, and prevented */
#define SPIS_STATUS_OVERFLOW_Pos           ( 1UL )                               /*!< Position of OVERFLOW field. */
#define SPIS_STATUS_OVERFLOW_Msk           ( 0x1UL << SPIS_STATUS_OVERFLOW_Pos ) /*!< Bit mask of OVERFLOW field. */
#define SPIS_STATUS_OVERFLOW_NotPresent    ( 0UL )                               /*!< Read: error not present */
#define SPIS_STATUS_OVERFLOW_Present       ( 1UL )                               /*!< Read: error present */
#define SPIS_STATUS_OVERFLOW_Clear         ( 1UL )                               /*!< Write: clear error on writing '1' */

/* Bit 0 : TX buffer over-read detected, and prevented */
#define SPIS_STATUS_OVERREAD_Pos           ( 0UL )                               /*!< Position of OVERREAD field. */
#define SPIS_STATUS_OVERREAD_Msk           ( 0x1UL << SPIS_STATUS_OVERREAD_Pos ) /*!< Bit mask of OVERREAD field. */
#define SPIS_STATUS_OVERREAD_NotPresent    ( 0UL )                               /*!< Read: error not present */
#define SPIS_STATUS_OVERREAD_Present       ( 1UL )                               /*!< Read: error present */
#define SPIS_STATUS_OVERREAD_Clear         ( 1UL )                               /*!< Write: clear error on writing '1' */

/* Register: SPIS_ENABLE */
/* Description: Enable SPI slave */

/* Bits 3..0 : Enable or disable SPI slave */
#define SPIS_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define SPIS_ENABLE_ENABLE_Msk         ( 0xFUL << SPIS_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define SPIS_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< Disable SPI slave */
#define SPIS_ENABLE_ENABLE_Enabled     ( 2UL )                             /*!< Enable SPI slave */

/* Register: SPIS_PSEL_SCK */
/* Description: Pin select for SCK */

/* Bit 31 : Connection */
#define SPIS_PSEL_SCK_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define SPIS_PSEL_SCK_CONNECT_Msk             ( 0x1UL << SPIS_PSEL_SCK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIS_PSEL_SCK_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define SPIS_PSEL_SCK_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIS_PSEL_SCK_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define SPIS_PSEL_SCK_PIN_Msk                 ( 0x1FUL << SPIS_PSEL_SCK_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIS_PSEL_MISO */
/* Description: Pin select for MISO signal */

/* Bit 31 : Connection */
#define SPIS_PSEL_MISO_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define SPIS_PSEL_MISO_CONNECT_Msk             ( 0x1UL << SPIS_PSEL_MISO_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIS_PSEL_MISO_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define SPIS_PSEL_MISO_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIS_PSEL_MISO_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define SPIS_PSEL_MISO_PIN_Msk                 ( 0x1FUL << SPIS_PSEL_MISO_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIS_PSEL_MOSI */
/* Description: Pin select for MOSI signal */

/* Bit 31 : Connection */
#define SPIS_PSEL_MOSI_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define SPIS_PSEL_MOSI_CONNECT_Msk             ( 0x1UL << SPIS_PSEL_MOSI_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIS_PSEL_MOSI_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define SPIS_PSEL_MOSI_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIS_PSEL_MOSI_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define SPIS_PSEL_MOSI_PIN_Msk                 ( 0x1FUL << SPIS_PSEL_MOSI_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIS_PSEL_CSN */
/* Description: Pin select for CSN signal */

/* Bit 31 : Connection */
#define SPIS_PSEL_CSN_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define SPIS_PSEL_CSN_CONNECT_Msk             ( 0x1UL << SPIS_PSEL_CSN_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIS_PSEL_CSN_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define SPIS_PSEL_CSN_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIS_PSEL_CSN_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define SPIS_PSEL_CSN_PIN_Msk                 ( 0x1FUL << SPIS_PSEL_CSN_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIS_RXD_PTR */
/* Description: RXD data pointer */

/* Bits 31..0 : RXD data pointer */
#define SPIS_RXD_PTR_PTR_Pos    ( 0UL )                                  /*!< Position of PTR field. */
#define SPIS_RXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << SPIS_RXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: SPIS_RXD_MAXCNT */
/* Description: Maximum number of bytes in receive buffer */

/* Bits 13..0 : Maximum number of bytes in receive buffer */
#define SPIS_RXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define SPIS_RXD_MAXCNT_MAXCNT_Msk    ( 0x3FFFUL << SPIS_RXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: SPIS_RXD_AMOUNT */
/* Description: Number of bytes received in last granted transaction */

