FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 0 : Write '1' to enable interrupt for event DATARDY */
#define TEMP_INTENSET_DATARDY_Pos         ( 0UL )                                /*!< Position of DATARDY field. */
#define TEMP_INTENSET_DATARDY_Msk         ( 0x1UL << TEMP_INTENSET_DATARDY_Pos ) /*!< Bit mask of DATARDY field. */
#define TEMP_INTENSET_DATARDY_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define TEMP_INTENSET_DATARDY_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define TEMP_INTENSET_DATARDY_Set         ( 1UL )                                /*!< Enable */

/* Register: TEMP_INTENCLR */
/* Description: Disable interrupt */

/* Bit 0 : Write '1' to disable interrupt for event DATARDY */
#define TEMP_INTENCLR_DATARDY_Pos         ( 0UL )                                /*!< Position of DATARDY field. */
#define TEMP_INTENCLR_DATARDY_Msk         ( 0x1UL << TEMP_INTENCLR_DATARDY_Pos ) /*!< Bit mask of DATARDY field. */
#define TEMP_INTENCLR_DATARDY_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define TEMP_INTENCLR_DATARDY_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define TEMP_INTENCLR_DATARDY_Clear       ( 1UL )                                /*!< Disable */

/* Register: TEMP_TEMP */
/* Description: Temperature in degC (0.25deg steps) */

/* Bits 31..0 : Temperature in degC (0.25deg steps) */
#define TEMP_TEMP_TEMP_Pos    ( 0UL )                                /*!< Position of TEMP field. */
#define TEMP_TEMP_TEMP_Msk    ( 0xFFFFFFFFUL << TEMP_TEMP_TEMP_Pos ) /*!< Bit mask of TEMP field. */

/* Register: TEMP_A0 */
/* Description: Slope of first piecewise linear function */

/* Bits 11..0 : Slope of first piecewise linear function */
#define TEMP_A0_A0_Pos    ( 0UL )                       /*!< Position of A0 field. */
#define TEMP_A0_A0_Msk    ( 0xFFFUL << TEMP_A0_A0_Pos ) /*!< Bit mask of A0 field. */

/* Register: TEMP_A1 */
/* Description: Slope of second piecewise linear function */

/* Bits 11..0 : Slope of second piecewise linear function */
#define TEMP_A1_A1_Pos    ( 0UL )                       /*!< Position of A1 field. */
#define TEMP_A1_A1_Msk    ( 0xFFFUL << TEMP_A1_A1_Pos ) /*!< Bit mask of A1 field. */

/* Register: TEMP_A2 */
/* Description: Slope of third piecewise linear function */

/* Bits 11..0 : Slope of third piecewise linear function */
#define TEMP_A2_A2_Pos    ( 0UL )                       /*!< Position of A2 field. */
#define TEMP_A2_A2_Msk    ( 0xFFFUL << TEMP_A2_A2_Pos ) /*!< Bit mask of A2 field. */

/* Register: TEMP_A3 */
/* Description: Slope of fourth piecewise linear function */

/* Bits 11..0 : Slope of fourth piecewise linear function */
#define TEMP_A3_A3_Pos    ( 0UL )                       /*!< Position of A3 field. */
#define TEMP_A3_A3_Msk    ( 0xFFFUL << TEMP_A3_A3_Pos ) /*!< Bit mask of A3 field. */

/* Register: TEMP_A4 */
/* Description: Slope of fifth piecewise linear function */

/* Bits 11..0 : Slope of fifth piecewise linear function */
#define TEMP_A4_A4_Pos    ( 0UL )                       /*!< Position of A4 field. */
#define TEMP_A4_A4_Msk    ( 0xFFFUL << TEMP_A4_A4_Pos ) /*!< Bit mask of A4 field. */

/* Register: TEMP_A5 */
/* Description: Slope of sixth piecewise linear function */

/* Bits 11..0 : Slope of sixth piecewise linear function */
#define TEMP_A5_A5_Pos    ( 0UL )                       /*!< Position of A5 field. */
#define TEMP_A5_A5_Msk    ( 0xFFFUL << TEMP_A5_A5_Pos ) /*!< Bit mask of A5 field. */

/* Register: TEMP_B0 */
/* Description: y-intercept of first piecewise linear function */

/* Bits 13..0 : y-intercept of first piecewise linear function */
#define TEMP_B0_B0_Pos    ( 0UL )                        /*!< Position of B0 field. */
#define TEMP_B0_B0_Msk    ( 0x3FFFUL << TEMP_B0_B0_Pos ) /*!< Bit mask of B0 field. */

/* Register: TEMP_B1 */
/* Description: y-intercept of second piecewise linear function */

/* Bits 13..0 : y-intercept of second piecewise linear function */
#define TEMP_B1_B1_Pos    ( 0UL )                        /*!< Position of B1 field. */
#define TEMP_B1_B1_Msk    ( 0x3FFFUL << TEMP_B1_B1_Pos ) /*!< Bit mask of B1 field. */

/* Register: TEMP_B2 */
/* Description: y-intercept of third piecewise linear function */

/* Bits 13..0 : y-intercept of third piecewise linear function */
#define TEMP_B2_B2_Pos    ( 0UL )                        /*!< Position of B2 field. */
#define TEMP_B2_B2_Msk    ( 0x3FFFUL << TEMP_B2_B2_Pos ) /*!< Bit mask of B2 field. */

/* Register: TEMP_B3 */
/* Description: y-intercept of fourth piecewise linear function */

/* Bits 13..0 : y-intercept of fourth piecewise linear function */
#define TEMP_B3_B3_Pos    ( 0UL )                        /*!< Position of B3 field. */
#define TEMP_B3_B3_Msk    ( 0x3FFFUL << TEMP_B3_B3_Pos ) /*!< Bit mask of B3 field. */

/* Register: TEMP_B4 */
/* Description: y-intercept of fifth piecewise linear function */

/* Bits 13..0 : y-intercept of fifth piecewise linear function */
#define TEMP_B4_B4_Pos    ( 0UL )                        /*!< Position of B4 field. */
#define TEMP_B4_B4_Msk    ( 0x3FFFUL << TEMP_B4_B4_Pos ) /*!< Bit mask of B4 field. */

/* Register: TEMP_B5 */
/* Description: y-intercept of sixth piecewise linear function */

/* Bits 13..0 : y-intercept of sixth piecewise linear function */
#define TEMP_B5_B5_Pos    ( 0UL )                        /*!< Position of B5 field. */
#define TEMP_B5_B5_Msk    ( 0x3FFFUL << TEMP_B5_B5_Pos ) /*!< Bit mask of B5 field. */

/* Register: TEMP_T0 */
/* Description: End point of first piecewise linear function */

/* Bits 7..0 : End point of first piecewise linear function */
#define TEMP_T0_T0_Pos    ( 0UL )                      /*!< Position of T0 field. */
#define TEMP_T0_T0_Msk    ( 0xFFUL << TEMP_T0_T0_Pos ) /*!< Bit mask of T0 field. */

/* Register: TEMP_T1 */
/* Description: End point of second piecewise linear function */

/* Bits 7..0 : End point of second piecewise linear function */
#define TEMP_T1_T1_Pos    ( 0UL )                      /*!< Position of T1 field. */
#define TEMP_T1_T1_Msk    ( 0xFFUL << TEMP_T1_T1_Pos ) /*!< Bit mask of T1 field. */

/* Register: TEMP_T2 */
/* Description: End point of third piecewise linear function */

