FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bits 7..0 : End point of third piecewise linear function */
#define TEMP_T2_T2_Pos    ( 0UL )                      /*!< Position of T2 field. */
#define TEMP_T2_T2_Msk    ( 0xFFUL << TEMP_T2_T2_Pos ) /*!< Bit mask of T2 field. */

/* Register: TEMP_T3 */
/* Description: End point of fourth piecewise linear function */

/* Bits 7..0 : End point of fourth piecewise linear function */
#define TEMP_T3_T3_Pos    ( 0UL )                      /*!< Position of T3 field. */
#define TEMP_T3_T3_Msk    ( 0xFFUL << TEMP_T3_T3_Pos ) /*!< Bit mask of T3 field. */

/* Register: TEMP_T4 */
/* Description: End point of fifth piecewise linear function */

/* Bits 7..0 : End point of fifth piecewise linear function */
#define TEMP_T4_T4_Pos    ( 0UL )                      /*!< Position of T4 field. */
#define TEMP_T4_T4_Msk    ( 0xFFUL << TEMP_T4_T4_Pos ) /*!< Bit mask of T4 field. */


/* Peripheral: TIMER */
/* Description: Timer/Counter 0 */

/* Register: TIMER_TASKS_START */
/* Description: Start Timer */

/* Bit 0 : Start Timer */
#define TIMER_TASKS_START_TASKS_START_Pos        ( 0UL )                                        /*!< Position of TASKS_START field. */
#define TIMER_TASKS_START_TASKS_START_Msk        ( 0x1UL << TIMER_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define TIMER_TASKS_START_TASKS_START_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_STOP */
/* Description: Stop Timer */

/* Bit 0 : Stop Timer */
#define TIMER_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                      /*!< Position of TASKS_STOP field. */
#define TIMER_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << TIMER_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define TIMER_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: TIMER_TASKS_COUNT */
/* Description: Increment Timer (Counter mode only) */

/* Bit 0 : Increment Timer (Counter mode only) */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Pos        ( 0UL )                                        /*!< Position of TASKS_COUNT field. */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Msk        ( 0x1UL << TIMER_TASKS_COUNT_TASKS_COUNT_Pos ) /*!< Bit mask of TASKS_COUNT field. */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_CLEAR */
/* Description: Clear time */

/* Bit 0 : Clear time */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos        ( 0UL )                                        /*!< Position of TASKS_CLEAR field. */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Msk        ( 0x1UL << TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos ) /*!< Bit mask of TASKS_CLEAR field. */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_SHUTDOWN */
/* Description: Deprecated register - Shut down timer */

/* Bit 0 : Deprecated field -  Shut down timer */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos        ( 0UL )                                              /*!< Position of TASKS_SHUTDOWN field. */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk        ( 0x1UL << TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos ) /*!< Bit mask of TASKS_SHUTDOWN field. */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Trigger    ( 1UL )                                              /*!< Trigger task */

/* Register: TIMER_TASKS_CAPTURE */
/* Description: Description collection: Capture Timer value to CC[n] register */

/* Bit 0 : Capture Timer value to CC[n] register */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos        ( 0UL )                                            /*!< Position of TASKS_CAPTURE field. */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Msk        ( 0x1UL << TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos ) /*!< Bit mask of TASKS_CAPTURE field. */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: TIMER_EVENTS_COMPARE */
/* Description: Description collection: Compare event on CC[n] match */

/* Bit 0 : Compare event on CC[n] match */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos             ( 0UL )                                              /*!< Position of EVENTS_COMPARE field. */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Msk             ( 0x1UL << TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos ) /*!< Bit mask of EVENTS_COMPARE field. */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: TIMER_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 13 : Shortcut between event COMPARE[5] and task STOP */
#define TIMER_SHORTS_COMPARE5_STOP_Pos          ( 13UL )                                    /*!< Position of COMPARE5_STOP field. */
#define TIMER_SHORTS_COMPARE5_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE5_STOP_Pos ) /*!< Bit mask of COMPARE5_STOP field. */
#define TIMER_SHORTS_COMPARE5_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE5_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 12 : Shortcut between event COMPARE[4] and task STOP */
#define TIMER_SHORTS_COMPARE4_STOP_Pos          ( 12UL )                                    /*!< Position of COMPARE4_STOP field. */
#define TIMER_SHORTS_COMPARE4_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE4_STOP_Pos ) /*!< Bit mask of COMPARE4_STOP field. */
#define TIMER_SHORTS_COMPARE4_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE4_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

