FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 11 : Shortcut between event COMPARE[3] and task STOP */
#define TIMER_SHORTS_COMPARE3_STOP_Pos          ( 11UL )                                    /*!< Position of COMPARE3_STOP field. */
#define TIMER_SHORTS_COMPARE3_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE3_STOP_Pos ) /*!< Bit mask of COMPARE3_STOP field. */
#define TIMER_SHORTS_COMPARE3_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE3_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 10 : Shortcut between event COMPARE[2] and task STOP */
#define TIMER_SHORTS_COMPARE2_STOP_Pos          ( 10UL )                                    /*!< Position of COMPARE2_STOP field. */
#define TIMER_SHORTS_COMPARE2_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE2_STOP_Pos ) /*!< Bit mask of COMPARE2_STOP field. */
#define TIMER_SHORTS_COMPARE2_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE2_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 9 : Shortcut between event COMPARE[1] and task STOP */
#define TIMER_SHORTS_COMPARE1_STOP_Pos          ( 9UL )                                     /*!< Position of COMPARE1_STOP field. */
#define TIMER_SHORTS_COMPARE1_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE1_STOP_Pos ) /*!< Bit mask of COMPARE1_STOP field. */
#define TIMER_SHORTS_COMPARE1_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE1_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 8 : Shortcut between event COMPARE[0] and task STOP */
#define TIMER_SHORTS_COMPARE0_STOP_Pos          ( 8UL )                                     /*!< Position of COMPARE0_STOP field. */
#define TIMER_SHORTS_COMPARE0_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE0_STOP_Pos ) /*!< Bit mask of COMPARE0_STOP field. */
#define TIMER_SHORTS_COMPARE0_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE0_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 5 : Shortcut between event COMPARE[5] and task CLEAR */
#define TIMER_SHORTS_COMPARE5_CLEAR_Pos         ( 5UL )                                      /*!< Position of COMPARE5_CLEAR field. */
#define TIMER_SHORTS_COMPARE5_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE5_CLEAR_Pos ) /*!< Bit mask of COMPARE5_CLEAR field. */
#define TIMER_SHORTS_COMPARE5_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE5_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

/* Bit 4 : Shortcut between event COMPARE[4] and task CLEAR */
#define TIMER_SHORTS_COMPARE4_CLEAR_Pos         ( 4UL )                                      /*!< Position of COMPARE4_CLEAR field. */
#define TIMER_SHORTS_COMPARE4_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE4_CLEAR_Pos ) /*!< Bit mask of COMPARE4_CLEAR field. */
#define TIMER_SHORTS_COMPARE4_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE4_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

/* Bit 3 : Shortcut between event COMPARE[3] and task CLEAR */
#define TIMER_SHORTS_COMPARE3_CLEAR_Pos         ( 3UL )                                      /*!< Position of COMPARE3_CLEAR field. */
#define TIMER_SHORTS_COMPARE3_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE3_CLEAR_Pos ) /*!< Bit mask of COMPARE3_CLEAR field. */
#define TIMER_SHORTS_COMPARE3_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE3_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

/* Bit 2 : Shortcut between event COMPARE[2] and task CLEAR */
#define TIMER_SHORTS_COMPARE2_CLEAR_Pos         ( 2UL )                                      /*!< Position of COMPARE2_CLEAR field. */
#define TIMER_SHORTS_COMPARE2_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE2_CLEAR_Pos ) /*!< Bit mask of COMPARE2_CLEAR field. */
#define TIMER_SHORTS_COMPARE2_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE2_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

/* Bit 1 : Shortcut between event COMPARE[1] and task CLEAR */
#define TIMER_SHORTS_COMPARE1_CLEAR_Pos         ( 1UL )                                      /*!< Position of COMPARE1_CLEAR field. */
#define TIMER_SHORTS_COMPARE1_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE1_CLEAR_Pos ) /*!< Bit mask of COMPARE1_CLEAR field. */
#define TIMER_SHORTS_COMPARE1_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE1_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

/* Bit 0 : Shortcut between event COMPARE[0] and task CLEAR */
#define TIMER_SHORTS_COMPARE0_CLEAR_Pos         ( 0UL )                                      /*!< Position of COMPARE0_CLEAR field. */
#define TIMER_SHORTS_COMPARE0_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE0_CLEAR_Pos ) /*!< Bit mask of COMPARE0_CLEAR field. */
#define TIMER_SHORTS_COMPARE0_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE0_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

/* Register: TIMER_INTENSET */
/* Description: Enable interrupt */

/* Bit 21 : Write '1' to enable interrupt for event COMPARE[5] */
#define TIMER_INTENSET_COMPARE5_Pos         ( 21UL )                                 /*!< Position of COMPARE5 field. */
#define TIMER_INTENSET_COMPARE5_Msk         ( 0x1UL << TIMER_INTENSET_COMPARE5_Pos ) /*!< Bit mask of COMPARE5 field. */
#define TIMER_INTENSET_COMPARE5_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENSET_COMPARE5_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENSET_COMPARE5_Set         ( 1UL )                                  /*!< Enable */

/* Bit 20 : Write '1' to enable interrupt for event COMPARE[4] */
#define TIMER_INTENSET_COMPARE4_Pos         ( 20UL )                                 /*!< Position of COMPARE4 field. */
#define TIMER_INTENSET_COMPARE4_Msk         ( 0x1UL << TIMER_INTENSET_COMPARE4_Pos ) /*!< Bit mask of COMPARE4 field. */
#define TIMER_INTENSET_COMPARE4_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENSET_COMPARE4_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENSET_COMPARE4_Set         ( 1UL )                                  /*!< Enable */

/* Bit 19 : Write '1' to enable interrupt for event COMPARE[3] */
#define TIMER_INTENSET_COMPARE3_Pos         ( 19UL )                                 /*!< Position of COMPARE3 field. */
#define TIMER_INTENSET_COMPARE3_Msk         ( 0x1UL << TIMER_INTENSET_COMPARE3_Pos ) /*!< Bit mask of COMPARE3 field. */
#define TIMER_INTENSET_COMPARE3_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENSET_COMPARE3_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENSET_COMPARE3_Set         ( 1UL )                                  /*!< Enable */

/* Bit 18 : Write '1' to enable interrupt for event COMPARE[2] */
#define TIMER_INTENSET_COMPARE2_Pos         ( 18UL )                                 /*!< Position of COMPARE2 field. */
#define TIMER_INTENSET_COMPARE2_Msk         ( 0x1UL << TIMER_INTENSET_COMPARE2_Pos ) /*!< Bit mask of COMPARE2 field. */
#define TIMER_INTENSET_COMPARE2_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENSET_COMPARE2_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENSET_COMPARE2_Set         ( 1UL )                                  /*!< Enable */

/* Bit 17 : Write '1' to enable interrupt for event COMPARE[1] */
#define TIMER_INTENSET_COMPARE1_Pos         ( 17UL )                                 /*!< Position of COMPARE1 field. */
#define TIMER_INTENSET_COMPARE1_Msk         ( 0x1UL << TIMER_INTENSET_COMPARE1_Pos ) /*!< Bit mask of COMPARE1 field. */
#define TIMER_INTENSET_COMPARE1_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENSET_COMPARE1_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENSET_COMPARE1_Set         ( 1UL )                                  /*!< Enable */

/* Bit 16 : Write '1' to enable interrupt for event COMPARE[0] */
#define TIMER_INTENSET_COMPARE0_Pos         ( 16UL )                                 /*!< Position of COMPARE0 field. */
#define TIMER_INTENSET_COMPARE0_Msk         ( 0x1UL << TIMER_INTENSET_COMPARE0_Pos ) /*!< Bit mask of COMPARE0 field. */
#define TIMER_INTENSET_COMPARE0_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENSET_COMPARE0_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENSET_COMPARE0_Set         ( 1UL )                                  /*!< Enable */

/* Register: TIMER_INTENCLR */
/* Description: Disable interrupt */

/* Bit 21 : Write '1' to disable interrupt for event COMPARE[5] */
#define TIMER_INTENCLR_COMPARE5_Pos         ( 21UL )                                 /*!< Position of COMPARE5 field. */
#define TIMER_INTENCLR_COMPARE5_Msk         ( 0x1UL << TIMER_INTENCLR_COMPARE5_Pos ) /*!< Bit mask of COMPARE5 field. */
#define TIMER_INTENCLR_COMPARE5_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TIMER_INTENCLR_COMPARE5_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TIMER_INTENCLR_COMPARE5_Clear       ( 1UL )                                  /*!< Disable */

