FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 0 : Shortcut between event BB and task SUSPEND */
#define TWI_SHORTS_BB_SUSPEND_Pos         ( 0UL )                                /*!< Position of BB_SUSPEND field. */
#define TWI_SHORTS_BB_SUSPEND_Msk         ( 0x1UL << TWI_SHORTS_BB_SUSPEND_Pos ) /*!< Bit mask of BB_SUSPEND field. */
#define TWI_SHORTS_BB_SUSPEND_Disabled    ( 0UL )                                /*!< Disable shortcut */
#define TWI_SHORTS_BB_SUSPEND_Enabled     ( 1UL )                                /*!< Enable shortcut */

/* Register: TWI_INTENSET */
/* Description: Enable interrupt */

/* Bit 18 : Write '1' to enable interrupt for event SUSPENDED */
#define TWI_INTENSET_SUSPENDED_Pos         ( 18UL )                                /*!< Position of SUSPENDED field. */
#define TWI_INTENSET_SUSPENDED_Msk         ( 0x1UL << TWI_INTENSET_SUSPENDED_Pos ) /*!< Bit mask of SUSPENDED field. */
#define TWI_INTENSET_SUSPENDED_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define TWI_INTENSET_SUSPENDED_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define TWI_INTENSET_SUSPENDED_Set         ( 1UL )                                 /*!< Enable */

/* Bit 14 : Write '1' to enable interrupt for event BB */
#define TWI_INTENSET_BB_Pos                ( 14UL )                         /*!< Position of BB field. */
#define TWI_INTENSET_BB_Msk                ( 0x1UL << TWI_INTENSET_BB_Pos ) /*!< Bit mask of BB field. */
#define TWI_INTENSET_BB_Disabled           ( 0UL )                          /*!< Read: Disabled */
#define TWI_INTENSET_BB_Enabled            ( 1UL )                          /*!< Read: Enabled */
#define TWI_INTENSET_BB_Set                ( 1UL )                          /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event ERROR */
#define TWI_INTENSET_ERROR_Pos             ( 9UL )                             /*!< Position of ERROR field. */
#define TWI_INTENSET_ERROR_Msk             ( 0x1UL << TWI_INTENSET_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define TWI_INTENSET_ERROR_Disabled        ( 0UL )                             /*!< Read: Disabled */
#define TWI_INTENSET_ERROR_Enabled         ( 1UL )                             /*!< Read: Enabled */
#define TWI_INTENSET_ERROR_Set             ( 1UL )                             /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event TXDSENT */
#define TWI_INTENSET_TXDSENT_Pos           ( 7UL )                               /*!< Position of TXDSENT field. */
#define TWI_INTENSET_TXDSENT_Msk           ( 0x1UL << TWI_INTENSET_TXDSENT_Pos ) /*!< Bit mask of TXDSENT field. */
#define TWI_INTENSET_TXDSENT_Disabled      ( 0UL )                               /*!< Read: Disabled */
#define TWI_INTENSET_TXDSENT_Enabled       ( 1UL )                               /*!< Read: Enabled */
#define TWI_INTENSET_TXDSENT_Set           ( 1UL )                               /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event RXDREADY */
#define TWI_INTENSET_RXDREADY_Pos          ( 2UL )                                /*!< Position of RXDREADY field. */
#define TWI_INTENSET_RXDREADY_Msk          ( 0x1UL << TWI_INTENSET_RXDREADY_Pos ) /*!< Bit mask of RXDREADY field. */
#define TWI_INTENSET_RXDREADY_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define TWI_INTENSET_RXDREADY_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define TWI_INTENSET_RXDREADY_Set          ( 1UL )                                /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event STOPPED */
#define TWI_INTENSET_STOPPED_Pos           ( 1UL )                               /*!< Position of STOPPED field. */
#define TWI_INTENSET_STOPPED_Msk           ( 0x1UL << TWI_INTENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define TWI_INTENSET_STOPPED_Disabled      ( 0UL )                               /*!< Read: Disabled */
#define TWI_INTENSET_STOPPED_Enabled       ( 1UL )                               /*!< Read: Enabled */
#define TWI_INTENSET_STOPPED_Set           ( 1UL )                               /*!< Enable */

/* Register: TWI_INTENCLR */
/* Description: Disable interrupt */

/* Bit 18 : Write '1' to disable interrupt for event SUSPENDED */
#define TWI_INTENCLR_SUSPENDED_Pos         ( 18UL )                                /*!< Position of SUSPENDED field. */
#define TWI_INTENCLR_SUSPENDED_Msk         ( 0x1UL << TWI_INTENCLR_SUSPENDED_Pos ) /*!< Bit mask of SUSPENDED field. */
#define TWI_INTENCLR_SUSPENDED_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define TWI_INTENCLR_SUSPENDED_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define TWI_INTENCLR_SUSPENDED_Clear       ( 1UL )                                 /*!< Disable */

/* Bit 14 : Write '1' to disable interrupt for event BB */
#define TWI_INTENCLR_BB_Pos                ( 14UL )                         /*!< Position of BB field. */
#define TWI_INTENCLR_BB_Msk                ( 0x1UL << TWI_INTENCLR_BB_Pos ) /*!< Bit mask of BB field. */
#define TWI_INTENCLR_BB_Disabled           ( 0UL )                          /*!< Read: Disabled */
#define TWI_INTENCLR_BB_Enabled            ( 1UL )                          /*!< Read: Enabled */
#define TWI_INTENCLR_BB_Clear              ( 1UL )                          /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event ERROR */
#define TWI_INTENCLR_ERROR_Pos             ( 9UL )                             /*!< Position of ERROR field. */
#define TWI_INTENCLR_ERROR_Msk             ( 0x1UL << TWI_INTENCLR_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define TWI_INTENCLR_ERROR_Disabled        ( 0UL )                             /*!< Read: Disabled */
#define TWI_INTENCLR_ERROR_Enabled         ( 1UL )                             /*!< Read: Enabled */
#define TWI_INTENCLR_ERROR_Clear           ( 1UL )                             /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event TXDSENT */
#define TWI_INTENCLR_TXDSENT_Pos           ( 7UL )                               /*!< Position of TXDSENT field. */
#define TWI_INTENCLR_TXDSENT_Msk           ( 0x1UL << TWI_INTENCLR_TXDSENT_Pos ) /*!< Bit mask of TXDSENT field. */
#define TWI_INTENCLR_TXDSENT_Disabled      ( 0UL )                               /*!< Read: Disabled */
#define TWI_INTENCLR_TXDSENT_Enabled       ( 1UL )                               /*!< Read: Enabled */
#define TWI_INTENCLR_TXDSENT_Clear         ( 1UL )                               /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event RXDREADY */
#define TWI_INTENCLR_RXDREADY_Pos          ( 2UL )                                /*!< Position of RXDREADY field. */
#define TWI_INTENCLR_RXDREADY_Msk          ( 0x1UL << TWI_INTENCLR_RXDREADY_Pos ) /*!< Bit mask of RXDREADY field. */
#define TWI_INTENCLR_RXDREADY_Disabled     ( 0UL )                                /*!< Read: Disabled */
#define TWI_INTENCLR_RXDREADY_Enabled      ( 1UL )                                /*!< Read: Enabled */
#define TWI_INTENCLR_RXDREADY_Clear        ( 1UL )                                /*!< Disable */

