FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 20 : Write '1' to disable interrupt for event TXSTARTED */
#define TWIM_INTENCLR_TXSTARTED_Pos         ( 20UL )                                 /*!< Position of TXSTARTED field. */
#define TWIM_INTENCLR_TXSTARTED_Msk         ( 0x1UL << TWIM_INTENCLR_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define TWIM_INTENCLR_TXSTARTED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TWIM_INTENCLR_TXSTARTED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TWIM_INTENCLR_TXSTARTED_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 19 : Write '1' to disable interrupt for event RXSTARTED */
#define TWIM_INTENCLR_RXSTARTED_Pos         ( 19UL )                                 /*!< Position of RXSTARTED field. */
#define TWIM_INTENCLR_RXSTARTED_Msk         ( 0x1UL << TWIM_INTENCLR_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define TWIM_INTENCLR_RXSTARTED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TWIM_INTENCLR_RXSTARTED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TWIM_INTENCLR_RXSTARTED_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 18 : Write '1' to disable interrupt for event SUSPENDED */
#define TWIM_INTENCLR_SUSPENDED_Pos         ( 18UL )                                 /*!< Position of SUSPENDED field. */
#define TWIM_INTENCLR_SUSPENDED_Msk         ( 0x1UL << TWIM_INTENCLR_SUSPENDED_Pos ) /*!< Bit mask of SUSPENDED field. */
#define TWIM_INTENCLR_SUSPENDED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TWIM_INTENCLR_SUSPENDED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TWIM_INTENCLR_SUSPENDED_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event ERROR */
#define TWIM_INTENCLR_ERROR_Pos             ( 9UL )                              /*!< Position of ERROR field. */
#define TWIM_INTENCLR_ERROR_Msk             ( 0x1UL << TWIM_INTENCLR_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define TWIM_INTENCLR_ERROR_Disabled        ( 0UL )                              /*!< Read: Disabled */
#define TWIM_INTENCLR_ERROR_Enabled         ( 1UL )                              /*!< Read: Enabled */
#define TWIM_INTENCLR_ERROR_Clear           ( 1UL )                              /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event STOPPED */
#define TWIM_INTENCLR_STOPPED_Pos           ( 1UL )                                /*!< Position of STOPPED field. */
#define TWIM_INTENCLR_STOPPED_Msk           ( 0x1UL << TWIM_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define TWIM_INTENCLR_STOPPED_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define TWIM_INTENCLR_STOPPED_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define TWIM_INTENCLR_STOPPED_Clear         ( 1UL )                                /*!< Disable */

/* Register: TWIM_ERRORSRC */
/* Description: Error source */

/* Bit 2 : NACK received after sending a data byte (write '1' to clear) */
#define TWIM_ERRORSRC_DNACK_Pos              ( 2UL )                              /*!< Position of DNACK field. */
#define TWIM_ERRORSRC_DNACK_Msk              ( 0x1UL << TWIM_ERRORSRC_DNACK_Pos ) /*!< Bit mask of DNACK field. */
#define TWIM_ERRORSRC_DNACK_NotReceived      ( 0UL )                              /*!< Error did not occur */
#define TWIM_ERRORSRC_DNACK_Received         ( 1UL )                              /*!< Error occurred */

/* Bit 1 : NACK received after sending the address (write '1' to clear) */
#define TWIM_ERRORSRC_ANACK_Pos              ( 1UL )                              /*!< Position of ANACK field. */
#define TWIM_ERRORSRC_ANACK_Msk              ( 0x1UL << TWIM_ERRORSRC_ANACK_Pos ) /*!< Bit mask of ANACK field. */
#define TWIM_ERRORSRC_ANACK_NotReceived      ( 0UL )                              /*!< Error did not occur */
#define TWIM_ERRORSRC_ANACK_Received         ( 1UL )                              /*!< Error occurred */

/* Bit 0 : Overrun error */
#define TWIM_ERRORSRC_OVERRUN_Pos            ( 0UL )                                /*!< Position of OVERRUN field. */
#define TWIM_ERRORSRC_OVERRUN_Msk            ( 0x1UL << TWIM_ERRORSRC_OVERRUN_Pos ) /*!< Bit mask of OVERRUN field. */
#define TWIM_ERRORSRC_OVERRUN_NotReceived    ( 0UL )                                /*!< Error did not occur */
#define TWIM_ERRORSRC_OVERRUN_Received       ( 1UL )                                /*!< Error occurred */

/* Register: TWIM_ENABLE */
/* Description: Enable TWIM */

/* Bits 3..0 : Enable or disable TWIM */
#define TWIM_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define TWIM_ENABLE_ENABLE_Msk         ( 0xFUL << TWIM_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define TWIM_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< Disable TWIM */
#define TWIM_ENABLE_ENABLE_Enabled     ( 6UL )                             /*!< Enable TWIM */

/* Register: TWIM_PSEL_SCL */
/* Description: Pin select for SCL signal */

/* Bit 31 : Connection */
#define TWIM_PSEL_SCL_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define TWIM_PSEL_SCL_CONNECT_Msk             ( 0x1UL << TWIM_PSEL_SCL_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TWIM_PSEL_SCL_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define TWIM_PSEL_SCL_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TWIM_PSEL_SCL_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define TWIM_PSEL_SCL_PIN_Msk                 ( 0x1FUL << TWIM_PSEL_SCL_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: TWIM_PSEL_SDA */
/* Description: Pin select for SDA signal */

/* Bit 31 : Connection */
#define TWIM_PSEL_SDA_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define TWIM_PSEL_SDA_CONNECT_Msk             ( 0x1UL << TWIM_PSEL_SDA_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TWIM_PSEL_SDA_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define TWIM_PSEL_SDA_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TWIM_PSEL_SDA_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define TWIM_PSEL_SDA_PIN_Msk                 ( 0x1FUL << TWIM_PSEL_SDA_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: TWIM_FREQUENCY */
/* Description: TWI frequency. Accuracy depends on the HFCLK source selected. */

