FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bits 31..0 : TWI master clock frequency */
#define TWIM_FREQUENCY_FREQUENCY_Pos     ( 0UL )                                          /*!< Position of FREQUENCY field. */
#define TWIM_FREQUENCY_FREQUENCY_Msk     ( 0xFFFFFFFFUL << TWIM_FREQUENCY_FREQUENCY_Pos ) /*!< Bit mask of FREQUENCY field. */
#define TWIM_FREQUENCY_FREQUENCY_K100    ( 0x01980000UL )                                 /*!< 100 kbps */
#define TWIM_FREQUENCY_FREQUENCY_K250    ( 0x04000000UL )                                 /*!< 250 kbps */
#define TWIM_FREQUENCY_FREQUENCY_K400    ( 0x06400000UL )                                 /*!< 400 kbps */

/* Register: TWIM_RXD_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define TWIM_RXD_PTR_PTR_Pos    ( 0UL )                                  /*!< Position of PTR field. */
#define TWIM_RXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << TWIM_RXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: TWIM_RXD_MAXCNT */
/* Description: Maximum number of bytes in receive buffer */

/* Bits 13..0 : Maximum number of bytes in receive buffer */
#define TWIM_RXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define TWIM_RXD_MAXCNT_MAXCNT_Msk    ( 0x3FFFUL << TWIM_RXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: TWIM_RXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 13..0 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
#define TWIM_RXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                    /*!< Position of AMOUNT field. */
#define TWIM_RXD_AMOUNT_AMOUNT_Msk    ( 0x3FFFUL << TWIM_RXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: TWIM_RXD_LIST */
/* Description: EasyDMA list type */

/* Bits 2..0 : List type */
#define TWIM_RXD_LIST_LIST_Pos          ( 0UL )                             /*!< Position of LIST field. */
#define TWIM_RXD_LIST_LIST_Msk          ( 0x7UL << TWIM_RXD_LIST_LIST_Pos ) /*!< Bit mask of LIST field. */
#define TWIM_RXD_LIST_LIST_Disabled     ( 0UL )                             /*!< Disable EasyDMA list */
#define TWIM_RXD_LIST_LIST_ArrayList    ( 1UL )                             /*!< Use array list */

/* Register: TWIM_TXD_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define TWIM_TXD_PTR_PTR_Pos    ( 0UL )                                  /*!< Position of PTR field. */
#define TWIM_TXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << TWIM_TXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: TWIM_TXD_MAXCNT */
/* Description: Maximum number of bytes in transmit buffer */

/* Bits 13..0 : Maximum number of bytes in transmit buffer */
#define TWIM_TXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define TWIM_TXD_MAXCNT_MAXCNT_Msk    ( 0x3FFFUL << TWIM_TXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: TWIM_TXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 13..0 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
#define TWIM_TXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                    /*!< Position of AMOUNT field. */
#define TWIM_TXD_AMOUNT_AMOUNT_Msk    ( 0x3FFFUL << TWIM_TXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: TWIM_TXD_LIST */
/* Description: EasyDMA list type */

/* Bits 2..0 : List type */
#define TWIM_TXD_LIST_LIST_Pos          ( 0UL )                             /*!< Position of LIST field. */
#define TWIM_TXD_LIST_LIST_Msk          ( 0x7UL << TWIM_TXD_LIST_LIST_Pos ) /*!< Bit mask of LIST field. */
#define TWIM_TXD_LIST_LIST_Disabled     ( 0UL )                             /*!< Disable EasyDMA list */
#define TWIM_TXD_LIST_LIST_ArrayList    ( 1UL )                             /*!< Use array list */

/* Register: TWIM_ADDRESS */
/* Description: Address used in the TWI transfer */

/* Bits 6..0 : Address used in the TWI transfer */
#define TWIM_ADDRESS_ADDRESS_Pos    ( 0UL )                                /*!< Position of ADDRESS field. */
#define TWIM_ADDRESS_ADDRESS_Msk    ( 0x7FUL << TWIM_ADDRESS_ADDRESS_Pos ) /*!< Bit mask of ADDRESS field. */


/* Peripheral: TWIS */
/* Description: I2C compatible Two-Wire Slave Interface with EasyDMA */

/* Register: TWIS_TASKS_STOP */
/* Description: Stop TWI transaction */

/* Bit 0 : Stop TWI transaction */
#define TWIS_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define TWIS_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << TWIS_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define TWIS_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: TWIS_TASKS_SUSPEND */
/* Description: Suspend TWI transaction */

/* Bit 0 : Suspend TWI transaction */
#define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Pos        ( 0UL )                                           /*!< Position of TASKS_SUSPEND field. */
#define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Msk        ( 0x1UL << TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Pos ) /*!< Bit mask of TASKS_SUSPEND field. */
#define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: TWIS_TASKS_RESUME */
/* Description: Resume TWI transaction */

/* Bit 0 : Resume TWI transaction */
#define TWIS_TASKS_RESUME_TASKS_RESUME_Pos        ( 0UL )                                         /*!< Position of TASKS_RESUME field. */
#define TWIS_TASKS_RESUME_TASKS_RESUME_Msk        ( 0x1UL << TWIS_TASKS_RESUME_TASKS_RESUME_Pos ) /*!< Bit mask of TASKS_RESUME field. */
#define TWIS_TASKS_RESUME_TASKS_RESUME_Trigger    ( 1UL )                                         /*!< Trigger task */

/* Register: TWIS_TASKS_PREPARERX */
/* Description: Prepare the TWI slave to respond to a write command */

/* Bit 0 : Prepare the TWI slave to respond to a write command */
#define TWIS_TASKS_PREPARERX_TASKS_PREPARERX_Pos        ( 0UL )                                               /*!< Position of TASKS_PREPARERX field. */
#define TWIS_TASKS_PREPARERX_TASKS_PREPARERX_Msk        ( 0x1UL << TWIS_TASKS_PREPARERX_TASKS_PREPARERX_Pos ) /*!< Bit mask of TASKS_PREPARERX field. */
#define TWIS_TASKS_PREPARERX_TASKS_PREPARERX_Trigger    ( 1UL )                                               /*!< Trigger task */

/* Register: TWIS_TASKS_PREPARETX */
/* Description: Prepare the TWI slave to respond to a read command */

/* Bit 0 : Prepare the TWI slave to respond to a read command */
#define TWIS_TASKS_PREPARETX_TASKS_PREPARETX_Pos        ( 0UL )                                               /*!< Position of TASKS_PREPARETX field. */
#define TWIS_TASKS_PREPARETX_TASKS_PREPARETX_Msk        ( 0x1UL << TWIS_TASKS_PREPARETX_TASKS_PREPARETX_Pos ) /*!< Bit mask of TASKS_PREPARETX field. */
#define TWIS_TASKS_PREPARETX_TASKS_PREPARETX_Trigger    ( 1UL )                                               /*!< Trigger task */

/* Register: TWIS_EVENTS_STOPPED */
/* Description: TWI stopped */

/* Bit 0 : TWI stopped */
#define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                             /*!< Position of EVENTS_STOPPED field. */
#define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                             /*!< Event not generated */
#define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                             /*!< Event generated */

/* Register: TWIS_EVENTS_ERROR */
/* Description: TWI error */

/* Bit 0 : TWI error */
#define TWIS_EVENTS_ERROR_EVENTS_ERROR_Pos             ( 0UL )                                         /*!< Position of EVENTS_ERROR field. */
#define TWIS_EVENTS_ERROR_EVENTS_ERROR_Msk             ( 0x1UL << TWIS_EVENTS_ERROR_EVENTS_ERROR_Pos ) /*!< Bit mask of EVENTS_ERROR field. */
#define TWIS_EVENTS_ERROR_EVENTS_ERROR_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define TWIS_EVENTS_ERROR_EVENTS_ERROR_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: TWIS_EVENTS_RXSTARTED */
/* Description: Receive sequence started */

