FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 0 : Receive sequence started */
#define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos             ( 0UL )                                                 /*!< Position of EVENTS_RXSTARTED field. */
#define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Msk             ( 0x1UL << TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos ) /*!< Bit mask of EVENTS_RXSTARTED field. */
#define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_NotGenerated    ( 0UL )                                                 /*!< Event not generated */
#define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Generated       ( 1UL )                                                 /*!< Event generated */

/* Register: TWIS_EVENTS_TXSTARTED */
/* Description: Transmit sequence started */

/* Bit 0 : Transmit sequence started */
#define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos             ( 0UL )                                                 /*!< Position of EVENTS_TXSTARTED field. */
#define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Msk             ( 0x1UL << TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos ) /*!< Bit mask of EVENTS_TXSTARTED field. */
#define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_NotGenerated    ( 0UL )                                                 /*!< Event not generated */
#define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Generated       ( 1UL )                                                 /*!< Event generated */

/* Register: TWIS_EVENTS_WRITE */
/* Description: Write command received */

/* Bit 0 : Write command received */
#define TWIS_EVENTS_WRITE_EVENTS_WRITE_Pos             ( 0UL )                                         /*!< Position of EVENTS_WRITE field. */
#define TWIS_EVENTS_WRITE_EVENTS_WRITE_Msk             ( 0x1UL << TWIS_EVENTS_WRITE_EVENTS_WRITE_Pos ) /*!< Bit mask of EVENTS_WRITE field. */
#define TWIS_EVENTS_WRITE_EVENTS_WRITE_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define TWIS_EVENTS_WRITE_EVENTS_WRITE_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: TWIS_EVENTS_READ */
/* Description: Read command received */

/* Bit 0 : Read command received */
#define TWIS_EVENTS_READ_EVENTS_READ_Pos             ( 0UL )                                       /*!< Position of EVENTS_READ field. */
#define TWIS_EVENTS_READ_EVENTS_READ_Msk             ( 0x1UL << TWIS_EVENTS_READ_EVENTS_READ_Pos ) /*!< Bit mask of EVENTS_READ field. */
#define TWIS_EVENTS_READ_EVENTS_READ_NotGenerated    ( 0UL )                                       /*!< Event not generated */
#define TWIS_EVENTS_READ_EVENTS_READ_Generated       ( 1UL )                                       /*!< Event generated */

/* Register: TWIS_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 14 : Shortcut between event READ and task SUSPEND */
#define TWIS_SHORTS_READ_SUSPEND_Pos          ( 14UL )                                  /*!< Position of READ_SUSPEND field. */
#define TWIS_SHORTS_READ_SUSPEND_Msk          ( 0x1UL << TWIS_SHORTS_READ_SUSPEND_Pos ) /*!< Bit mask of READ_SUSPEND field. */
#define TWIS_SHORTS_READ_SUSPEND_Disabled     ( 0UL )                                   /*!< Disable shortcut */
#define TWIS_SHORTS_READ_SUSPEND_Enabled      ( 1UL )                                   /*!< Enable shortcut */

/* Bit 13 : Shortcut between event WRITE and task SUSPEND */
#define TWIS_SHORTS_WRITE_SUSPEND_Pos         ( 13UL )                                   /*!< Position of WRITE_SUSPEND field. */
#define TWIS_SHORTS_WRITE_SUSPEND_Msk         ( 0x1UL << TWIS_SHORTS_WRITE_SUSPEND_Pos ) /*!< Bit mask of WRITE_SUSPEND field. */
#define TWIS_SHORTS_WRITE_SUSPEND_Disabled    ( 0UL )                                    /*!< Disable shortcut */
#define TWIS_SHORTS_WRITE_SUSPEND_Enabled     ( 1UL )                                    /*!< Enable shortcut */

/* Register: TWIS_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 26 : Enable or disable interrupt for event READ */
#define TWIS_INTEN_READ_Pos              ( 26UL )                         /*!< Position of READ field. */
#define TWIS_INTEN_READ_Msk              ( 0x1UL << TWIS_INTEN_READ_Pos ) /*!< Bit mask of READ field. */
#define TWIS_INTEN_READ_Disabled         ( 0UL )                          /*!< Disable */
#define TWIS_INTEN_READ_Enabled          ( 1UL )                          /*!< Enable */

/* Bit 25 : Enable or disable interrupt for event WRITE */
#define TWIS_INTEN_WRITE_Pos             ( 25UL )                          /*!< Position of WRITE field. */
#define TWIS_INTEN_WRITE_Msk             ( 0x1UL << TWIS_INTEN_WRITE_Pos ) /*!< Bit mask of WRITE field. */
#define TWIS_INTEN_WRITE_Disabled        ( 0UL )                           /*!< Disable */
#define TWIS_INTEN_WRITE_Enabled         ( 1UL )                           /*!< Enable */

/* Bit 20 : Enable or disable interrupt for event TXSTARTED */
#define TWIS_INTEN_TXSTARTED_Pos         ( 20UL )                              /*!< Position of TXSTARTED field. */
#define TWIS_INTEN_TXSTARTED_Msk         ( 0x1UL << TWIS_INTEN_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define TWIS_INTEN_TXSTARTED_Disabled    ( 0UL )                               /*!< Disable */
#define TWIS_INTEN_TXSTARTED_Enabled     ( 1UL )                               /*!< Enable */

/* Bit 19 : Enable or disable interrupt for event RXSTARTED */
#define TWIS_INTEN_RXSTARTED_Pos         ( 19UL )                              /*!< Position of RXSTARTED field. */
#define TWIS_INTEN_RXSTARTED_Msk         ( 0x1UL << TWIS_INTEN_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define TWIS_INTEN_RXSTARTED_Disabled    ( 0UL )                               /*!< Disable */
#define TWIS_INTEN_RXSTARTED_Enabled     ( 1UL )                               /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event ERROR */
#define TWIS_INTEN_ERROR_Pos             ( 9UL )                           /*!< Position of ERROR field. */
#define TWIS_INTEN_ERROR_Msk             ( 0x1UL << TWIS_INTEN_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define TWIS_INTEN_ERROR_Disabled        ( 0UL )                           /*!< Disable */
#define TWIS_INTEN_ERROR_Enabled         ( 1UL )                           /*!< Enable */

