FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bits 3..0 : Enable or disable UART */
#define UART_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define UART_ENABLE_ENABLE_Msk         ( 0xFUL << UART_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define UART_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< Disable UART */
#define UART_ENABLE_ENABLE_Enabled     ( 4UL )                             /*!< Enable UART */

/* Register: UART_PSEL_RTS */
/* Description: Pin select for RTS */

/* Bit 31 : Connection */
#define UART_PSEL_RTS_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define UART_PSEL_RTS_CONNECT_Msk             ( 0x1UL << UART_PSEL_RTS_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define UART_PSEL_RTS_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define UART_PSEL_RTS_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define UART_PSEL_RTS_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define UART_PSEL_RTS_PIN_Msk                 ( 0x1FUL << UART_PSEL_RTS_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: UART_PSEL_TXD */
/* Description: Pin select for TXD */

/* Bit 31 : Connection */
#define UART_PSEL_TXD_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define UART_PSEL_TXD_CONNECT_Msk             ( 0x1UL << UART_PSEL_TXD_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define UART_PSEL_TXD_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define UART_PSEL_TXD_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define UART_PSEL_TXD_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define UART_PSEL_TXD_PIN_Msk                 ( 0x1FUL << UART_PSEL_TXD_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: UART_PSEL_CTS */
/* Description: Pin select for CTS */

/* Bit 31 : Connection */
#define UART_PSEL_CTS_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define UART_PSEL_CTS_CONNECT_Msk             ( 0x1UL << UART_PSEL_CTS_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define UART_PSEL_CTS_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define UART_PSEL_CTS_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define UART_PSEL_CTS_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define UART_PSEL_CTS_PIN_Msk                 ( 0x1FUL << UART_PSEL_CTS_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: UART_PSEL_RXD */
/* Description: Pin select for RXD */

/* Bit 31 : Connection */
#define UART_PSEL_RXD_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define UART_PSEL_RXD_CONNECT_Msk             ( 0x1UL << UART_PSEL_RXD_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define UART_PSEL_RXD_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define UART_PSEL_RXD_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define UART_PSEL_RXD_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define UART_PSEL_RXD_PIN_Msk                 ( 0x1FUL << UART_PSEL_RXD_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: UART_RXD */
/* Description: RXD register */

/* Bits 7..0 : RX data received in previous transfers, double buffered */
#define UART_RXD_RXD_Pos    ( 0UL )                        /*!< Position of RXD field. */
#define UART_RXD_RXD_Msk    ( 0xFFUL << UART_RXD_RXD_Pos ) /*!< Bit mask of RXD field. */

/* Register: UART_TXD */
/* Description: TXD register */

/* Bits 7..0 : TX data to be transferred */
#define UART_TXD_TXD_Pos    ( 0UL )                        /*!< Position of TXD field. */
#define UART_TXD_TXD_Msk    ( 0xFFUL << UART_TXD_TXD_Pos ) /*!< Bit mask of TXD field. */

/* Register: UART_BAUDRATE */
/* Description: Baud rate. Accuracy depends on the HFCLK source selected. */

/* Bits 31..0 : Baud rate */
#define UART_BAUDRATE_BAUDRATE_Pos           ( 0UL )                                        /*!< Position of BAUDRATE field. */
#define UART_BAUDRATE_BAUDRATE_Msk           ( 0xFFFFFFFFUL << UART_BAUDRATE_BAUDRATE_Pos ) /*!< Bit mask of BAUDRATE field. */
#define UART_BAUDRATE_BAUDRATE_Baud1200      ( 0x0004F000UL )                               /*!< 1200 baud (actual rate: 1205) */
#define UART_BAUDRATE_BAUDRATE_Baud2400      ( 0x0009D000UL )                               /*!< 2400 baud (actual rate: 2396) */
#define UART_BAUDRATE_BAUDRATE_Baud4800      ( 0x0013B000UL )                               /*!< 4800 baud (actual rate: 4808) */
#define UART_BAUDRATE_BAUDRATE_Baud9600      ( 0x00275000UL )                               /*!< 9600 baud (actual rate: 9598) */
#define UART_BAUDRATE_BAUDRATE_Baud14400     ( 0x003B0000UL )                               /*!< 14400 baud (actual rate: 14414) */
#define UART_BAUDRATE_BAUDRATE_Baud19200     ( 0x004EA000UL )                               /*!< 19200 baud (actual rate: 19208) */
#define UART_BAUDRATE_BAUDRATE_Baud28800     ( 0x0075F000UL )                               /*!< 28800 baud (actual rate: 28829) */
#define UART_BAUDRATE_BAUDRATE_Baud31250     ( 0x00800000UL )                               /*!< 31250 baud */
#define UART_BAUDRATE_BAUDRATE_Baud38400     ( 0x009D5000UL )                               /*!< 38400 baud (actual rate: 38462) */
#define UART_BAUDRATE_BAUDRATE_Baud56000     ( 0x00E50000UL )                               /*!< 56000 baud (actual rate: 55944) */
#define UART_BAUDRATE_BAUDRATE_Baud57600     ( 0x00EBF000UL )                               /*!< 57600 baud (actual rate: 57762) */
#define UART_BAUDRATE_BAUDRATE_Baud76800     ( 0x013A9000UL )                               /*!< 76800 baud (actual rate: 76923) */
#define UART_BAUDRATE_BAUDRATE_Baud115200    ( 0x01D7E000UL )                               /*!< 115200 baud (actual rate: 115942) */
#define UART_BAUDRATE_BAUDRATE_Baud230400    ( 0x03AFB000UL )                               /*!< 230400 baud (actual rate: 231884) */
#define UART_BAUDRATE_BAUDRATE_Baud250000    ( 0x04000000UL )                               /*!< 250000 baud */
#define UART_BAUDRATE_BAUDRATE_Baud460800    ( 0x075F7000UL )                               /*!< 460800 baud (actual rate: 470588) */
#define UART_BAUDRATE_BAUDRATE_Baud921600    ( 0x0EBED000UL )                               /*!< 921600 baud (actual rate: 941176) */
#define UART_BAUDRATE_BAUDRATE_Baud1M        ( 0x10000000UL )                               /*!< 1Mega baud */

/* Register: UART_CONFIG */
/* Description: Configuration of parity and hardware flow control */

/* Bit 4 : Stop bits */
#define UART_CONFIG_STOP_Pos           ( 4UL )                           /*!< Position of STOP field. */
#define UART_CONFIG_STOP_Msk           ( 0x1UL << UART_CONFIG_STOP_Pos ) /*!< Bit mask of STOP field. */
#define UART_CONFIG_STOP_One           ( 0UL )                           /*!< One stop bit */
#define UART_CONFIG_STOP_Two           ( 1UL )                           /*!< Two stop bits */

/* Bits 3..1 : Parity */
#define UART_CONFIG_PARITY_Pos         ( 1UL )                             /*!< Position of PARITY field. */
#define UART_CONFIG_PARITY_Msk         ( 0x7UL << UART_CONFIG_PARITY_Pos ) /*!< Bit mask of PARITY field. */
#define UART_CONFIG_PARITY_Excluded    ( 0x0UL )                           /*!< Exclude parity bit */
#define UART_CONFIG_PARITY_Included    ( 0x7UL )                           /*!< Include parity bit */

