FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: UARTE_EVENTS_ENDTX */
/* Description: Last TX byte transmitted */

/* Bit 0 : Last TX byte transmitted */
#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX_Pos             ( 0UL )                                          /*!< Position of EVENTS_ENDTX field. */
#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX_Msk             ( 0x1UL << UARTE_EVENTS_ENDTX_EVENTS_ENDTX_Pos ) /*!< Bit mask of EVENTS_ENDTX field. */
#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define UARTE_EVENTS_ENDTX_EVENTS_ENDTX_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: UARTE_EVENTS_ERROR */
/* Description: Error detected */

/* Bit 0 : Error detected */
#define UARTE_EVENTS_ERROR_EVENTS_ERROR_Pos             ( 0UL )                                          /*!< Position of EVENTS_ERROR field. */
#define UARTE_EVENTS_ERROR_EVENTS_ERROR_Msk             ( 0x1UL << UARTE_EVENTS_ERROR_EVENTS_ERROR_Pos ) /*!< Bit mask of EVENTS_ERROR field. */
#define UARTE_EVENTS_ERROR_EVENTS_ERROR_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define UARTE_EVENTS_ERROR_EVENTS_ERROR_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: UARTE_EVENTS_RXTO */
/* Description: Receiver timeout */

/* Bit 0 : Receiver timeout */
#define UARTE_EVENTS_RXTO_EVENTS_RXTO_Pos             ( 0UL )                                        /*!< Position of EVENTS_RXTO field. */
#define UARTE_EVENTS_RXTO_EVENTS_RXTO_Msk             ( 0x1UL << UARTE_EVENTS_RXTO_EVENTS_RXTO_Pos ) /*!< Bit mask of EVENTS_RXTO field. */
#define UARTE_EVENTS_RXTO_EVENTS_RXTO_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define UARTE_EVENTS_RXTO_EVENTS_RXTO_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: UARTE_EVENTS_RXSTARTED */
/* Description: UART receiver has started */

/* Bit 0 : UART receiver has started */
#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos             ( 0UL )                                                  /*!< Position of EVENTS_RXSTARTED field. */
#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Msk             ( 0x1UL << UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos ) /*!< Bit mask of EVENTS_RXSTARTED field. */
#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define UARTE_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: UARTE_EVENTS_TXSTARTED */
/* Description: UART transmitter has started */

/* Bit 0 : UART transmitter has started */
#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos             ( 0UL )                                                  /*!< Position of EVENTS_TXSTARTED field. */
#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Msk             ( 0x1UL << UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos ) /*!< Bit mask of EVENTS_TXSTARTED field. */
#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define UARTE_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: UARTE_EVENTS_TXSTOPPED */
/* Description: Transmitter stopped */

/* Bit 0 : Transmitter stopped */
#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Pos             ( 0UL )                                                  /*!< Position of EVENTS_TXSTOPPED field. */
#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Msk             ( 0x1UL << UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Pos ) /*!< Bit mask of EVENTS_TXSTOPPED field. */
#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: UARTE_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 6 : Shortcut between event ENDRX and task STOPRX */
#define UARTE_SHORTS_ENDRX_STOPRX_Pos          ( 6UL )                                    /*!< Position of ENDRX_STOPRX field. */
#define UARTE_SHORTS_ENDRX_STOPRX_Msk          ( 0x1UL << UARTE_SHORTS_ENDRX_STOPRX_Pos ) /*!< Bit mask of ENDRX_STOPRX field. */
#define UARTE_SHORTS_ENDRX_STOPRX_Disabled     ( 0UL )                                    /*!< Disable shortcut */
#define UARTE_SHORTS_ENDRX_STOPRX_Enabled      ( 1UL )                                    /*!< Enable shortcut */

/* Bit 5 : Shortcut between event ENDRX and task STARTRX */
#define UARTE_SHORTS_ENDRX_STARTRX_Pos         ( 5UL )                                     /*!< Position of ENDRX_STARTRX field. */
#define UARTE_SHORTS_ENDRX_STARTRX_Msk         ( 0x1UL << UARTE_SHORTS_ENDRX_STARTRX_Pos ) /*!< Bit mask of ENDRX_STARTRX field. */
#define UARTE_SHORTS_ENDRX_STARTRX_Disabled    ( 0UL )                                     /*!< Disable shortcut */
#define UARTE_SHORTS_ENDRX_STARTRX_Enabled     ( 1UL )                                     /*!< Enable shortcut */

/* Register: UARTE_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 22 : Enable or disable interrupt for event TXSTOPPED */
#define UARTE_INTEN_TXSTOPPED_Pos         ( 22UL )                               /*!< Position of TXSTOPPED field. */
#define UARTE_INTEN_TXSTOPPED_Msk         ( 0x1UL << UARTE_INTEN_TXSTOPPED_Pos ) /*!< Bit mask of TXSTOPPED field. */
#define UARTE_INTEN_TXSTOPPED_Disabled    ( 0UL )                                /*!< Disable */
#define UARTE_INTEN_TXSTOPPED_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 20 : Enable or disable interrupt for event TXSTARTED */
#define UARTE_INTEN_TXSTARTED_Pos         ( 20UL )                               /*!< Position of TXSTARTED field. */
#define UARTE_INTEN_TXSTARTED_Msk         ( 0x1UL << UARTE_INTEN_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define UARTE_INTEN_TXSTARTED_Disabled    ( 0UL )                                /*!< Disable */
#define UARTE_INTEN_TXSTARTED_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 19 : Enable or disable interrupt for event RXSTARTED */
#define UARTE_INTEN_RXSTARTED_Pos         ( 19UL )                               /*!< Position of RXSTARTED field. */
#define UARTE_INTEN_RXSTARTED_Msk         ( 0x1UL << UARTE_INTEN_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define UARTE_INTEN_RXSTARTED_Disabled    ( 0UL )                                /*!< Disable */
#define UARTE_INTEN_RXSTARTED_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 17 : Enable or disable interrupt for event RXTO */
#define UARTE_INTEN_RXTO_Pos              ( 17UL )                          /*!< Position of RXTO field. */
#define UARTE_INTEN_RXTO_Msk              ( 0x1UL << UARTE_INTEN_RXTO_Pos ) /*!< Bit mask of RXTO field. */
#define UARTE_INTEN_RXTO_Disabled         ( 0UL )                           /*!< Disable */
#define UARTE_INTEN_RXTO_Enabled          ( 1UL )                           /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event ERROR */
#define UARTE_INTEN_ERROR_Pos             ( 9UL )                            /*!< Position of ERROR field. */
#define UARTE_INTEN_ERROR_Msk             ( 0x1UL << UARTE_INTEN_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define UARTE_INTEN_ERROR_Disabled        ( 0UL )                            /*!< Disable */
#define UARTE_INTEN_ERROR_Enabled         ( 1UL )                            /*!< Enable */

