FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 1 : Write '1' to disable interrupt for event NCTS */
#define UARTE_INTENCLR_NCTS_Pos              ( 1UL )                              /*!< Position of NCTS field. */
#define UARTE_INTENCLR_NCTS_Msk              ( 0x1UL << UARTE_INTENCLR_NCTS_Pos ) /*!< Bit mask of NCTS field. */
#define UARTE_INTENCLR_NCTS_Disabled         ( 0UL )                              /*!< Read: Disabled */
#define UARTE_INTENCLR_NCTS_Enabled          ( 1UL )                              /*!< Read: Enabled */
#define UARTE_INTENCLR_NCTS_Clear            ( 1UL )                              /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event CTS */
#define UARTE_INTENCLR_CTS_Pos               ( 0UL )                             /*!< Position of CTS field. */
#define UARTE_INTENCLR_CTS_Msk               ( 0x1UL << UARTE_INTENCLR_CTS_Pos ) /*!< Bit mask of CTS field. */
#define UARTE_INTENCLR_CTS_Disabled          ( 0UL )                             /*!< Read: Disabled */
#define UARTE_INTENCLR_CTS_Enabled           ( 1UL )                             /*!< Read: Enabled */
#define UARTE_INTENCLR_CTS_Clear             ( 1UL )                             /*!< Disable */

/* Register: UARTE_ERRORSRC */
/* Description: Error source This register is read/write one to clear. */

/* Bit 3 : Break condition */
#define UARTE_ERRORSRC_BREAK_Pos             ( 3UL )                               /*!< Position of BREAK field. */
#define UARTE_ERRORSRC_BREAK_Msk             ( 0x1UL << UARTE_ERRORSRC_BREAK_Pos ) /*!< Bit mask of BREAK field. */
#define UARTE_ERRORSRC_BREAK_NotPresent      ( 0UL )                               /*!< Read: error not present */
#define UARTE_ERRORSRC_BREAK_Present         ( 1UL )                               /*!< Read: error present */

/* Bit 2 : Framing error occurred */
#define UARTE_ERRORSRC_FRAMING_Pos           ( 2UL )                                 /*!< Position of FRAMING field. */
#define UARTE_ERRORSRC_FRAMING_Msk           ( 0x1UL << UARTE_ERRORSRC_FRAMING_Pos ) /*!< Bit mask of FRAMING field. */
#define UARTE_ERRORSRC_FRAMING_NotPresent    ( 0UL )                                 /*!< Read: error not present */
#define UARTE_ERRORSRC_FRAMING_Present       ( 1UL )                                 /*!< Read: error present */

/* Bit 1 : Parity error */
#define UARTE_ERRORSRC_PARITY_Pos            ( 1UL )                                /*!< Position of PARITY field. */
#define UARTE_ERRORSRC_PARITY_Msk            ( 0x1UL << UARTE_ERRORSRC_PARITY_Pos ) /*!< Bit mask of PARITY field. */
#define UARTE_ERRORSRC_PARITY_NotPresent     ( 0UL )                                /*!< Read: error not present */
#define UARTE_ERRORSRC_PARITY_Present        ( 1UL )                                /*!< Read: error present */

/* Bit 0 : Overrun error */
#define UARTE_ERRORSRC_OVERRUN_Pos           ( 0UL )                                 /*!< Position of OVERRUN field. */
#define UARTE_ERRORSRC_OVERRUN_Msk           ( 0x1UL << UARTE_ERRORSRC_OVERRUN_Pos ) /*!< Bit mask of OVERRUN field. */
#define UARTE_ERRORSRC_OVERRUN_NotPresent    ( 0UL )                                 /*!< Read: error not present */
#define UARTE_ERRORSRC_OVERRUN_Present       ( 1UL )                                 /*!< Read: error present */

/* Register: UARTE_ENABLE */
/* Description: Enable UART */

/* Bits 3..0 : Enable or disable UARTE */
#define UARTE_ENABLE_ENABLE_Pos         ( 0UL )                              /*!< Position of ENABLE field. */
#define UARTE_ENABLE_ENABLE_Msk         ( 0xFUL << UARTE_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define UARTE_ENABLE_ENABLE_Disabled    ( 0UL )                              /*!< Disable UARTE */
#define UARTE_ENABLE_ENABLE_Enabled     ( 8UL )                              /*!< Enable UARTE */

/* Register: UARTE_PSEL_RTS */
/* Description: Pin select for RTS signal */

/* Bit 31 : Connection */
#define UARTE_PSEL_RTS_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define UARTE_PSEL_RTS_CONNECT_Msk             ( 0x1UL << UARTE_PSEL_RTS_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define UARTE_PSEL_RTS_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define UARTE_PSEL_RTS_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define UARTE_PSEL_RTS_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define UARTE_PSEL_RTS_PIN_Msk                 ( 0x1FUL << UARTE_PSEL_RTS_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: UARTE_PSEL_TXD */
/* Description: Pin select for TXD signal */

/* Bit 31 : Connection */
#define UARTE_PSEL_TXD_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define UARTE_PSEL_TXD_CONNECT_Msk             ( 0x1UL << UARTE_PSEL_TXD_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define UARTE_PSEL_TXD_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define UARTE_PSEL_TXD_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define UARTE_PSEL_TXD_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define UARTE_PSEL_TXD_PIN_Msk                 ( 0x1FUL << UARTE_PSEL_TXD_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: UARTE_PSEL_CTS */
/* Description: Pin select for CTS signal */

/* Bit 31 : Connection */
#define UARTE_PSEL_CTS_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define UARTE_PSEL_CTS_CONNECT_Msk             ( 0x1UL << UARTE_PSEL_CTS_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define UARTE_PSEL_CTS_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define UARTE_PSEL_CTS_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define UARTE_PSEL_CTS_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define UARTE_PSEL_CTS_PIN_Msk                 ( 0x1FUL << UARTE_PSEL_CTS_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: UARTE_PSEL_RXD */
/* Description: Pin select for RXD signal */

/* Bit 31 : Connection */
#define UARTE_PSEL_RXD_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define UARTE_PSEL_RXD_CONNECT_Msk             ( 0x1UL << UARTE_PSEL_RXD_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define UARTE_PSEL_RXD_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define UARTE_PSEL_RXD_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define UARTE_PSEL_RXD_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define UARTE_PSEL_RXD_PIN_Msk                 ( 0x1FUL << UARTE_PSEL_RXD_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: UARTE_BAUDRATE */
/* Description: Baud rate. Accuracy depends on the HFCLK source selected. */

/* Bits 31..0 : Baud rate */
#define UARTE_BAUDRATE_BAUDRATE_Pos           ( 0UL )                                         /*!< Position of BAUDRATE field. */
#define UARTE_BAUDRATE_BAUDRATE_Msk           ( 0xFFFFFFFFUL << UARTE_BAUDRATE_BAUDRATE_Pos ) /*!< Bit mask of BAUDRATE field. */
#define UARTE_BAUDRATE_BAUDRATE_Baud1200      ( 0x0004F000UL )                                /*!< 1200 baud (actual rate: 1205) */
#define UARTE_BAUDRATE_BAUDRATE_Baud2400      ( 0x0009D000UL )                                /*!< 2400 baud (actual rate: 2396) */
#define UARTE_BAUDRATE_BAUDRATE_Baud4800      ( 0x0013B000UL )                                /*!< 4800 baud (actual rate: 4808) */
#define UARTE_BAUDRATE_BAUDRATE_Baud9600      ( 0x00275000UL )                                /*!< 9600 baud (actual rate: 9598) */
#define UARTE_BAUDRATE_BAUDRATE_Baud14400     ( 0x003AF000UL )                                /*!< 14400 baud (actual rate: 14401) */
#define UARTE_BAUDRATE_BAUDRATE_Baud19200     ( 0x004EA000UL )                                /*!< 19200 baud (actual rate: 19208) */
#define UARTE_BAUDRATE_BAUDRATE_Baud28800     ( 0x0075C000UL )                                /*!< 28800 baud (actual rate: 28777) */
#define UARTE_BAUDRATE_BAUDRATE_Baud31250     ( 0x00800000UL )                                /*!< 31250 baud */
#define UARTE_BAUDRATE_BAUDRATE_Baud38400     ( 0x009D0000UL )                                /*!< 38400 baud (actual rate: 38369) */
#define UARTE_BAUDRATE_BAUDRATE_Baud56000     ( 0x00E50000UL )                                /*!< 56000 baud (actual rate: 55944) */
#define UARTE_BAUDRATE_BAUDRATE_Baud57600     ( 0x00EB0000UL )                                /*!< 57600 baud (actual rate: 57554) */
#define UARTE_BAUDRATE_BAUDRATE_Baud76800     ( 0x013A9000UL )                                /*!< 76800 baud (actual rate: 76923) */
#define UARTE_BAUDRATE_BAUDRATE_Baud115200    ( 0x01D60000UL )                                /*!< 115200 baud (actual rate: 115108) */
#define UARTE_BAUDRATE_BAUDRATE_Baud230400    ( 0x03B00000UL )                                /*!< 230400 baud (actual rate: 231884) */
#define UARTE_BAUDRATE_BAUDRATE_Baud250000    ( 0x04000000UL )                                /*!< 250000 baud */
#define UARTE_BAUDRATE_BAUDRATE_Baud460800    ( 0x07400000UL )                                /*!< 460800 baud (actual rate: 457143) */
#define UARTE_BAUDRATE_BAUDRATE_Baud921600    ( 0x0F000000UL )                                /*!< 921600 baud (actual rate: 941176) */
#define UARTE_BAUDRATE_BAUDRATE_Baud1M        ( 0x10000000UL )                                /*!< 1 megabaud */

/* Register: UARTE_RXD_PTR */
/* Description: Data pointer */

