FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bits 31..0 : Data pointer */
#define UARTE_RXD_PTR_PTR_Pos    ( 0UL )                                   /*!< Position of PTR field. */
#define UARTE_RXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << UARTE_RXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: UARTE_RXD_MAXCNT */
/* Description: Maximum number of bytes in receive buffer */

/* Bits 9..0 : Maximum number of bytes in receive buffer */
#define UARTE_RXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define UARTE_RXD_MAXCNT_MAXCNT_Msk    ( 0x3FFUL << UARTE_RXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: UARTE_RXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 9..0 : Number of bytes transferred in the last transaction */
#define UARTE_RXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                    /*!< Position of AMOUNT field. */
#define UARTE_RXD_AMOUNT_AMOUNT_Msk    ( 0x3FFUL << UARTE_RXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: UARTE_TXD_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define UARTE_TXD_PTR_PTR_Pos    ( 0UL )                                   /*!< Position of PTR field. */
#define UARTE_TXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << UARTE_TXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: UARTE_TXD_MAXCNT */
/* Description: Maximum number of bytes in transmit buffer */

/* Bits 9..0 : Maximum number of bytes in transmit buffer */
#define UARTE_TXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define UARTE_TXD_MAXCNT_MAXCNT_Msk    ( 0x3FFUL << UARTE_TXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: UARTE_TXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 9..0 : Number of bytes transferred in the last transaction */
#define UARTE_TXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                    /*!< Position of AMOUNT field. */
#define UARTE_TXD_AMOUNT_AMOUNT_Msk    ( 0x3FFUL << UARTE_TXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: UARTE_CONFIG */
/* Description: Configuration of parity and hardware flow control */

/* Bit 4 : Stop bits */
#define UARTE_CONFIG_STOP_Pos           ( 4UL )                            /*!< Position of STOP field. */
#define UARTE_CONFIG_STOP_Msk           ( 0x1UL << UARTE_CONFIG_STOP_Pos ) /*!< Bit mask of STOP field. */
#define UARTE_CONFIG_STOP_One           ( 0UL )                            /*!< One stop bit */
#define UARTE_CONFIG_STOP_Two           ( 1UL )                            /*!< Two stop bits */

/* Bits 3..1 : Parity */
#define UARTE_CONFIG_PARITY_Pos         ( 1UL )                              /*!< Position of PARITY field. */
#define UARTE_CONFIG_PARITY_Msk         ( 0x7UL << UARTE_CONFIG_PARITY_Pos ) /*!< Bit mask of PARITY field. */
#define UARTE_CONFIG_PARITY_Excluded    ( 0x0UL )                            /*!< Exclude parity bit */
#define UARTE_CONFIG_PARITY_Included    ( 0x7UL )                            /*!< Include even parity bit */

/* Bit 0 : Hardware flow control */
#define UARTE_CONFIG_HWFC_Pos           ( 0UL )                            /*!< Position of HWFC field. */
#define UARTE_CONFIG_HWFC_Msk           ( 0x1UL << UARTE_CONFIG_HWFC_Pos ) /*!< Bit mask of HWFC field. */
#define UARTE_CONFIG_HWFC_Disabled      ( 0UL )                            /*!< Disabled */
#define UARTE_CONFIG_HWFC_Enabled       ( 1UL )                            /*!< Enabled */


/* Peripheral: UICR */
/* Description: User information configuration registers */

/* Register: UICR_NRFFW */
/* Description: Description collection: Reserved for Nordic firmware design */

/* Bits 31..0 : Reserved for Nordic firmware design */
#define UICR_NRFFW_NRFFW_Pos    ( 0UL )                                  /*!< Position of NRFFW field. */
#define UICR_NRFFW_NRFFW_Msk    ( 0xFFFFFFFFUL << UICR_NRFFW_NRFFW_Pos ) /*!< Bit mask of NRFFW field. */

/* Register: UICR_NRFHW */
/* Description: Description collection: Reserved for Nordic hardware design */

/* Bits 31..0 : Reserved for Nordic hardware design */
#define UICR_NRFHW_NRFHW_Pos    ( 0UL )                                  /*!< Position of NRFHW field. */
#define UICR_NRFHW_NRFHW_Msk    ( 0xFFFFFFFFUL << UICR_NRFHW_NRFHW_Pos ) /*!< Bit mask of NRFHW field. */

/* Register: UICR_CUSTOMER */
/* Description: Description collection: Reserved for customer */

/* Bits 31..0 : Reserved for customer */
#define UICR_CUSTOMER_CUSTOMER_Pos    ( 0UL )                                        /*!< Position of CUSTOMER field. */
#define UICR_CUSTOMER_CUSTOMER_Msk    ( 0xFFFFFFFFUL << UICR_CUSTOMER_CUSTOMER_Pos ) /*!< Bit mask of CUSTOMER field. */

/* Register: UICR_NRFMDK */
/* Description: Description collection: Reserved for Nordic MDK */

/* Bits 31..0 : Reserved for Nordic MDK */
#define UICR_NRFMDK_NRFMDK_Pos    ( 0UL )                                    /*!< Position of NRFMDK field. */
#define UICR_NRFMDK_NRFMDK_Msk    ( 0xFFFFFFFFUL << UICR_NRFMDK_NRFMDK_Pos ) /*!< Bit mask of NRFMDK field. */

/* Register: UICR_PSELRESET */
/* Description: Description collection: Mapping of the nRESET function (see POWER chapter for details) */

/* Bit 31 : Connection */
#define UICR_PSELRESET_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define UICR_PSELRESET_CONNECT_Msk             ( 0x1UL << UICR_PSELRESET_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define UICR_PSELRESET_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define UICR_PSELRESET_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : GPIO pin number onto which nRESET is exposed */
#define UICR_PSELRESET_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define UICR_PSELRESET_PIN_Msk                 ( 0x1FUL << UICR_PSELRESET_PIN_Pos ) /*!< Bit mask of PIN field. */

