FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Register: UICR_APPROTECT */
/* Description: Access port protection */

/* Bits 7..0 : Enable or disable access port protection. */
#define UICR_APPROTECT_PALL_Pos           ( 0UL )                               /*!< Position of PALL field. */
#define UICR_APPROTECT_PALL_Msk           ( 0xFFUL << UICR_APPROTECT_PALL_Pos ) /*!< Bit mask of PALL field. */
#define UICR_APPROTECT_PALL_Enabled       ( 0x00UL )                            /*!< Enable */
#define UICR_APPROTECT_PALL_HwDisabled    ( 0x5AUL )                            /*!< Hardware disable of access port protection for devices where access port protection is controlled by hardware and software */
#define UICR_APPROTECT_PALL_Disabled      ( 0xFFUL )                            /*!< Hardware disable of access port protection for devices where access port protection is controlled by hardware */


/* Peripheral: WDT */
/* Description: Watchdog Timer */

/* Register: WDT_TASKS_START */
/* Description: Start the watchdog */

/* Bit 0 : Start the watchdog */
#define WDT_TASKS_START_TASKS_START_Pos        ( 0UL )                                      /*!< Position of TASKS_START field. */
#define WDT_TASKS_START_TASKS_START_Msk        ( 0x1UL << WDT_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define WDT_TASKS_START_TASKS_START_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: WDT_EVENTS_TIMEOUT */
/* Description: Watchdog timeout */

/* Bit 0 : Watchdog timeout */
#define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Pos             ( 0UL )                                            /*!< Position of EVENTS_TIMEOUT field. */
#define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Msk             ( 0x1UL << WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Pos ) /*!< Bit mask of EVENTS_TIMEOUT field. */
#define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: WDT_INTENSET */
/* Description: Enable interrupt */

/* Bit 0 : Write '1' to enable interrupt for event TIMEOUT */
#define WDT_INTENSET_TIMEOUT_Pos         ( 0UL )                               /*!< Position of TIMEOUT field. */
#define WDT_INTENSET_TIMEOUT_Msk         ( 0x1UL << WDT_INTENSET_TIMEOUT_Pos ) /*!< Bit mask of TIMEOUT field. */
#define WDT_INTENSET_TIMEOUT_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define WDT_INTENSET_TIMEOUT_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define WDT_INTENSET_TIMEOUT_Set         ( 1UL )                               /*!< Enable */

/* Register: WDT_INTENCLR */
/* Description: Disable interrupt */

/* Bit 0 : Write '1' to disable interrupt for event TIMEOUT */
#define WDT_INTENCLR_TIMEOUT_Pos         ( 0UL )                               /*!< Position of TIMEOUT field. */
#define WDT_INTENCLR_TIMEOUT_Msk         ( 0x1UL << WDT_INTENCLR_TIMEOUT_Pos ) /*!< Bit mask of TIMEOUT field. */
#define WDT_INTENCLR_TIMEOUT_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define WDT_INTENCLR_TIMEOUT_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define WDT_INTENCLR_TIMEOUT_Clear       ( 1UL )                               /*!< Disable */

/* Register: WDT_RUNSTATUS */
/* Description: Run status */

/* Bit 0 : Indicates whether or not the watchdog is running */
#define WDT_RUNSTATUS_RUNSTATUS_Pos           ( 0UL )                                  /*!< Position of RUNSTATUS field. */
#define WDT_RUNSTATUS_RUNSTATUS_Msk           ( 0x1UL << WDT_RUNSTATUS_RUNSTATUS_Pos ) /*!< Bit mask of RUNSTATUS field. */
#define WDT_RUNSTATUS_RUNSTATUS_NotRunning    ( 0UL )                                  /*!< Watchdog not running */
#define WDT_RUNSTATUS_RUNSTATUS_Running       ( 1UL )                                  /*!< Watchdog is running */

/* Register: WDT_REQSTATUS */
/* Description: Request status */

/* Bit 7 : Request status for RR[7] register */
#define WDT_REQSTATUS_RR7_Pos                      ( 7UL )                            /*!< Position of RR7 field. */
#define WDT_REQSTATUS_RR7_Msk                      ( 0x1UL << WDT_REQSTATUS_RR7_Pos ) /*!< Bit mask of RR7 field. */
#define WDT_REQSTATUS_RR7_DisabledOrRequested      ( 0UL )                            /*!< RR[7] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR7_EnabledAndUnrequested    ( 1UL )                            /*!< RR[7] register is enabled, and are not yet requesting reload */

/* Bit 6 : Request status for RR[6] register */
#define WDT_REQSTATUS_RR6_Pos                      ( 6UL )                            /*!< Position of RR6 field. */
#define WDT_REQSTATUS_RR6_Msk                      ( 0x1UL << WDT_REQSTATUS_RR6_Pos ) /*!< Bit mask of RR6 field. */
#define WDT_REQSTATUS_RR6_DisabledOrRequested      ( 0UL )                            /*!< RR[6] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR6_EnabledAndUnrequested    ( 1UL )                            /*!< RR[6] register is enabled, and are not yet requesting reload */

/* Bit 5 : Request status for RR[5] register */
#define WDT_REQSTATUS_RR5_Pos                      ( 5UL )                            /*!< Position of RR5 field. */
#define WDT_REQSTATUS_RR5_Msk                      ( 0x1UL << WDT_REQSTATUS_RR5_Pos ) /*!< Bit mask of RR5 field. */
#define WDT_REQSTATUS_RR5_DisabledOrRequested      ( 0UL )                            /*!< RR[5] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR5_EnabledAndUnrequested    ( 1UL )                            /*!< RR[5] register is enabled, and are not yet requesting reload */

/* Bit 4 : Request status for RR[4] register */
#define WDT_REQSTATUS_RR4_Pos                      ( 4UL )                            /*!< Position of RR4 field. */
#define WDT_REQSTATUS_RR4_Msk                      ( 0x1UL << WDT_REQSTATUS_RR4_Pos ) /*!< Bit mask of RR4 field. */
#define WDT_REQSTATUS_RR4_DisabledOrRequested      ( 0UL )                            /*!< RR[4] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR4_EnabledAndUnrequested    ( 1UL )                            /*!< RR[4] register is enabled, and are not yet requesting reload */

/* Bit 3 : Request status for RR[3] register */
#define WDT_REQSTATUS_RR3_Pos                      ( 3UL )                            /*!< Position of RR3 field. */
#define WDT_REQSTATUS_RR3_Msk                      ( 0x1UL << WDT_REQSTATUS_RR3_Pos ) /*!< Bit mask of RR3 field. */
#define WDT_REQSTATUS_RR3_DisabledOrRequested      ( 0UL )                            /*!< RR[3] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR3_EnabledAndUnrequested    ( 1UL )                            /*!< RR[3] register is enabled, and are not yet requesting reload */

