FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52805_bitfields.h
/* Bit 2 : Request status for RR[2] register */
#define WDT_REQSTATUS_RR2_Pos                      ( 2UL )                            /*!< Position of RR2 field. */
#define WDT_REQSTATUS_RR2_Msk                      ( 0x1UL << WDT_REQSTATUS_RR2_Pos ) /*!< Bit mask of RR2 field. */
#define WDT_REQSTATUS_RR2_DisabledOrRequested      ( 0UL )                            /*!< RR[2] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR2_EnabledAndUnrequested    ( 1UL )                            /*!< RR[2] register is enabled, and are not yet requesting reload */

/* Bit 1 : Request status for RR[1] register */
#define WDT_REQSTATUS_RR1_Pos                      ( 1UL )                            /*!< Position of RR1 field. */
#define WDT_REQSTATUS_RR1_Msk                      ( 0x1UL << WDT_REQSTATUS_RR1_Pos ) /*!< Bit mask of RR1 field. */
#define WDT_REQSTATUS_RR1_DisabledOrRequested      ( 0UL )                            /*!< RR[1] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR1_EnabledAndUnrequested    ( 1UL )                            /*!< RR[1] register is enabled, and are not yet requesting reload */

/* Bit 0 : Request status for RR[0] register */
#define WDT_REQSTATUS_RR0_Pos                      ( 0UL )                            /*!< Position of RR0 field. */
#define WDT_REQSTATUS_RR0_Msk                      ( 0x1UL << WDT_REQSTATUS_RR0_Pos ) /*!< Bit mask of RR0 field. */
#define WDT_REQSTATUS_RR0_DisabledOrRequested      ( 0UL )                            /*!< RR[0] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR0_EnabledAndUnrequested    ( 1UL )                            /*!< RR[0] register is enabled, and are not yet requesting reload */

/* Register: WDT_CRV */
/* Description: Counter reload value */

/* Bits 31..0 : Counter reload value in number of cycles of the 32.768 kHz clock */
#define WDT_CRV_CRV_Pos    ( 0UL )                             /*!< Position of CRV field. */
#define WDT_CRV_CRV_Msk    ( 0xFFFFFFFFUL << WDT_CRV_CRV_Pos ) /*!< Bit mask of CRV field. */

/* Register: WDT_RREN */
/* Description: Enable register for reload request registers */

/* Bit 7 : Enable or disable RR[7] register */
#define WDT_RREN_RR7_Pos         ( 7UL )                       /*!< Position of RR7 field. */
#define WDT_RREN_RR7_Msk         ( 0x1UL << WDT_RREN_RR7_Pos ) /*!< Bit mask of RR7 field. */
#define WDT_RREN_RR7_Disabled    ( 0UL )                       /*!< Disable RR[7] register */
#define WDT_RREN_RR7_Enabled     ( 1UL )                       /*!< Enable RR[7] register */

/* Bit 6 : Enable or disable RR[6] register */
#define WDT_RREN_RR6_Pos         ( 6UL )                       /*!< Position of RR6 field. */
#define WDT_RREN_RR6_Msk         ( 0x1UL << WDT_RREN_RR6_Pos ) /*!< Bit mask of RR6 field. */
#define WDT_RREN_RR6_Disabled    ( 0UL )                       /*!< Disable RR[6] register */
#define WDT_RREN_RR6_Enabled     ( 1UL )                       /*!< Enable RR[6] register */

/* Bit 5 : Enable or disable RR[5] register */
#define WDT_RREN_RR5_Pos         ( 5UL )                       /*!< Position of RR5 field. */
#define WDT_RREN_RR5_Msk         ( 0x1UL << WDT_RREN_RR5_Pos ) /*!< Bit mask of RR5 field. */
#define WDT_RREN_RR5_Disabled    ( 0UL )                       /*!< Disable RR[5] register */
#define WDT_RREN_RR5_Enabled     ( 1UL )                       /*!< Enable RR[5] register */

/* Bit 4 : Enable or disable RR[4] register */
#define WDT_RREN_RR4_Pos         ( 4UL )                       /*!< Position of RR4 field. */
#define WDT_RREN_RR4_Msk         ( 0x1UL << WDT_RREN_RR4_Pos ) /*!< Bit mask of RR4 field. */
#define WDT_RREN_RR4_Disabled    ( 0UL )                       /*!< Disable RR[4] register */
#define WDT_RREN_RR4_Enabled     ( 1UL )                       /*!< Enable RR[4] register */

/* Bit 3 : Enable or disable RR[3] register */
#define WDT_RREN_RR3_Pos         ( 3UL )                       /*!< Position of RR3 field. */
#define WDT_RREN_RR3_Msk         ( 0x1UL << WDT_RREN_RR3_Pos ) /*!< Bit mask of RR3 field. */
#define WDT_RREN_RR3_Disabled    ( 0UL )                       /*!< Disable RR[3] register */
#define WDT_RREN_RR3_Enabled     ( 1UL )                       /*!< Enable RR[3] register */

/* Bit 2 : Enable or disable RR[2] register */
#define WDT_RREN_RR2_Pos         ( 2UL )                       /*!< Position of RR2 field. */
#define WDT_RREN_RR2_Msk         ( 0x1UL << WDT_RREN_RR2_Pos ) /*!< Bit mask of RR2 field. */
#define WDT_RREN_RR2_Disabled    ( 0UL )                       /*!< Disable RR[2] register */
#define WDT_RREN_RR2_Enabled     ( 1UL )                       /*!< Enable RR[2] register */

/* Bit 1 : Enable or disable RR[1] register */
#define WDT_RREN_RR1_Pos         ( 1UL )                       /*!< Position of RR1 field. */
#define WDT_RREN_RR1_Msk         ( 0x1UL << WDT_RREN_RR1_Pos ) /*!< Bit mask of RR1 field. */
#define WDT_RREN_RR1_Disabled    ( 0UL )                       /*!< Disable RR[1] register */
#define WDT_RREN_RR1_Enabled     ( 1UL )                       /*!< Enable RR[1] register */

/* Bit 0 : Enable or disable RR[0] register */
#define WDT_RREN_RR0_Pos         ( 0UL )                       /*!< Position of RR0 field. */
#define WDT_RREN_RR0_Msk         ( 0x1UL << WDT_RREN_RR0_Pos ) /*!< Bit mask of RR0 field. */
#define WDT_RREN_RR0_Disabled    ( 0UL )                       /*!< Disable RR[0] register */
#define WDT_RREN_RR0_Enabled     ( 1UL )                       /*!< Enable RR[0] register */

/* Register: WDT_CONFIG */
/* Description: Configuration register */

/* Bit 3 : Configure the watchdog to either be paused, or kept running, while the CPU is halted by the debugger */
#define WDT_CONFIG_HALT_Pos       ( 3UL )                          /*!< Position of HALT field. */
#define WDT_CONFIG_HALT_Msk       ( 0x1UL << WDT_CONFIG_HALT_Pos ) /*!< Bit mask of HALT field. */
#define WDT_CONFIG_HALT_Pause     ( 0UL )                          /*!< Pause watchdog while the CPU is halted by the debugger */
#define WDT_CONFIG_HALT_Run       ( 1UL )                          /*!< Keep the watchdog running while the CPU is halted by the debugger */

/* Bit 0 : Configure the watchdog to either be paused, or kept running, while the CPU is sleeping */
#define WDT_CONFIG_SLEEP_Pos      ( 0UL )                           /*!< Position of SLEEP field. */
#define WDT_CONFIG_SLEEP_Msk      ( 0x1UL << WDT_CONFIG_SLEEP_Pos ) /*!< Bit mask of SLEEP field. */
#define WDT_CONFIG_SLEEP_Pause    ( 0UL )                           /*!< Pause watchdog while the CPU is sleeping */
#define WDT_CONFIG_SLEEP_Run      ( 1UL )                           /*!< Keep the watchdog running while the CPU is sleeping */

/* Register: WDT_RR */
/* Description: Description collection: Reload request n */

/* Bits 31..0 : Reload request register */
#define WDT_RR_RR_Pos       ( 0UL )                           /*!< Position of RR field. */
#define WDT_RR_RR_Msk       ( 0xFFFFFFFFUL << WDT_RR_RR_Pos ) /*!< Bit mask of RR field. */
#define WDT_RR_RR_Reload    ( 0x6E524635UL )                  /*!< Value to request a reload of the watchdog timer */


/*lint --flb "Leave library region" */
#endif /* ifndef __NRF52805_BITS_H */
